{
    "name": "La Nueva Colombia",
    "place_id": "ChIJvdHEAphfwokRVYkBaEfrwlI",
    "grid": "QN3",
    "address": "91-07 31st Ave, East Elmhurst, NY 11369, USA",
    "rating": 3,
    "user_ratings_total": 1850,
    "phone_number": "(718) 396-3399",
    "reviews": [
        {
            "date": "1주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s4NVlXeExUSG96UldKTk5tZHFURGR5VFRodk9YYxAB",
            "text": "El servicio muy bueno y rapido la comida deliciosa la bebida 100 de 10 todo muy rico nos encanto todo . Lo recomiendo al 100% sin Duda volveremos"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pORFpYRlBNbWxWZFZOcmVuZDFkRzVIV1c1SGFWRRAB",
            "text": "l love it here l will come again"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5c2VtdHVWVW94WDJ0cmFqWk1TMmRHVTFabE1rRRAB",
            "text": "Compartí con unos amigos y el ambiente muy acogedor , la comida muy buen precio por todo lo que sirven. La chica y muchacho muy buena atención volveré !!!"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xMmFXZGlSVU54ZEVKWGRYRm5VRlpLWmpaek5VRRAB",
            "text": "La comida  y bebidas muy Ricasy la atencion de las muchachas y muchacho muy buena volvere!!!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNMldFZFhUVE5LTW5wcWJrWjRSMGh0VlhOdFNXYxAB",
            "text": "Food is great but especially the drinks 👍🏻👍🏻"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204d2RXa3lObFp3U0VWcU5rMTZVRE55UVMxVFJXYxAB",
            "text": "Food was delicious service as well\nDelicious drinks"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25NM1ZIQnhVV0pIZFdaVlNrMVZOa1J3WjJ0V1kzYxAB",
            "text": "Hola el día de hoy fuimos a pasar un rato amigable con mi amiga y empezando las chikas  cero amables prácticamente nos dejaron la bebidas hay ni nos hablaron se demoraron mucho en tomar la orden pedimos un apetaizer las empanadas incomibles súper duras y nunka más se acercaron a tomar el resto de la orden nunka más se acercaron tuvimos q pedir la cuenta primera y última vez en ese lugar lástima y demasiadas cucarachas en el baño 😞😞😞"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213NFNraHlSV3RGU2xaR2FrZzJaRnBYTVhsM1RYYxAB",
            "text": "(1st visit)The food was authentic it reminded me of Colombia. I had fried snapper with coconut cream. The drinks were amazing, very large (share size). The staff was welcoming, also helpful and knowledgeable explaining the menu. Highly recommend."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaamMxbDRaMHhITkdOWlJqRkdVVmRFYUc1WVZrRRAB",
            "text": "Waitresses aren’t welcoming at all.  The sense that they are entitled to a tip is bad for business.   Beer served without a glass.  They do not approach any served client at all to just to see if all is good.  Today I did not leave a tip. They don’t do anything to earn it…."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaSFNVczRUMlZ1TUdWSGFtZzRVazlsUWtablgxRRAB",
            "text": "El servicio es excelente, fui a comer y me\ntocó un cambio de turno, tanto las meseras que salían como el personal que entraba se coordinaron inmediatamente, son cálidas y sobran las sonrisas, te hacen sentir en Colombia ! La comida es un manjar las lentejas con carne picada, el arroz y la ensalada deliciosas es como estar en Cali, en casa ! Gracias, Yohanna, Sofía, Daniela y Evelyn ! Que servicio !"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCVFFXdFlPRGxNY0U5blNXVTJjbFUzU1RWM1ZHYxAB",
            "text": "El bartender Julian es muy amable :)"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wWlNGTkdSRkkyUzJwYVIzTTRkRmxIVERCZlluYxAB",
            "text": "Atmosphere - 4 stars, really nice and clean but so dark\nService - 5 stars, nice waiter\nBandeja paisa - 4 stars, alright.\nPan de bono- 3 stars, dry and cold\nEmpanadas - 2 stars, genuinely what the hell, they were so dry. Who puts carne mechada in an empanada? The crust tasted like nothing."
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21JeU5qQXhjakZoVVZaSWNEUm9iM0JaZGxkUGFXYxAB",
            "text": "Buenas disculpe me enojo es que pedidos un pedido nos indica la hora y tengo q esperar más de 30 minutos para q me lo entreguen xq todavía no esta x algo se hace el pedido si no van a cumplir la hora q es  estoy muy enojada 😡"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CUmJVNTZVV2xqUTFwR2EySkdOSFpGU0ZsdllYYxAB",
            "text": "Amazing food and drinks great costumer service"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQZVppWXZtemJhZll3EAE",
            "text": "🤩🤩🤩🥰😍"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGeVZUVTNhbWQ0UkVReloxVm9VRGhFZDFCNlJtYxAB",
            "text": "My homegirl and I went to this restaurant during the beginning of covid , and it was amazing. The food , the drinks and the music were allamazing. It was a lovely weekend vibe 😌 ✨️. We will be visiting again soon."
        },
        {
            "date": "수정일: 5달 전",
            "language": "es",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOMDdLVThBRRAB",
            "text": "Pues me gusto pero no como para ir tan seguido mi mujer es colombiana y no le gusto la comida que pidió,la atención si fue buena pero la comida no tanto y el lugar es bonito"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZd01tUmtBRRAB",
            "text": "I was really excited to bring my friends to this location. We walked in at 10:03 and the lady was rude and told us that the kitchen and bar were closed and that the entire staff had to be out by 10:30 and the closing time is 11 pm. This was extremely disappointing because I been here before a couple of months ago around the same time, and the experience was wonderful. Btw the place was completely empty, but they didn’t want my business."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvX0tHRlNREAE",
            "text": "First time trying Colombian food — tasty, generous portions, and rich cream sauce.\nFood took a while to come out, even though the place wasn’t busy."
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJNWVpQ3VRRRAB",
            "text": "Muy mal servicio al cliente ya me a pasado barios problemas y siempre salen con disculpas de verdad que por malos empleados pierden buenos clientes qué lastima."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyal91Mm9nRRAB",
            "text": "Food great, drinks great but service is supper duper slow and a little unorganized. 30 mins after being seated to make a order and almost another hr waiting before we got our food and drink only because I ask a guy waiter who kept passing by to assist us. I kinda just wanted to get up and walk away but I didn't because we drove all the way from bk. Seems like it gets really busy so plan ahead. Will try again in the future."
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3eUtyQnhBRRAB",
            "text": "Acabo de salir con mi novia, y un grupo familiar y pague una cuenta de 400 USD, y el personal que atiende me saco rapidisimo aun cuando seguir consumiendo, me parece muy mal que Roman esa actitud frente a a los clientes, 0 recomendado, me parece muy mal."
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3eUt6b2hnRRAB",
            "text": "Pésima atención que trite , como lo pueden tratar a uno ,los mismos colombianos demasiado decepcionado de grande y de Colombia no tiene nada , no valoran ."
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3eUpUMFhREAE",
            "text": "Que pena acabo de salir de ese lugar , pésima atención tienen el descaro de echarnos ,una falta de respeto , fue la peo experiencias acá NY  demasiado triste como nos trataron solo porque sentar a otras personas , no estábamos tomados pero si estábamos comparando mucho , pedimos una horaden y apenas nos llegó de una llegó la cuenta después nos trajeron los vaso para que echáramos las vendidas 6 vasos , no me gusta denigrar pero es el pero sitio ,😢"
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3eU1qQTVnRRAB",
            "text": "El lugar nada que ver con los Colombianos, los Colombianos son muy amables y hay un mesero que te saca prácticamente a los empujones mientras estéas consumiendo, te trae la cuenta sin pedirla y un sin fin de desatenciones, de verdad no se lo recomiendo en absoluto a nadie !!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3OU0yUWV3EAE",
            "text": "Good"
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRcDgzdFJBEAE",
            "text": "Porquería de comida que venden aqui.. Y además cara."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnX2Qyckh3EAE",
            "text": "Amazing 👏"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnb2FpWjl3RRAB",
            "text": "Great food and great drinks 👌🏼"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBNzZIMnNBRRAB",
            "text": "Food it's amazing"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBLTZyWkpREAE",
            "text": "EXCELLENT BREAKFAST"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBMXJlSGx3RRAB",
            "text": "I just feel that I want to get this review for this place because I had a Quick Stop to get two empanadas and they were pretty good. Also, they have a queso bread ball That was pretty good as well. What I  appreciate is that they seem  very conscious with their pricing And not overcharge. Keep supporting this business food look good for what I saw."
        },
        {
            "date": "9달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmcFp2dDFRRRAB",
            "text": "Muy buena comida y bebidas, lo único malo es el espacio por pequeño."
        },
        {
            "date": "10달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2XzRpTW93RRAB",
            "text": "Terrible el servicio las niñas y el mesero que están ahí parece que te están haciendo un favor al darte servicio, ignoran a la gente y sólo platican entre ellos, deberían contratar mejor personal para divas en el trato hay muchas"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2djVDeW1BRRAB",
            "text": "Be aware!!! Besides having a bad attitude the entire time I was being served, when it was time to pay, they tried to charge me over $100 for a $17 bill. Be careful with tap and pay—they will try to scam you."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2MzlPY09BEAE",
            "text": "Ok"
        },
        {
            "date": "10달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2dmFqbzhBRRAB",
            "text": "Muy mala atencion acabo de salir de ahi por que la mesera dice que la cafeteria se atiende solo en el mostrador y nosotros estabamos sentados en la mesa. Le pedi unas gordas para llevar y dice que solo es para las mesas😡"
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtdE02dFNnEAE",
            "text": "Order appetizers drinks and dinner  amazing drinks and the food was awesome . My mot her in law came for a visit from overseas. Ordered the  fried plantains with the guacamole and another plate with the shredded meat and processed to the main course, but we love the appetizer and wanted another plate and the waiter said that we cannot ordered them bc we already had ordered the main course, REALLY??"
        },
        {
            "date": "10달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQX2FUenBRRRAB",
            "text": "Pésimo servicio de Delivery, la comida llega más de una hora y media de cuando la pides. Llega fría y encima una comida mal echa. Pésima comida"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQOGRTUy1BRRAB",
            "text": "Everything was absolutely perfect 👌🏾.   No complaints the service was fast and friendly. The food was very tasty with a nice portion size.  No wait for seating however I did go on a Sunday."
        },
        {
            "date": "11달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzbmZtY0hREAE",
            "text": "NO VAYAN A ESTE LUGAR , 17 noviembre 3 pm pesimo servicio hay Un mesero desagradable parece q uno viene a pedir de gratis,  un servicio pesimo y lo peor q agregan la propina,  y un pesimo servicio, no deben de incluir ellos la propina,"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoanNycnFnRRAB",
            "text": "I’d like to start my review off positive. Me & my partner enjoyed our food and drinks. Big portions, strong drinks. Seasoned. 8/10.\n\nMy problem when doing reviews is always the service the employees are providing or in this case, isn’t. We were not greeted upon entering the establishment and was left standing at the door for a good while. Not to mention, they saw us, looked our way & continued whatever it was they were doing. Now me, I would of walked out the moment they did this but my partner has been talking about this place since the summer. So for him I stayed. Waited entirely too long for someone to wait our table, to bring drinks and to pay the bill. This place was literally empty. So what was the reason. Not to mention we weren’t served water & when we asked they bought out a carafe & coffee cups. Just straight ghetto. The service alone will not bring me back."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhMWFHdXZ3RRAB",
            "text": "They say first impressions are important and the one that last. With that said the place has potential . It is a very nice dining  Alfresco style . The service was good but the food seem delicious . Sadly it was a little bit too salty ( the telapia ) for my taste . The Bean where a salty  . The Rico berger was good and the beef player as well . The crispy burger had much going on ( a bit drench in their hot sauce ) The chicken churrasco was good . The sangria  was okay 👍 the manzanita pop was a good choice too . The one thing that I bother me was the lack of cleanliness on the sidewalk and on the plants that surrounded the dining area  . I hope that take care of this and hopefully my next experience will be better"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSanI3X0ZREAE",
            "text": "The place is very busy, and the service was good. Nice vibes here. Food is fresh due to foot traffic. Drinks was a 5 food was 3 could be better. Had a good time tho would like to go back when it's not so busy"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpOXFHLWNBEAE",
            "text": "Went for Halloween night. Called to make sure if reservations had for be made, which we were told no. When arriving there there seems to be a long line that begins to form, so it took awhile before we were seated.…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2bk0zakxBEAE",
            "text": "Had dinner here as a treat since it was my last night in New York. The main highlight was supposed to be a cocktail in a huge glass but we were told that this was not served after 9pm (We arrived a little while before 10). We were disappointed but decided to stay anyway for dinner since we had come a long way.\n\nThe food was quite good; the portions were quite large so we ended getting takeaway plates.\n\nOur hostesses were courteous and helpful. What we did not like, however, was the fact that the staff had started spraying down the place with liquid cleaner while we were still dining. Not a good look at all. The last thing I want to smell is bleach while I am trying to enjoy my meal.Thank goodness we were not allergic to anything.\n\nPerhaps, this establishment should consider not having customers dining in after a certain time so as to facilitate thorough cleaning of the premises to ensure that workers end their shift in a timely fashion."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEbEtxZG13RRAB",
            "text": "No sé qué esperan para cerrar ese lugar, soy colombiana y es triste ver como los mismos colombianos tratan a la gente en ese lugar! No son atentos mucho menos cordiales con los clientes, la comida está muy regular, además de las bebidas! Qué tal la presentación de este plato?\nAmigos no pierda su tiempo y mucho menos su dinero, triste por los que trabajan acá pero amigos en serio, pésimo servicio pésimo todo !!!!!!!\nOjalá su administración cambie y mejore porque el restaurante está súper bien ubicado!!!!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhd295elBBEAE",
            "text": "This is not your typical restaurant.. Definitely a hidden gem. Service was a bit slow and there were alot of items they did not have on the menu.  But the food we did order was very good. The drinks were good but needed a little more liqour. Beware the drinks are huge so order one at a time; share if you are 2 ppl . We wasted alot of the drink and you cannot get it Togo."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHLWR5alJnEAE",
            "text": "Ordered lots of food.  Was over charged.  The tablet we were forced to place an order from didn't match prices on the receipt by over $20. No silverware.  No spoons. Food was cold by the time they brought them.  Our server was on his Cell phone when we went inside to see what was going on. Staff was rude.  Poor service. Poor presentation.  This place shouldn't be dine in.  It should be carryout only.  Great food,  bad service."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsOTlhd1FREAE",
            "text": "This place is honestly a waste. Food is trash and they never follow instructions they request payment before you get your food which I find ridiculous I ordered  a picada  and it came with 90% chicken. And they NEVER HAVE PINK SAUCE WHICH IS HONESTLY RIDICULOUS. the staff is extremely rude every one there is a “manger” when we spoke to a staff memeber on the phone she hung up on me several times. Tuesday at 6:15pm the women who kept picking up the phone refused  to give her name and refused to tell us when we can contact the owner never coming back here !!!!!!!!!!!! Posted a picture of the rude employe  I has the displeasure of speaking to"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXXzRlLUl3EAE",
            "text": "Nice cozy space. Drinks are AMAZING! Sangrita is definitely my favorite. Staff is really nice. (Although today I felt like they were trying to get us out quick.)"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLbVp5SnB3RRAB",
            "text": "Unfortunately I had to rate this restaurant a 1 star because as trendy as they may look on social media and as great as their presentation is, it's not worth the wait. Literally the wait to get your food or even a bottle of water is more than 1 hour. The server that I had, young girl with a blond Bob, always had an attitude and was rude for no reason. I believe their trying, but they don't have enough workers to cover all the people they sit. Which subsequently leads to their terrible customer service. Luckily we weren't hungry when we decided to try La Nueva Columbia, we really wanted to check out the buzz on social media. I won't be returning. Oh and PS don't get their piña colada 👎🏽"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhak0tV3d3RRAB",
            "text": "I must say the food was very good and the drinks were great. Everyone was friendly and attentive even thought the place was packed and busy. I will return again very soon. I loved the place."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQybExpWVlREAE",
            "text": "Even though I sat outside in their outdoor area while it was raining and cold, barely any heat, I had a good time. I didn't get wet so that's good but they should've had their heat lanterns set up beforehand. Honestly, they did accommodate and turned on their heat lamps. Food was great and drinks too. I went and ate with my brother and his girl and just had a great time. The staff were great which made my experience better. I will definitely come back and hopefully sit indoors next time."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpaC15ZE1BEAE",
            "text": "Food was great, drinks were great. Been wanting to go to this place because of how good their drinks look. The appetizers were amazing, only thing that i didn’t like was that the rice wasn’t that good. The service was great can’t complain about that."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSLXRqN1B3EAE",
            "text": "They are very busy, food & drinks are good, some of the waiters come of  a bit rude, idk if it’s a language barrier, but I had a great time overall"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURzb2ZEMDFRRRAB",
            "text": "The place is fine, you feel like eating at home. Food delicious, meat taste so good. My breakfast was so good, then I will recomend you. Colombian coffe so tasty, smelling and delicious. For sure I will come back soon !!!! . Thanks Nancy,…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCZzVMbFlBEAE",
            "text": "Pretty good spot a few minutes from LaGurdia Airport. It was late and I wanted some new food, so I decided to check out this spot that I had been following on IG. It’s a nice establishment. There’s outside seating as well as seating inside. I ordered a burger with french fries, rice, and one of the Colombian drinks. The burger came with this pink sauce that was pretty good. The Colombian drink was very good as well. Parking is tough so keep that in mind."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSNnZMVHBRRRAB",
            "text": "I see everyone else choosing to start positive   So I guess I will too. The one food item we ordered was actually pretty good, patacón con guacamole and carne desmechada. Other than that though not worth a dine in experience.\n\nNo one greeted us at the door, servers stared at us and had us waiting way too long to be seated, we had to stop someone to be seated. And no it was not that busy.\n\nThe large drinks are large(highly recommend sharing with two ppl, wish the server would have gave us that tip) but they were terribly strong and lacked in flavor. I ordered a classic mojito which had old and wilted mint leaves in it.\n\nThe second large drink had a shot size bottle  inside but it was never even opened. Not only is that a lack of attention to detail but also unhygienic.\n\nTo top it off we were seated next to the bathroom and in front of the kitchen. Once we saw 4 tables open up we asked if we could be moved. To which we were told they were already accounted for. After 20+ minutes one of the tables finally was filled while the others stayed open. At that point we already knew it wasn’t worth staying.\n\nAll and all I doubt I would come here again but the food might be worth a take out.\n\nManagement, train your servers better. Get a hostess. And please please no gum chewing while serving you could get saliva in others food without even noticing."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPbUllTENnEAE",
            "text": "My wife found this location online so we decided to try it out. It was not a bad experience but a little pricey. Food was ok but waitress failed to mention there's no burgers and I was in the mood for one. They take long to attend people even though the place only have 3 customers."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNod3ZuX2p3RRAB",
            "text": "Es un lugar bonito,  pero la atención es poco amable las chicas pasan un poquitin estresadas y las personas que desayunamos ahí nos toca ver sus discusiones y demoran en atender a las mesas , voy por los desayunos son muy buenos"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXazZyYmJREAE",
            "text": "The food and drinks were great! but the wait time it's insane! Over an hour to be seated appetizer and meal came out together after another 45 mins.There is no hot sauce! Which its wack price is reasonable."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSaEstcnpnRRAB",
            "text": "Food and Drinks 4/5\nService not even a one!!\nWe wait 15 minutes before being seated. Waiter did not take our order about 25 minutes after be seated. Drinks and appetizers arrived about 20 minutes after ordering, no cutlery or napkins were provided. After asking the waitress she said to us we had to wait for the cutlery because they ran out of clean ones!! Huh? Never in my life had I heard something like that in a restaurant. While trying to order a second round of drinks waitress tells us when can’t order anymore drinks because out time limit was over and she had other people waiting for the table!! Crazy because the table next to us had been there for more than 2 hours and were never denied drinks!! I asked for the bill $170 for 3 appetizers and 4 drinks!! To infuriate me even more after being denied drinks I realized I was being charged 20% Gratuity for the horrible service!!!\nHopefully the owner or manager of this establishment will read this and realize the terrible experience and service their employees provide."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSX2Q2NS1nRRAB",
            "text": "Short words i would not go back.\nDrinks are all for pictures only.  We ordered a Pineapple Screwdriver, Mojito and Frozen Margarita and all were horrible , watered down! And taste was not there.\nThe food had good taste, quality was awesome and looked awesome.  No complaints about the food.\nThe service! They need new staff. The waitress was chewing gum and taking orders. Took more than 20min to get me my check and container to pack my food.\n\nI know the area can be ghetto,  but this place is past ghetto with their service.  Its too bad tbh because the food is great and the flavor is there.  But definitely not worth the time or money overall."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURzZ2VIVnBnRRAB",
            "text": "The service was good, and our waitress was really nice. So I have no complaints about the service. But the food was not to my liking (comparing it to las margaritas or pollos mario). The drinks looked amazing though! I'll give them an…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURpd3RHZk9BEAE",
            "text": "Come here for the advertisement in Instagram. But nothing close to the pictures. First the service 2/5 I have to wait literal more than 30 minutes for her to come and tell me isn't more mojitos. Then I order the margarita and my husband one…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2X3RDdHVnRRAB",
            "text": "When we arrived they have empty tables outside & they would not sit anyone. It seemed like they pick and choose who they let sit outside. Once we sat down we were trying to decide what to eat then we realized 30 has passed. All that time passed and when I told the hostess she completely ignore & dismissed me. I was ready to leave because how do you have people sitting there that long and not even acknowledging them? Last thing was they were spraying the table with glass cleaner.. How is that going to clean a table? It also seemed like they only liked to serve people that are from their country and not any one else. I only stayed because it was my friends bday. The drinks are really but food is eh.."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyb3ByMjFnRRAB",
            "text": "Disappointed! I traveled from Houston to New York (Queens) and one of the restaurants I wanted to visit was this one, because they show very nice photos on Instagram of their food, drinks and environment, but since I arrived at the…"
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPcmVXNjV3RRAB",
            "text": "I decided to come here because I read many good reviews, but once I got the place my jaws went down, I thought the restaurant was nice and big.\nFood is no really quality, I  asked for a Paella, what a deception, not even close to,\nI got a grease rice with yellow colored and low quality of chicken and see food.\n\nCaída de quijada, este lugar no es lo que esperaba. En su menú tienen un plato llamado Paella pero no tienen idea que es paella. El servicio fue mediocre. Desperdicio de tiempo viajando desde New Jersey a New York, para esto."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDd3IyQ3dRRRAB",
            "text": "Found this place on IG. Drinks looked amazing. Food was okay. A little more flavoring could have made it better. Ordered the \"bandeja paisana\" a typical Columbian dish. Great customer service 👏.…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNbG9pNW9BRRAB",
            "text": "Amazing Colombian food and cocktails! Our waitress was very attentive and patient with us. This is definitely an amazing restaurant to go to after work for a drink. The place is very small, family friendly but definitely not suitable for…"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSOHRxNjJBRRAB",
            "text": "Fui a cenar con mi familia hoy primera y última ves que comemos aquí. Primeramente, la mesera que nos atendió Katherine,  llegó masticando chicle en la cara de uno y después cuando llegó nuestra comida. Después cuando llegó la bebida que pedí que era mas huelo que bebida se cobró por $21 y centavos. Mi hermana pidió un passionfruit margarita y encontró una mosca muerta adentro!!! Mi mamá ordenó un plato de camarón que le trajeron como una sopa de leche que ella no se lo comió! Cuando llegó la comida la mesera Katherine nunca llegó a preguntar si necesitábamos algo ni agua nos trajo 😡 Este restaurante se mira bien por las fotos pero no recomiendo comer aquí! No fueron professional con nosotros y por eso les doy dos estrellas."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxLWFteVRREAE",
            "text": "I thought this place was a great choice when I saw the pictures on instagram. THIS PLACE IS A MUST ‘DO NOT COME’ (for food choices). The service is horrible, the food arrive super late and ON TOP OF THAT it was SALTY. We asked for a side of…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhcWFxcDJ3RRAB",
            "text": "Simply A-mazing food, but call ahead to ask about the drinks . I'm not sure if they are serving Alcoholic beverages at this time. The drink attached is from my first visit. Second visit we had soft drinks. They offer indoor and outdoor dining. Inside is store front size so the outdoor dining is a great plus. Service is a little slow,but I chalk that up to covid regulations on how many staff can work per day per shift. ENJOY!!!!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5bWRLTGFnEAE",
            "text": "Se que la comida colombia es muy buena, pero este día que restaurante nooo. Presentación y sabor de la comida pésima. Atención simple. Y hay un olor en el lugar como chukia o trapo sucio nose huele feo. El café estaba bueno nada más ... Los frijoles estaba horribles osea algo tan simple de hacer. En fin no lo recomiendo."
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPXy1uT2NREAE",
            "text": "El peor servicio de la vida!!!\nDure 15 mi iros esperando que me atendieran, los meseros me pasaban por el lado y no decían nada, decidí sentarme en una mesa y después de 10 minutos me dieron sus iPads sucios, elegí la hamburguesa Rico y hawaiana cuando me las dieron no tenia nada de lo q decía en el menú le pregunté al mesero y dijo que se les había acabado el jamón el bacon las papas, pero q me daba unas empanadas que estaban súper frías y viejas, el lugar muy sucio, la comida no se parece a la que está eN Instagram"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuell1RHNRRRAB",
            "text": "Muy rico pero tienen que tener más chocolate caliente."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDakthMy1RRRAB",
            "text": "The price was great the drink was delicious and strong the food was delicious. The sweet plantain was moist , sweet , and cooked to perfection. The beans were delicious too. I had a mini Bandeja paisa. Delicious will go again."
        }
    ],
    "reviews_count": 78
}