{
    "name": "Himalayan Yak Restaurant",
    "place_id": "ChIJP_DysOT1wokRbj86nKeyM2M",
    "grid": "QN3",
    "address": "72-20 Roosevelt Ave, Jackson Heights, NY 11372, USA",
    "rating": 4.2,
    "user_ratings_total": 1582,
    "phone_number": "(718) 779-1119",
    "reviews": [
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkYVNrRldja3BMYlU5T01XSktXbTFKTFZkQk1WRRAB",
            "text": "A good restaurant"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GbFRXRlljMEpZVTJSYVNtb3lkRUZzV2pWWWJGRRAB",
            "text": "Portion was too small. Plus jhol was really cold for jhol momo."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOMFJHRmZORGQxWVZwS01YVnJXakY0VG0xZlNHYxAB",
            "text": "They were super sweet and allowed me to take my online class while eating dinner.\nWant to come back for some live music on the weekends."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsdE5uVnhVWEkzUjNORlZGQlhjek14T0UxSFZVRRAB",
            "text": "One of the best Momo in NYC"
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNranBfSy1BRRAB",
            "text": "Yummy nepali and Tibetan food with an awesome band makes this place to be when you are in J\n\nupdated 2025 October\nEverything we ordered was fire! Been hitting up Himalayan Yak since 2010, but this last visit? Straight up the best. Goat Bhutan? Next level. Beef and chicken momos? Yup, perfection. Wai Wai Sandeko? Crispy dreams. Chicken thali, chili mushroom, veg chowmein—basically, we went hard and loved every bite.\n\nIf you're reading this—just go and order all the things. Trust me, you won’t regret it 😎"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBdFNGcHFRMlF3TTBWVk4wZExOa0pzTldoTFVGRRAB",
            "text": "Great Nepali restaurant"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjMmRITlZOekJSUTIxMlMyZEljVGhaZFRsRGMzYxAB",
            "text": "Lovely!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toYWFYaEZhVlJIU3paWWFqSnFSRU10VlRsbFpGRRAB",
            "text": "Authentic Nepali Cuisine in Jackson height , NYC"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CYVpFWnRTRzFGVDNNMGFWbFZhRU10VFhCcFZFRRAB",
            "text": "Highly recommended! Loved the food and drinks ❤️"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SQ2FUSTNlbTU2TnprMVRtdG1iM0JIVjFReVEyYxAB",
            "text": "The veg and chicken jhol momos were amazing! Service was excellent and very friendly. Looking forward to coming back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WMkxVWnFRVEppTUU1bFJWVnlNMHhTWlVwVFIxRRAB",
            "text": "I have been meaning to stop here for years. I finally made it and I could cry that I haven't been here earlier. Great value, amazing food and great service. Try it for yourself and thank me later!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSbk5saGFZa290VnpSS2RFUTJTM0kzTjA4ME1FRRAB",
            "text": "i’m filling so sad because they are not good management we are still eating but they come to us telling::please fast fast  finish your food because our another customer is coming ! There seems we didn’t go there I don’t want to tell to somebody. Also service not good bad behavior .."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xZNGJqWnlWa1JFU0dndFVrNUJlR1JzVVROMmRHYxAB",
            "text": "Went for dinner with my team from New York who chosen this Restaurent . Food was delicious and service was perfect. The best part of the restaurant was we enjoyed live music ( Nepali and Hindi songs). we managed to dance in our space next to our table too… Highly recommended if you are in New York and looking for Nepali restaurant with live music"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25rNU5teElZVkpXTWtrellWY3lPR05mVkMxMWJVRRAB",
            "text": "This place matches the character of our neighborhood. The staff provides surprisingly excellent attention. This spot has a peaceful presence. You can see they choose quality over cutting corners. This restaurant provides exceptional meals."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJM01rcFJYMnBETmxCaWRHWjZPVTVQTmpsUWJFRRAB",
            "text": "Solid place. Great atmosphere and staff.\nMy friend devoured the thali.\nI misread the sizzler platter thinking it was something else. That's on me. But I still enjoyed it."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OcFpIbENlWE5sZFZnMGNEZFNSbkJoVmt0R05tYxAB",
            "text": "Great Nepali food and atmosphere!  The momos and curry were excellent.  However, we asked for goat gravy only and they said they were unable to for some reason."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOalpXSTJXVTF2WkRKcU5EUnFZVmRhWWxCTExVRRAB",
            "text": "No good service"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OSFNrSkJlbTlIVUUxelEyOVBaVzFHYmxkMlVuYxAB",
            "text": "Try the thali of your choice, it’s really good 😊"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OWmIwNVNiVFZmZDNsd2VUaElNbDl6UzE5SVNuYxAB",
            "text": "love the Momos and the live performance"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJM2JEa3RVVmhKWDNjelh5MUlNelJ0WlVsV2RtYxAB",
            "text": "The authentic Nepali MoMo in Jackson Heights."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoMlFsRm1kWEJMVWw5eGFGZGxNbDl0WlVsV1IzYxAB",
            "text": "A few days ago, my friend accidentally left behind a shoe and had requested the manager, Mr. Lobsang, to kindly keep it aside. Unfortunately, I fell ill for the next couple of days and could only manage to visit for collection a little later.\n\nAs a professional in the hospitality industry and a teaching professor to undergraduate hotel management students, I firmly believe that guests must always be welcomed with professionalism and respect, no matter the circumstance. Sadly, this was entirely missing at Himalayan Yak. The manager’s attitude was far from hospitable, and the same dismissive behaviour was reflected in the waiter who first addressed us upon arrival.\n\nI had genuinely considered returning here in the future, but this experience has completely changed my mind. It is truly disheartening to see such a lack of courtesy in a place that should embody warmth and service. A simple gesture of respect would have left a lasting positive impression, but instead, I walked away with disappointment."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Zd1NWZHFia0Y2UkU1blJUWkdVRFJ6Tm5KZlgwRRAB",
            "text": "Sukiti thali is out of this world! So much flavor. When I drive to NYC this is the first meal I have! Pairs so good with a spicy margarita or their spicy mango cocktail. Highly recommend!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZemNqbDRhRGRhU25wYWMwVklhSE40VVVrM1VtYxAB",
            "text": "Love it, my favorite spot. They have amazing food and the singer has beautiful voice. Such a vibe."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psYVJWUlVSVVZrWHpoRmFEaENWVmhKWTI5V01uYxAB",
            "text": "The food was good overall. We had chicken momo, goat thali, chicken thali, and fish thali, and everything tasted fresh and flavorful. I especially liked how the momo came with three different types of sauce—it was a nice touch.\n\nThe only thing that stood out was the dessert. We ordered three plates of gulab jamun and some dahi. Two of the gulab jamuns were served cold, and one was hot. The hot one tasted much better, and I believe it’s supposed to be served warm. Aside from that, everything else was great."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xnMFVFUnVjVGhHT1hGRFRUVXdTbGt3YkRsaGVXYxAB",
            "text": "The food was good, while it doesn’t fully match the authenticity of being back in Nepal, it still hits close to home. The service was nice and the staff was friendly, but there’s still a little room for more flavor in the overall experience. Still, it’s a solid spot when you’re missing a taste of Nepal."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOYVMyOWpXRWRrTlhoclUyeGFkM2hFTWtseVluYxAB",
            "text": "Perfect place that feels like home. Starting from service to food , everything is hearty and amazing. Food are tooo good and worth every penny. The ambiance is very beautiful with traditional kick and hospitality is the top notch. Will obviously keep on visiting and recommend as well."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KTFJYVjNORXRYV0ZBMllUQjVOV1V0U1dobU1sRRAB",
            "text": "Himalayan Yak came highly recommended by a Nepalese friend, and it didn’t disappoint. I ordered the Daal Bhat Tarkari (Thali) with goat, and it was excellent. Flavorful, comforting, and generously portioned. The goat was tender, the lentils were perfectly spiced, and the variety of side dishes made the plate feel both balanced and satisfying. For the quality and amount of food, the price was incredibly reasonable.\n\nDon’t let the modest exterior fool you; the interior is surprisingly spacious, colorful, and welcoming, with decor that reflects Tibetan and Nepalese culture. It’s a great spot whether you’re familiar with Himalayan cuisine or trying it for the first time.\n\nIf you’re looking for an authentic, affordable, and flavorful meal in Jackson Heights, this place is absolutely worth a visit. I’d definitely go back to try more from the menu. Lunch was quiet and lowkey, while nights seem to be lively and better for a group of friends."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWblpqRllWWEV6Wm5KQ1RESXplV1V4YTNaSWRrRRAB",
            "text": "This place satisfies all my dining needs. Order different things and enjoy your meal. Their cooking creates wonderful flavors. What's more, the workers consistently make customers feel welcome. The restaurant impresses fully."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5alZFMW9kRzFVTkVNeE5Xc3lXV28xZVV0RmIxRRAB",
            "text": "Food is always delicious..."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKelUzUnFibmc1YUMxSVkyRk1ObDlYWVhNNE5HYxAB",
            "text": "Either we were very hungry or food was too good!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCRldXOXhjVFJqTlU1aFNYUTRiSFV3TkZGR09XYxAB",
            "text": "So delicious!! We thoroughly enjoyed our food. Love music was a nice touch."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCSGNVbGtaRzFuVkcwelZEUjNjbEYwYVY5cFIyYxAB",
            "text": "a great experience with quality food, nice atmosphere and a friendly staff. couldn't recommend this more."
        },
        {
            "date": "3달 전",
            "language": "bn",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jMmIxOHdPR2hVUzFOVmJFOURNMWRXVFZoemVsRRAB",
            "text": "Khana ra geet duitai mitho!! 💯"
        },
        {
            "date": "3달 전",
            "language": "ca",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wWGVFTmZXVWt0YjFVMVVYUjFlVmRRYjNoUlZuYxAB",
            "text": "bruh ts slaps tuna tartar was esquite"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twaGIxUlhMV1V6WDJ0MmR6bE1WRE0xUnpaUWQwRRAB",
            "text": "Not satisfied at all with their service."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxalYxUkJOR2h0YjJSM1RrOU5RamhNVFZsNkxWRRAB",
            "text": "My sister and I have been to this restaurant years ago and that the food there is wonderful. Both of us ordered Momo, and many other foods. The service was wonderful. The atmosphere was that there were people eating in and that the restaurant was busy because their people ordering take out."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KU2RsWjFWUzEzVEc1bFpVVlJla1JEWjE5UmEyYxAB",
            "text": "Best Nepali restaurant in New York City.\nGood food with live music."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25VdGJVRkhVVmh6YlV4R2RGRjVNMGhtUjFKSVVWRRAB",
            "text": "It's a very friendly and cozy environment. If you want to experience good music with a cocktail, then you must visit.❤️❤️"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxU2IzWmhhRFJvTm1Ga2RHRmpjMUJpVURVek1XYxAB",
            "text": "I live outside of NYC but been to this place many times when I visit NYC with my friends and family. My every visit to Himalayan Yak been a fantastic and memorable and I walked out with happy tummy. Love their goat bhutan, samay baji the most. All other dishes are equally delicious. Very nice staff, good ambience and delicious food. I highly recommend this restaurant and can't wait to go there myself next time when I go to NYC."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoSlR6STViVEV0Y0Vob2VFeFZibGhsVmtNMGVYYxAB",
            "text": "One of the best restaurants in Queens!We always enjoy the food, ambience takes us back to Nepal.Service is always on point!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205S1JUZExORFZCYm5kclZtMDBXblJFYlZSTlZrRRAB",
            "text": "Avoid this place!! Not worth the money. Poor service, worse food. Unfriendly and Very disrespectful staff. Disappointing dining experience ever. Staff behavior unacceptable. Food wasn’t great either. We went there for family dinner. But all of this happened with us. We  waste our beautiful time, money and peace. From the bottom of my heart: don’t go!! Seriously don’t waste your time and save your money. Bad experience😡🤮 Never going back!! And please treat customers with respect not attitude!! They behave like they are paying for my food. One guy is there he was very rude to us. He don’t have any manners at all. At the end we paid 20% gratuity for those rude service.😠😔"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJM1ltb3dSRVZLYzBrd1pYTlVRWE53UzFkalUxRRAB",
            "text": "We thought Nepali restaurants was good but  waiter OMG soo rude and no manner less\nI just asked for extra rice she gave me but\nWhen I ask extra daal but she told me\n(Can you ask everything in one time)by showing\nHer attitude.it’s normal if I get extra rice I need\nExtra daal too eat rice.\nI try to talk manager one guy came there\nWhen I try to explain him the guy told me\nI am already full.come on bro when we\nOrder snacks you guys didn’t told us we are full\nIts very embarrassing to us\nWe pay you right? If we pay money you guys\nHave to treat like human.thank you"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SRFRXOU9RblpYVEVkWmFIaGpXbTFYV0RKS2VXYxAB",
            "text": "The focused on the vibe and have lost the taste of Nepali food. Ambience is nice but this is below average food, bad chatpate, bad choila~ it might be nice for Americans who have mild taste but this a never again for me"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOMlgwaE1WM3ByVVZwT0xUVjBVWFZaVVVaSkxYYxAB",
            "text": "One of the worst restaurants I’ve been to. Service was very slow and not friendly.\nThey’re attitude worse than street dog"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OU1h6SkxkVGR0U2xseVpqWklOSGRDUW5GSlQwRRAB",
            "text": "Visited recently after watching the July 4th fireworks and, luckily, managed to get a table for three. As always, the food was great. We never skip the chilly mushroom—it’s our go-to dish every time we come here.\n\nThe chicken curry and Momo are okay, not a standout. However, the noodles, chili, duck sekuwa, grilled salmon, achar and chatpate are really some of the best you’ll find in Jackson Heights.\n\nWe also happened to be there during Prajwal Dai’s birthday celebration on July 5th. His live singing always adds a whole new vibe to the evening and elevates the atmosphere."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205alFrbEtiRTFhWjNSTk56RmxZVEZhUTE4elRXYxAB",
            "text": "One of the worst restaurants I’ve been to. Service was very slow and not friendly. The food had no taste at all, especially the Nepali thali—it was terrible and not worth the price. Everything felt overpriced for what they offered. I don’t recommend this place"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paeldESkNPV3RIZDJ3NFNFNDRNM0JXVjA1cGFsRRAB",
            "text": "A heartwarming culinary experience that transcends borders. Absolutely loved the place! The momo jhol is an absolute must-try—bursting with flavor. Tenzin, our gracious hostess, made the evening truly unforgettable."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOWVYyeGlTbkZUTmpaWUxWWlpRbU5NUnpWalRYYxAB",
            "text": "What a hidden gem! This place is really good for some private conversations and friends gatherings. The staffs are friendly and welcoming, the food is hearty and the interior design of the place is calming with a bar and a corner stage for live bands. Really would recommend visiting!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GclNDMHliM1JETldwcmIxVjNTRU5KVm1GemMwRRAB",
            "text": "The food was really good and very filling, I had a really good time with my friends. We were here on a Monday night. The restaurant was not very crowded and we got to enjoy a nice dinner. The stew and the chicken buns with peanut sauce were my favorite. They also have nice appetizers and drinks. I liked the mango lassi I ordered. They are also conveniently located near the subway, so it's a good spot for friends gathering."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2podVNXSnBhMGQ1TFRCUGNXNDNkVUpXVldWS2VGRRAB",
            "text": "Atmosphere was great, but food was just below average. We good beef dumpling and I don't know the name of the other item. But the dumpling was so dry. Not worth it at all and the drink I got, I had returned it, have no idea what they gave when I wanted a spicy margarita."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMbUU0WnpQOTlpbDF3RRAB",
            "text": "A beloved Nepali staple in the Jackson Heights neighborhood known for their live music and delicious food. This place is a must-try if you’re in Queens! We came early so there was ample space and no wait. Highly recommend the momo, chili fish/chicken, chow main and with fluffy egg, and sizzling platters that come with savory gravy noodles. Best to come with lots of people to try more family style!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNN3Atb25xNWRQY1dREAE",
            "text": "I was seriously craving some Indo-Chinese or Nepali/Tibetan-style food during my recent trip to New York, and a quick Google search led me to this spot. It was a late Friday night, around 10 PM, and the place was still buzzing — packed with diners and open until midnight, which worked perfectly for us.\n\nWe lucked out with a parking spot right in front of the restaurant, and even better, we got seated immediately despite the crowd. The atmosphere inside was vibrant and full of life, with lots of Nepali locals dining — always a good sign when you’re trying regional cuisine. There was live guitar music in the background, adding to the warm and lively vibe. They have a bar too, though we skipped drinks this time.\n\nWe started with chicken steamed momos, which actually arrived a bit later — the kitchen was steaming them fresh, so no complaints there. In the meantime, we ordered chicken noodles, chili chicken, and a traditional Nepali pork dish ( forgot the name, check their menu) — lightly grilled or shallow-fried pork served with muri (puffed rice).\n\nThe sauces and condiments were fresh and full of flavor, and the food overall was excellent. The pork stood out the most — smoky, tender, grilled to perfection, with a nostalgic crunch from the muri. The noodles and chili chicken reminded me of classic Indian street food — bold, spicy, and satisfying.\n\nAs for the momos — the most hyped item — they were good, but slightly underwhelming. The wrapper was a bit thick and the filling slightly dry. Still enjoyable, just not the highlight.\n\nOverall, the experience was fantastic. Great food, lively ambiance, very reasonable prices — would definitely go back and highly recommend to anyone craving those comforting Himalayan flavors late at night."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJaE42LXpnRRAB",
            "text": "Himalayan Yak Restaurant is a hidden gem! My forever to go place as The atmosphere is cozy and welcoming, making you feel right at home. The food is incredible – my favorite is the Wai Wai Sadeko and Pork sekuwa  but the chicken momo, Pork sekuwa is a must-try too. The service was top-notch, with friendly and attentive staff. Highly recommend this place for authentic Himalayan flavors and a warm dining experience with variety in Drinks to enjoy!!!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3MEpiX2J3EAE",
            "text": "This place always brings us a taste of home! We've been here multiple times and will definitely keep coming back. The food is delicious, the service is excellent, and the live music creates the perfect atmosphere. Highly recommend!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvM2FDWXRBRRAB",
            "text": "Tried Nepali cuisine here and had a great experience! The food was flavorful and authentic. Really enjoyed it!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnOGMtTlFBEAE",
            "text": "I absolutely love this place and the staff is super friendly and welcoming. The food is delicious and I’ve been several times and tried many things. The Tingmo and Momos in the sauce are my favorite."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiak83ckxBEAE",
            "text": "Delicious food and great service! A great date spot with live music on the weekends. The dishes came out fast and were packed with flavour! Highly recommend! From their Aloo Dum to Thali dish, they were all so good that it's hard to pick a favorite."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQd3NXRjJnRRAB",
            "text": "I was Introduce to Himalayan Yak thanks to a Yelp event.\n\nI arrived on a Sunday afternoon and had the place all to myself. I sat at the bar and perused the menu. The gentleman greeted me and made me feel welcomed and comfortable.\n\nAs soon as I saw garlic naan that was an absolute must and then for my entrée I decided on the chicken tikka masala. The naan was perfect. It came out pipping hot with ample garlic. I love that for me. The chicken tikka masala was flavorful with a great balance of spices. However the chicken was not as tender as I would have hoped. Overall it was a nice lunch.\n\nJust A Note:\n\nThe offer happy hour and live music."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIMnNUSVlREAE",
            "text": "In one word..Awesome! As per food, they had perfect combination of spices and taste. We ordered Nepali thali, veg noodles, chicken momo, veg momo, naan and one chicken dish and a veg dish. The ambience the so nice, there was a live Nepali music going on, which I absolutely loved!! I would also rate the service a five star! Would love to come back again."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3MUxPVnRnRRAB",
            "text": "This is my go to place where I love having rich flavors of food and appetizers. Food is delicious and drink selection is equally impressive.they gave us complimentary drink and gulab jamun as well.the vibes of restaurant is warm and inviting. the service is always top notch, they know how to make customer happy. Will definitely come back."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3Z0tMLWN3EAE",
            "text": "Awesome spot, highly recommend Friday and Saturday night live music, Goat Thali, and the Momos. Wouldn’t recommend the Yak Kick cocktail, not my vibe. But milk tea was spiced to perfection."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPclg3cTNienB2TTZnRRAB",
            "text": "Loveee this place, a classic for my friends and I. Great selection of authentic Nepali and Tibetan food, great atmosphere"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR3cnBxZXd3RRAB",
            "text": "Nestled in a bustling Street under the trains Jackson heights- 74 is probably the most impressive Himalayan restaurant in all of Queens. I have been frequenting Himalayan Yak for many years now and its inconsistency and quality has endured. Upon entering you are greeted with serene music of the region and a calm atmosphere. The space strikes a perfect balance between cozy and spacious, with beautiful decor featuring traditional artifacts, prayer flags, and amazing artwork.\nThe menu offers an impressive array of Nepalese, Tibetan, Bhutanese, and Indian dishes, ranging from the typical (momos and curries) to the exotic (beef tongue, goat organ medley, blood sausage). They also have vegetarian/vegan dishes. I have tried and recommend: goat thali, sukuti thali, shapta beef, shakam datsi, any of the momos. Also recommend getting the Tibetan steamed bun, tingmo (as opposed to rice. The dishes can be ordered for groups (been here with a group of 2,4, and even 11!)\nThe staff are hospitable and helpful, and happy to guide newcomers through unfamiliar dishes and make thoughtful recommendations.\nFinally, the gender-neutral restrooms are clean and adequate.\nIn sum, make sure to include Himalayan Yak in any culinary tour/experience of Queens/NYC."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNycmRHR3p3RRAB",
            "text": "Lovely atmosphere between music and decor, and the crowd gave it instant authenticity.\n\nThe service was great except my waiter let me get this horrible dish, sizzler chicken…imagine chicken and noodles braised in coke…hell no!\n\nThe chicken dumplings however were not just good but exceptional! For that I will even come back despite how terrible the sizzler was…if you go dip in the 2 sauces…AND Ask for the 3rd sauce if you like spicy (dried red roasted peppers)…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSaDZyYVlnEAE",
            "text": "Overall the experience was okay. The staff were kind and helpful, the restaurant looked nice, but the food was the let down.\nThe momo's were best part of the meal, full of flavour and good texture with 8 per serving. But the main meals were disappointing, as they were either tasting bitter and not quite right, or they lacked flavour making the dish bland."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRN05TM1dBEAE",
            "text": "Stopped by for some momos and drinks. Staff were friendly and the atmosphere was cozy and comforting.  Got the beef momos fried with chili. Would definitely recommend this option. The chicken momos steamed were good. I wished it just a little more juicy. But for 8 momos the price was great."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtc3FlMnVRRRAB",
            "text": "Yummy delicious food from Nepal, Tibet, Bhutan and India!  I learned so much just from eating here about the food culture of these places.  The space is nicely done.  The service was very friendly.  Come here hungry because you have…"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3aWRXZ3Z3RRAB",
            "text": "We had an amazing experience at this restaurant! Our company party was a success, and the food was absolutely delicious. The service was outstanding—Dechen took great care of us and made sure everything was perfect. She was attentive, friendly, and went above and beyond. Highly recommend this place for great food and excellent service!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKM3R5dmh3RRAB",
            "text": "Absolutely wonderful hidden gem of a place. Wonderful food and service and great decorations. They offer a great variety of cuisine from Indian to Tibetan to Bhutanese etc. a great place to try out something new and delicious! It’s worth visiting for the entrance door alone!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6X2U2Znh3RRAB",
            "text": "Family friendly location with live music. The food was excellent quality and priced reasonably. Exquisite flavors. Will come back"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPaGJ5QnRRRRAB",
            "text": "WE LOVE THIS PLACE. The only downside is that it's all the way in Jackson Heights and we live in the city. Unfortunately, they won't deliver into Manhattan.\n\nFood: Whenever we come here we always get the Wai Wai Sandeko. This, in my opinion, is their signature item. I get it spicy and my husband get it's mild. The flavors are so good and well mixed. This time, we also got the cripsy tofu in a sweet and spicy sauce. The tofu was perfectly crisped and the sauce was delicious. We also got a chili potato dish and that was also well flavored.\nIn the past, we've gotten their masala papad and we also loved that dish.\nI'll be honest and say I wasn't the biggest fan of their momos but everything else I've had here has met expectations or surpassed them.\n\nDisclosure: Most of the food items here are on the slightly spicy side so make sure to order mild.\n\nPrices: Prices are very reasonable especially for the portion of food.\n\nAmbiance: It's a well decorated restaurant that plays Indian music - not too loud.\n\nService: The service here is excellent! We've been here many times and each time they remember us. The food and drinks come out quickly.\n\nInstagram Handle: @TheShahLALand"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJN3RTUG1BRRAB",
            "text": "Spicy, savory, flavorful - if you can't handle the heat, their tikki masala is a buttery oasis. I've never had Himalayan food, but if this is what it's like, I'm with it. Service was friendly, and we even got two complimentary bottles of champagne because it was my friend's birthday."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4dE9LNU5nEAE",
            "text": "Recently went to Himalayan Yak with a group of 6 for dinner. Decor was a beautiful blend of modern elements and traditional Tibetan and Nepali artwork.  I was really impressed by their diverse menu(Tibetan/Nepali/ Bhutanese and Indian)\n\nWe ordered family style- for appetizer we had chicken lollipop/gyuma(ask for deep fried)/wai wai sadeko and alu dum. My fav. were chicken lollipop (crispy chicken and the accompanying sauce*chef's kiss*\n\nFor dinner, we had chicken chilli with tingmo, chowmein/ chicken chilli/ thali and beef jhol momo/ veg momo and palak paneer. Along with the traditional dishes/ their Indian dishes were equally amazing. Need to go back for palak paneer and butter naan and veg momo.\n\nWe all ordered diff cocktails from the bar menu and my fav was the Yak kickstarter and Himalayan Squad.\n\nThe customer service was impeccable. The staff members were attentive and friendly. Dinner and cocktails were priced well. We ended up staying past dinner as their live music started playing at 8.\n\nCannot wait to go back with family for graduation dinner so I can explore more from the menu."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNX09PTTJRRRAB",
            "text": "It’s lovely restaurant, and beautiful design. The food is good and could say it was delicious. The music was an added bonus which makes the environment even better. The only thing that is lacking in my opinion is their service. There were more than enough servers but not organized, so they could not deliver good service to the customers. The place was packed on Saturday night, especially with the music event. For the first 30 minutes, the server showed up only once just to take the order!!! In the TWO hours, we stayed there, none of the servers stopped to ask if we need anything!!!! So, we waited until they passed our table and we asked them, but still they didn’t complete our request even after asking three times. I ordered soup, but they didn’t bring the spoon. I asked three times to bring the spoon!! by that time my soup got cold."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3NmZfRkVnEAE",
            "text": "Abi was a wonderful waiter, lots of great Tibetan/Nepalese dishes and wonderful atmosphere!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPOVlMT1FBEAE",
            "text": "This is a great restaurant to get a taste of Tibetan/ Nepalese/ Indo -chinese type of cuisine. The decor is beautiful, and service is excellent. The place offfers great value for money. They even have live music. Do try the dry aloo dum and the chili dishes such as chili mushroom/ chicken/ pork etc. The Shogo Gnopa with Tingmo is the very definition of comfort food. I highly recommend visiting here if you are in Jackson heights or you can even make a trip just for the sake of eating at this place."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnb09EVmFBEAE",
            "text": "Nepali restaurant mostly popular among foreigners and out of state Nepalis. Menu offers Tibetan & Indian cuisine too. Has live music in the evening after 9 pm. Love their C momo.…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtcTYzZHZRRRAB",
            "text": "This was my first time visiting this restaurant and trying Nepali food. The whole experience was absolutely amazing. I went with 3 other friends and we ordered several appetizers as well as 1 main main course, each. We started off with papad masala, samay baji with chicken, goat bhutan and wai wai sandeko. For my main I chose Thali with goat meat. Everything was beyond delicious. The fun fact is that thali is eaten traditionally with your fingers, you smash the rice and mix it with all the sides that come with it. Definitely worth checking it out and I am most certainly going back again! Enjoy the photos"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCdnFMZVN3EAE",
            "text": "The food was really really oily. It was heavily bathed in oil.\n\nThe noodles was swimming in oil, so we sent it back to be changed. The waiter was gracious enough to pay attention to our needs. Once the noodles came back, it still had the same amount of oil so we didn’t consume it.\n\nAlso ordered chili mushroom, again it was double/triple fried as the serving bowl was full of oil.\n\nThe food was tasty but I wouldn’t bother visiting again because of the health quotient (negative)\n\nAte four items:\n1. Veg steam momos (good)\n2. Chili mushroom (tasty but oily)\n3. Veg chowmein (drenched in oil)\n4. Chili momos (tasty but drenched in oil)"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDbDh1akJREAE",
            "text": "We placed our orders via Uber Eat from Himalayan Yak with assigned time and the entire process went smoothly.\n\nOur friends highly recommended us to try their Chicken Tikka Masala and Garlic Naan. We also ordered the Chili Fish and signature Pork Momo Dumplings.\n\nThe food was amazingly delicious especially the Garlic Naan which was baked soft and appetizing. The Chicken Tikka Masala was rich & creamy and the Chili Fish was super tender.\n\nHowever, the Pork Momo Dumplings was not our type, the wrapper was too thick and overcooked. The pork filling didn’t have good seasoning and was kind of gamy."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQybm9fYjN3RRAB",
            "text": "Drinks are cheap\nFoods are ok\nAvoid sizzler( too much onions , literally half the dish was  just fried onions and had to be discarded)\nWe made reservations at 7 and reached there sharp just to be told that there were no seats . There was a table of 4 vacant but since we were two we were told to sit at the bar. However the server at the bar told the waitress to place us at the table since we had reservations.\nWe ordered chicken sekuwa 9/10\nChicken chowmin 7/10\nChicken sizzler 3/10\nDrinks were woodford reserve which had crushed ice pieces. Why would you do that to a whiskey?\nOverall it was ok and would visit again if I was in the area."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VNZmRzclhLb3NIc3VRRRAB",
            "text": "Food has fallen off a little and the menu is smaller. But the portions are good and there is a lot of variety. Bengla, Tibetan and Nepali offerings so no one will go hungry! Veg, meat, dumplings, rice and noodles. You can't go wrong and, if you do they'll make it right.\nLive music and an upstairs lounge on weekends."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQNzZxcFBkbjQyT0VnEAE",
            "text": "Abi (waiter) was great! Food was delicious and ambience was great. Highly recommend"
        }
    ],
    "reviews_count": 83
}