{
    "name": "Oceanic Boil - Jackson Heights",
    "place_id": "ChIJ4-VKQ69fwokR1KF-Mo-Zk7A",
    "grid": "QN3",
    "address": "84-20 37th Ave, Jackson Heights, NY 11372, USA",
    "rating": 4.5,
    "user_ratings_total": 1242,
    "phone_number": "(929) 296-6338",
    "reviews": [
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OTVpXOHdVbkZIWTNWbWJVWjJkVE5ZYWpWNlZWRRAB",
            "text": "I feel satisfied after eating here. They've created a space that feels both current and comfortable. Their dishes offer different flavors and all taste freshly made. The worker's upbeat approach really improved my night. This place earns its high ratings."
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkU1RqWjFaRjgyTFVrMVExVjBhWFZvUlZSa1dGRRAB",
            "text": "Came here for the first time, amazing food, Great service, would definitely recommend people coming here.\nBella and august you guys are amazing. Will definitely come back."
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzal9HSzFRRRAB",
            "text": "Oceanic Boil: A Local Gem That Keeps Me Coming Back\n\nOceanic Boil has officially earned a customer for life! Why make the trek to City Island when this incredible seafood spot is right here in the neighborhood? From the moment you walk in, the family-friendly staff makes you feel welcome, and the ambiance is warm and inviting.\n\nThe menu is nothing short of amazing, offering something for everyone. Whether you’re craving King crab, snow crab, surf and turf, sliders, soups, or one of their many other mouthwatering dishes, every bite feels like a trip to the Big Easy. Pair it all with their delicious drinks and reasonable prices, and you’ve got a winning combination.\n\nI’ve dined here countless times, and whether I’m sitting at the bar or enjoying a meal at the table, the experience is always top-notch. If you’re looking for incredible seafood, a great atmosphere, and\nexceptional service, look no further than Oceanic Boil. I LOVE THIS PLACE, it must be the Whiskey 🫶🏽"
        },
        {
            "date": "수정일: 3주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWSlZYRlhTVUYwY0dweldWUTVNMmQ1UVVaQ1JYYxAB",
            "text": "Excelente"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kd2VYbFlVelpwUjJsVGJVdE9jVlpuVFVKaFpXYxAB",
            "text": "this place is a hit or miss i guess it depends on who’s working. I would come every Sunday and have a great time but more recently my food has not been good and everytime we would get less food than before. I asked the server because this past recent time i only got one crab left claw and the server was like that’s how it normally is I’m like no i come literally every weekend and always would have 2 plus a decent amount of potatoes and corn. Now you get one corn 2 potatoes and 1 snow crab claw. I WOULD NOT RECOMMEND ANYONE COMING HERE! What was once a good establishment is now going downhill. It’s sad"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oNU5tdEJkMk5aYmxoNE5EY3lTMjQyVlRSVFRtYxAB",
            "text": "We came here for the first time for Friday night dinner. We had the crab roll and fries. We didn’t know the snow crab and shrimp boil came out with the sauce pre-mixed in and the sauce was too spicy for my toddler.  The staffs are very friendly and kind and offer to re-make the boil for us with the sauce on the side. We really appreciate the friendly service and yummy food. Thank you!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xcFJYVjVaMjl1VG1Kc1lWSndPSE0yZFc1Q2FXYxAB",
            "text": "Amazing 👏 🤩 but pricey"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3M2R6UXlNa0Z6VEdaUlZrOWxjVXRKZERWNWFuYxAB",
            "text": "Amazing food and happy service"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xZlpGcEZNRzlLTUVac1UyaG9VV2t5TkhCbVQxRRAB",
            "text": "Excelente"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKbGRrbDVlRGQ2YVRoNk1XRnRORVpvU0hOVFVtYxAB",
            "text": "Great food at a good price."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201R2IydFhRemRQTjJOeFgwZFNaRTQ1VGtwdGRGRRAB",
            "text": "Food is good. Drinks are excellent!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCSVFWVnFTa2xoU1ZGV1JFUjNNR3RMWTFWb1VIYxAB",
            "text": "I traditionally have lobster on my birthday but also craved a seafood boil. My family and I stopped in last week to celebrate, we made a reservation but it honestly wasn’t needed. We sat quickly and there were still seats available. My mom and I each had frozen daiquiris and boyfriend had a Sapporo. Service was OK but the food really delivered. I had 1 lb snow crab and 1 lb crawfish. My mom and boyfriend had lobsters. They estimated the size to be 1.5 lbs.\n\nI had mine mild with seasoning, theirs was mild. I had a lot of crawfish. The food was not overcooked. They shared some of the lobster with me. It was delicious and meaty.\n\nThe waitresses were super kind and friendly to my toddler. He tries to befriend everyone he meets.\n\nThe meal and drinks were about $200 with tip!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFemFWbFZhbEY1ZEdSVGRFTTRhWGxzWVRWVE5WRRAB",
            "text": "I ordered crawfish boil. The sauce is just good. The crawfish is awful taste like frozen and kept in the freezer from long time.i will not come back again. Service was just okay."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paSWRua3dUVWhwTVRoSU16bHpZbmg1Y0djeFpIYxAB",
            "text": "Great service and food is amazing  I'll  definitely be coming back 😋"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4eFIxaHJiRkpwTFVWblVUWTVTUzFuUW1ORk9YYxAB",
            "text": "The lady on the phone was so rude! I haven't finished yet she hung up the phone! Train your employee to be polite!"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5aWVDRlVnEAE",
            "text": "Really good restaurant good food as always\nYou can  eat at the restaurant or chose to go. Flavor never changes.  Since they opened until now I been eating here frequently  and I love it every time even more.   You can place an order from the website and get points. Each dollar spend equals 1 point (100 points  gets you 10 dollars off )  you  pay when you pick up.  NO Tap just fisical card or cash. The only thing I wish they can improve is the alcohols drinks. But the food always the best. I love Garcia noodles and snow crab legs"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201UlFXWlhVR0pZVERSSFVsSkhNRFEzVm10b1gyYxAB",
            "text": "Service and atmosphere is bad. Food is good. Prepare for a very loud environment where you can’t even think or talk. Not a great date spot. Just prepare for noise and lots of it."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3b0szT253RRAB",
            "text": "I went for lunch around 12:30 in the afternoon. My bill was $200. I gave my daughter $220. When I returned from the restroom, my daughter was holding the 20 dollar in her hand i ask why, and it was because the lady returned the $20.00 tip and was  demanded more.She made it very clear to my daughter said her tip should be more Because of this selfish greedy act, the lost a regular customer. 😤"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psUFNFUTNialJ6ZVhSemJYVjRSVVpPY0VzdGJXYxAB",
            "text": "Best boiling crab in NYC"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLcjczSnk4MG83RE5REAE",
            "text": "Great food and service the sauce options are great"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCbkxheV9nRRAB",
            "text": "Absolutley amazing food, i've gone here so many times and the waiters/waitresses are really nice, they remember us too. I do have to say though, the music selections dont fit the theme too much, but hey thats just a nitpick from me. Highly suggest this place!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKbWU3OGlGMXJmUHRnRRAB",
            "text": "The vibes at Ocean Boil are immaculate. The food is extremely delicious and drinks are phenomenal!! Definitely recommend. Thank you."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQUDd3Ykd1X0xEeG9BRRAB",
            "text": "I like everything"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChRDSUhNMG9nS0VKaVVuZS1uMXRweBAB",
            "text": "Food is delicious. Service is terrible !!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VKTGM3Nmloa1lydzB3RRAB",
            "text": "I love the seafood and very quiet atmosphere"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvaS1iRW5BRRAB",
            "text": "I was craving mac and cheese and calamari and found the perfect place to try. Fried calamari was 10/10 and it comes with fries. Mac and Cheese (with cajun) was 9/10 just because I’ve had others that were a bit more flavorful but will absolutely recommend both and the place itself. The decor was so cute. (I had a takeout order)"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJdFkyaUhREAE",
            "text": "Why the staff never pick up the phone?"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRejZ5UGdRRRAB",
            "text": "Best of the best boils"
        },
        {
            "date": "7달 전",
            "language": "zh",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRdHRydG1BRRAB",
            "text": "太棒了，\n他们的手抓海鲜，\n妈呀，\n油脂在舌尖跳舞！\n了解了更多的酱料选择。\n很喜欢，\n贵族的享受！\n别出心裁，\n来之不易！"
        },
        {
            "date": "8달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRLUliS0pnEAE",
            "text": "Ambiente tranquilo, servicio cordial. La comida es deliciosa aunque los acompañamientos son pequeños. Pero el sabor de la comida es excelente. Sin dudas volveremos a comer allí.\nComo recomendación sería bueno que tengan mesas al aire libre."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnTURneE45ZhAB",
            "text": "Comfort food!!! My go to food is the Oceanic Boil in this location always. Tried once, and never look back."
        },
        {
            "date": "8달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNndHUtTzhnRRAB",
            "text": "Excelente servicio\nLos mariscos la especialidad\nAtención lo mejor"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBaE9uaWlRRRAB",
            "text": "We awer ther I really like the vibes. Very quit and peaceful  love the atmosphere  and service is 5 star very polite  respectful.  Very patient  with children and price was also  very reasonable.  Over all we loved it . Beautiful experience. Thank you 🙏❤️"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfeDRHaHdBRRAB",
            "text": "Convenient location even though parking can be difficult\n\nOceanic boil sauce is good\n\nSides are smaller than other boil type restaurants, specifically the catfish and weekly special\n\nPrice is about average for boil restaurants\n\nService was average nothing special, server wasn’t very attentive and was massaging their back with a stick\n\nMain gripe would be that our party of four was charged gratuity when the signage said 18% for parties of 6 or more.\n\nWould’ve left a tip regardless but seems sort of disingenuous to be charged that when we came with a party of four but maybe the server thought we weren’t going to tip?\n\nSeemed a little slimy especially with the server who wasn’t very attentive or seemed like they wanted to be there\n\nAnyways food was decent, but be prepared to be charged gratuity for just sitting in the restaurant"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfbHRXWE9nEAE",
            "text": "I prefer Oceanic Boil, Forest Hills. The smell of butter garlic and stone crabs mixture was perfect and generous amount of paste included on my first try. So, I thought that the recipe would be same at the Jackson Heights branch but my thought was ruined. The curry paste was just stuck and seen at the base and the taste was salty. The most upset point was the crab were not cooked well enough to be hot and immersed with the paste. I won’t choose Oceanic Boil JH next time.\n\nSo, whose idea is it ? to add corns which were not fresh, the chef or the owner. Do you think that the customers’ stomachs are garbage bags. One corn cost just $2 in the market. God bless you."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfeXJpVHRBRRAB",
            "text": "Food is great here !  Love the shrimp basket with fries 🍟"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmazhickpnEAE",
            "text": "Fresh delicious shrimp and crawfish. The garlic noodles are delicious and my favorite side dish item. If you're gonna choose any sauce for your boil bag, I highly recommend going with their house sauce, aka the Oceanic boil sauce. I like mine spicy so i went with the spice level that's the second hottest, the one before the spiciest. If you're in Jackson Heights on 37th ave, highly recommend stopping in."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmeE5pbU9REAE",
            "text": "Consistently good. Easy to order."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2N3ZQVV9nRRAB",
            "text": "Beautiful place."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzMjhlUzRRRRAB",
            "text": "The Seafood was not fresh really  horrible I found hair in it and they drown it in butter"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzdlBpT3F3RRAB",
            "text": "Good food\nGood service"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzdk5pczNRRRAB",
            "text": "We ordered a to-go order. The service was fast and friendly. The food was very tasty. Definitely recommended."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYaWV6RzJnRRAB",
            "text": "This no frills seafood boil is no joke! The cook on our snow crab, king crab and shrimp was perfect! The seasoning, old bay and garlic were a perfect combo. If you are near the airport, on a lay over or live nearby this place isn't one to miss! Plus the neighborhood is really cool and classic!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIeGVPUkpBEAE",
            "text": "The fried brazino was good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3d01iS3l3RRAB",
            "text": "Food is decent but they forget to pack orders for to go and the wait time is very long. If you order from here prepare to have missing items and not realize it til you get home."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3X0stNy1BRRAB",
            "text": "I had the king crab leg boil with garlic pepper sauce. Good for the price."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiNTQtZ0dREAE",
            "text": "The best way to eat seafood sometimes is with your fingers. Both fun to eat and delicious, the snow crab legs and shrimps were big and smothered in creole seasonings. The french fries that came with the baked oysters were especially tasty. For the price I just wished they put in more corn and maybe some squid like in other seafood boil restos."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNieUlDY2hRRRAB",
            "text": "I always go here and its amazing. Quality and freshness are always consistent and the flavor of the sauces omg 😍 Food is good even when you order to-go. The staff is always friendly and there is never a long wait time for the food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURycVBhQTN3RRAB",
            "text": "Delicious!!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyd1B2bHpnRRAB",
            "text": "Great place for a seafood boil. Must visit"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwczl2dzBBRRAB",
            "text": "Great find and enjoyed our visit overall. Good/clean restaurant. Friendly and professional staff. Delicious food. Good drinks. Love boiled snow crabs and Shrimps,  spinach with garlic butter that they were do tasty."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPeXIyUWxRRRAB",
            "text": "Great find and enjoyed our visit overall. Good/clean restaurant. Friendly and professional staff. Delicious food. Good drinks. Only downside: Wings were salty and parking was tough, for those travelling by car. They have a nice outdoor spot but be prepared as it's on a heavy pedestrian sidewalk. Will visit again if in the area but not driving there again."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1NVl1NExREAE",
            "text": "Went here as a party of 3 on Wednesday night around 8pm. We were seated immediately with options for both inside and outside. We started off with some Oysters which were nice and fresh. I usually don’t eat my Oysters with Cocktail sauce but I tired the sauce and it was good. Then we had a Lobster Roll and Fries which was so yummy. We ordered one to take home. The fries had this amazing seasoning on them and were hot and crispy. Then we got a Shrimp and Crab boil with the Garlic and Old Bay seasoning because my sister doesn’t like Spicy. But we ordered a side cup of the Oceanic Boil sauce which was SO GOOD. I would definitely get that one next time if my sister isn’t with me. Drinks were your typical frozen drinks nothing amazing but not bad. Service was pretty good. A little more on the expensive side but not bad when you split the check. Definitely will be returning."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSMXVqV0l3EAE",
            "text": "Best seafood boil i’ve had! Most seafood boil places i tried their sauce is so overwhelming and salty. But their oceanic sauce is really good it’s spicy n good. The service was amazing super kind and nice staff. We came in just before it was last call. I had the snow crabs and the shrimp boil combo. The fries taste like cajun seasoning very good. they provide you with gloves and a cloth to protect you from getting your hands dirty. Great spot you gotta try it out!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkck1qMjNBRRAB",
            "text": "This was my first time trying seafood boil and the experience was really good. I am a spicy food lover so having the option to choose your spice level on the menu was a plus for me and the combination was really good.\n\nThe oceanic combo gives you a good amount of food which can easily be shared between three person (saves you a little money). Besides I also loved their Piña Colada.\n\nSide note: the seafood boil experience can get a little messy, so I would suggest having extra napkins and ask for an extra pair of gloves."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsbmZDRWVREAE",
            "text": "The best I’ve had in NYC area! Got a pound of crawfish with their oceanic boil sauce and the spicy level isnt too intense. The crawfish were big and meaty, and they threw in potato and corn into it too! Note that it’s $19 a pound which is at least $5 more than what you get in the west coast or Texas.\n\nDelicious fries too. We did their promo of the week which was 6 oysters + fries for $15."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2LXJQUUx3EAE",
            "text": "Great service. Very fast, nice people great strong margaritas. Watch yourself! The food… I mean… I’m a huge fan of a boil. Big old bay and butter fan. I tried there spice mix which is also mixed with garlic butter. Chefs kiss! I really want…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4N3FMNGpnRRAB",
            "text": "Food here is soooo good. I love the piña colada is everything you look for in it. The garlic bread is so tasty and crunchy. The garlic noodles are amazing too. Their special sauce is really good and the spicy is really spicy so be careful…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlbl9DcTN3RRAB",
            "text": "the food overall was good but not great, the lobster was over cooked and not that tender. to be honest we had only one crusher for two people to share as a tool to eat all these seafood and nothing else to dig in the crab legs. we are not that experts to know how to eat it properly. the portions were generous and the butter with the spices makes the food even better. now for the restaurant as a first time customer it wasn’t pleasant to find next to me on the heater side a shrimp head , that’s a red flag . but again we had great time and the stuff was friendly. but lest be clear if i had to spend that much money for my lunch i would give them to most expensive and luxurious lobster restaurant in the town and not here. it’s ok for one time experience."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNNdDVhNVJnEAE",
            "text": "This place was a hidden delight, my wife found it while doing a random search for seafood. Only 2 things I would caution parking is bad and the place is cozy. So if you do go be prepared to spend some time looking for parking or place it in…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyNWJuT1B3EAE",
            "text": "I ate here with my family with a party of 7 at 5pm on a Sunday and we were able to be seated without any problems.  We ordered 2 combos of 1 pound shrimp and crayfish, 1 pound of snowcrabs (all with oceanic boil sauce), and alot of appetizers (noodles, sausages, spinach), and alot of frozen drinks.\n\nOverall we really enjoyed the food and alcoholic drinks.  The gloves they gave were all 1 sized and didn't fit smaller people hands well.  We will be coming back."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhX3V6SFVREAE",
            "text": "Great staff\nFood is served fast.\nHappy hour is a must!!!!\nFrozen drinks are really good.\nOnly thing in my opinion is always ask for extra sauce lol\nFood was on point\nCan’t wait for next time."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNneVpiZmpnRRAB",
            "text": "I went to this place on a Saturday evening. The place was packed and we were lucky enough to find spots near the bar. We ordered our drinks there and after 10 mins got out seats at the table. The decor is as you expect it since it’s a…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwdzlmOVlBEAE",
            "text": "These \"boil\" restaurants are popping up everywhere. On this visit I didn't get to order any boil, allergies. But I did order lobster and soup! The New England style Chowder is not too thick and they put bacon crumbs in it. Adds so much more flavor. My friend ordered the steak and it was really good. Great sauce and color on it."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM0OU1XTGt3RRAB",
            "text": "OThis place is amazing from the food to the Staff! Every single time I come here I leave happy! Fresh fish, shrimp , shell crabs, king crabs and lobsters ! All steamed / cooked / baked to the perfection! Fresh and a great Colbert always !…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKb0lTd25BRRAB",
            "text": "Ordered the 1 lb snowcrab and 1 lb shrimp combo and added 1 more lb of snowcrab with their oceanic sauce (spicy level).\nSauce wasn't a lot, and it oily.\nTaste good, and the garlic bread goes well with the oceanic sauce.\n\nAs for the calamari, not my type, will prefer it to be more crispy."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvaXM2RHdBRRAB",
            "text": "Drinks are okay, could be a little stronger. Food is amazing service is great. Only thing I didn’t like was the wait time and space. Little bit cramped but very much worth it as the food tasted AMAZING! Soft shell crab is to die for!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkNTVlSjhRRRAB",
            "text": "I've been here so many times and each time the food and service is so consistent. It's a great spot for delicious seafood boil! I recommend the 1 lb snow crab leg and the Cajun Mac and cheese."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNna29YUUN3EAE",
            "text": "Very attentive service. Servers were very polite and willing to answer any questions. Food was great! Make sure to use gloves if you decide on a boil. It'll get messy but fun. If your a shellfish lover like me, you'll be very happy. Happy hour has one dollar  bluepoint oysters! Monday through Friday 4-7."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDNWIyVHNBRRAB",
            "text": "This was our 1st time trying out this restaurant & we were not disappointed! The food was delicious & I definitely recommend this spot. We arrived & were quickly seated outside.  My only complaint: the table was too small for 3 adults. I had to take our 3 cups of water & put them on the bench beside me, so that we could fit our main plate & eat as comfortably as possible. It was a messy meal, but we had our bibs & gloves on. We ordered the Oceanic Combo in the mild garlic butter & lemon pepper sauce & it was a huge portion. We shared this combo between the 3 of us & still ended up taking leftovers home. It was so good. I had a peach lemonade with my meal & it was great.\nThe area is very busy, & finding a  parking can be an issue, especially on the weekend. But the food makes it all worth it. But hey, don't take my word for it.. try it out yourself! ENJOY!😊"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3NUt6Q0d3EAE",
            "text": "Small place with a lot of heart. Fantastic customer service, although this might have also been due to the small number of people because of the rain. Food was amazing. I wish the chairs were a little more comfortable given the time you…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXMjVhalZBEAE",
            "text": "My first time with this type of food.\n\nI was quite nervous and hesitant because I am not a big fan of crab or seafood in general but this restaurant left me wanting more.\n\ntheir sauce is special and delicious, can't wait to eat here again."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNNOTdpcVNREAE",
            "text": "One of the good seafood place. Not a big fan of seafood but tasted here and was good. Drinks were nice and so was service. The music they play for birthday celebration was lit. It was loud and interesting. Must try place."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPalpQcC1nRRAB",
            "text": "My experience was lackluster this time. The waitress wasn't that good and was easily overwhelmed with 5 orders. When she did bring the orders, things were missing and they had to be brought back with help. The daquiris weren't that good either."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMydjY2T2FBEAE",
            "text": "My very first time trying boil and I loved it!!!\nIt was so much fun and yes, you will get dirty, bring an elastic band for your hair and not your favourite clothes!\nIt was super tasty! The staff was very friendly!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM4bTVtQXdBRRAB",
            "text": "We ordered take out due to pandemic. I have been only dine-in this place, but surprisingly their take-out was also amazing! Great value and their garlic noodles with the left over the sauce is a MUST! We order the combo and 1lb of shrimp…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxa1pUYzRnRRAB",
            "text": "This was my first seafood boil experience and I loved it. The servers are very attentive and the food was just amazing. We got a fried mussels and 1lb. snow crab leg and 1lb. Shrimp combo with the oceanic boil sauce for a party of 3 and it was perfect portion. We spent around $30 each including a 20% tip which was not bad at all. Visiting again!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREbzhXd3l3RRAB",
            "text": "Seafood is good. Wish they had less spicey options like golden butter oil without the Cajun spice."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxdjhxMzN3RRAB",
            "text": "Best place to eat seafood and the prices are great!! We’ve been ordering from here so often!! Highly recommend!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSURoaXF3UBAB",
            "text": "Everything was so good! I would definitely come back I wanted more 😍 but definitely a good place to eat seafood"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1MUlEeDRRRRAB",
            "text": "AMAZING!! The creamy obay garlic sauce is EVERYTHING! The service is AMAZING and very friendly and definitely brings your food out in a timely manner. Bar is just as good. I was surprised the drinks were only 10 bucks for a mai tai which was delicious! I will continue to travel to Queens from Bloomfield NJ for this amazing seafood."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4eE11Q2xRRRAB",
            "text": "I just received my food and ate.. but it doesn't cook well. Taste was a little weird than usual. So, I checked shrimps.Many shrimps were half raw.  I am carrying a baby now. I am soooo worried about it."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURrMDlxcEt3EAE",
            "text": "Amazing! The wait for a table and the food is worth it. Prices are in line with what seafood usually costs, a combo is around $30+. The staff is friendly and the music was good. The food was well prepared and tasted so good. Will definitely be going back."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJaHJMSUJnEAE",
            "text": "I am very surprised, the seafood here is fantastic. We ordered the oceanic comb and it was just incredible. The sauce was perfect not to over powering.\nHowever the shrimp for the fried basket was to small and over cooked.\nThe seats are also a very uncomfortable.\nOther than that if you are trying this out for the first time my recommendation is to go for the fresh seafood Oceanic combo or the snow crab.\nYou'll love it."
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnX29mNDVRRRAB",
            "text": "I ate here tonight, and I thought the crab was delicious. I’ve never tasted anything like it! I extremely LOVE seafood, so I had high expectations for this. I’m pleased to say that this has met it. We had the soft shell crab with fries as…"
        }
    ],
    "reviews_count": 85
}