{
    "name": "Sushi On Me",
    "place_id": "ChIJya9SkEZfwokRER22OiahUrY",
    "grid": "QN3",
    "address": "71-26 Roosevelt Ave, Jackson Heights, NY 11372, USA",
    "rating": 4.8,
    "user_ratings_total": 516,
    "phone_number": "(917) 821-5598",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pnM2JqZERhV2xwTldoVU16bGljMFZ6Vms1TFdHYxAB",
            "text": "Fun night although too short!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pRM1RFNHRSMHhzYjNKcFNEaFNkR040VVVvMFIzYxAB",
            "text": "I went to the Jackson Heights location on a Friday night with my boyfriend and his best friend. There were only five people in attendance, but the chef and staff were so fun and so friendly !! We did karaoke too!! I wasn’t a sushi girl before but I am now lol the food was literally amazing honestly, I  want to go back everyday LMAO!! I loved this place !! Such a great experience and delicious food!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSMFFsQlVOV1kxTTBzdE0yaFpjMnR5VEdsVFdsRRAB",
            "text": "I love this vibes!!!\n\nDelicious and fresh ingredients for Omakase.\nEnd with yum cheesecake ❤️.\nFunny and good entertainer staffs.\nFree Sake ….. wow it’s crazy!!\n\nI really enjoy this.\nWill back by soon."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toTWJVeFpZWFpaY25neU9WUjJVamh5UkVkdGFsRRAB",
            "text": "What a luxury to be able to have this in my neighborhood. I’ve been here three times now and each time I leave feeling like I had just gone to an underground party and enjoyed some great sushi!\n\nThe AYCD sake is a plus. They are super attentive in refilling your cup. The omakase is far from the traditional omakase however I like how they incorporate Thai flavors into their dishes. The Penang curry with eel over rice is the perfect amount of spicy and sweet. They serve a good amount of appetizers before preparing the sushi pieces and ending with a dessert.\n\nIf you have a birthday person in your group, prepare to sing! It’s so fun to see a group of strangers coming together enjoying sushi and just having a good time. The chefs are hilarious and I always enjoy coming!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGQk5XbDVlbHBPWlZVNVdVTnJkVUZoYTNCclVWRRAB",
            "text": "Very interesting and entertaining place.  Food was great.  Overall a very unexpected but wonderful place."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5NlozbG9ZV3hDVW5rdGNFTTFURXd0YkhVMVlrRRAB",
            "text": "The food was amazing and so creative. The ambiance was cozy and they picked great music. It was only us and 1 other person on a Friday night and they served us with the full attention, refilling sake glasses as soon as they were half empty. We're from our of town but next time we're in NYC, we'll definitely be back."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjd2NqaFhSblJwYW5Fd01tdHpaVFl3Y0RoaWJHYxAB",
            "text": "Vibes are there, beginning dishes are a bit eccentric but it’s gets more consistent and normal sushi towards the half way point. Last course of 15 is dessert. Cash only. Reservation recommended. Has a bit of Bou vibes and decor. Staff are very warm and jovial"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWVFpVVktRMDR6VmtKaVJXNVpSbEZWTkU1Qk5uYxAB",
            "text": "Absolutely life changing experience- staff was incredible, food mind-blowing, and I could not recommend this place enough!! Emphasis on staff, seriously iconic comedians working tonight!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGZlRFMUdUbWRpYkRrMlRXbG5hbmxPV1hWMVJFRRAB",
            "text": "We had a BLAST! Was in town for the night and craving sushi for a birthday so not knowing much other than a good rating, we made a reservation. It was perfect because we needed a later slot and they were open! Sushi on Me first and foremost, had awesome food with varied flavors that were adventurous and fun to see how passionate the staff was with their inventions/recreations. They spoke of various Asian cuisine influences and it was clear they know their stuff and have fun doing what they do. Secondly, the atmosphere was unmatched! We observed the group ahead of us who all seemed to be having a great time as a large group and I think we had just as much fun with our small group. They seemed to even pay close attention to what songs a group may love and then cater to it for more personalized and fun approach, would even taper the volume depending on the vibe at the moment. For our one night in NYC it was the best choice we could’ve made!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SR1RXNXdUSE5YTjFoblgwUXlSWFZCWTFWRU5GRRAB",
            "text": "The staff here is absolutely amazing and makes everyone have a great time. As quick as you can drink is as quick as they’ll serve you sake. The sushi is amazing too however I am not a sushi snob or connoisseur so for the average person it’s very good sushi."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WSFJEbGlSV1pwVUdsR2VsZGpZbkJaUlRZMWNXYxAB",
            "text": "Literally the best dinner I've had in my entire life\nIt turns out to be a karaoke dinner with great staff\nRecommend to everyone"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkVU1FUldaRmhwZERsQlZuRnFhRTlrY25sWVptYxAB",
            "text": "This was a really fun experience! I have my usual sushi order I go to, and shy away from omakase because I always get sea urchin…. These guys did not give us sea urchin! The guys serving were awesome, and they really go for a party/celebration atmosphere. I had a great time and definitely recommend!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGTVlrdDZPVWRzVkhjelVHbE9jbmR6VTBNNGJHYxAB",
            "text": "Overall:\nThis was easily one of the best Omakase experiences I’ve had—and one of the most fun nights out in a while. It's also one of the most unique Omakase spots I’ve come across. Highly recommend if you’re looking to celebrate a special occasion, enjoy a lively night out, or try inventive Omakase courses with a twist.\n\nFood:\nNone of the courses tasted overly fishy, which can be a concern for some. With 15 courses, you’ll definitely leave feeling full or close to it—especially if you take advantage of the all-you-can-drink sake. I really appreciated the variety in the dishes and the unique touches that set this place apart from other Omakase spots. The Thai Fish Panang Curry, in particular, was a standout—it was absolutely amazing and a great example of the creative twist they bring to the table.\n\nService & Atmosphere:\nI'm combining these two because at this place, they truly go hand-in-hand. The service is top tier. The staff is not only attentive but also genuinely focused on making sure you have a great time—not just a great meal. We went with a large party for a friend’s birthday dinner and the team went the extra mile to make it special.\n\nIf you're into places with a louder, party-style vibe, you’ll have a blast here. It’s for sure a departure from the typical quiet, refined Omakase setting—but in a good way. Personally, I enjoy both styles—and this one delivers a truly memorable, high-energy experience."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCc1dGQnFUM1ZyTkZSTFlYRTVaWEJTVjFkMVVGRRAB",
            "text": "Hands down one of the best sushi omakase experiences I’ve ever had. Every dish was executed perfectly — fresh, creative, and absolutely delicious. You can tell the chefs truly care about their craft.\n\nThe service was just as impressive. Attentive without being overbearing, and genuinely warm and friendly throughout the entire evening. What really set this place apart, though, was the vibe.\n\nThey matched the music to the dish being served, creating a super fun and immersive atmosphere that elevated the entire experience. It was playful, unique, and made the whole dinner feel like a curated performance.\n\nIf you’re looking for incredible food and a memorable night out, this is the spot. Highly recommend!\n\nSwiss can really sing!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kSFMweFVTRFUzUVVoemJqTk1VRkZVV0ZkSk1IYxAB",
            "text": "Sushi on Me is easily one of the most unique and consistently amazing dining experiences I’ve ever had.\n\nThis Thai-Japanese fusion omakase spot is a must-visit. I’ve been here multiple times now, and each time I walk away even more impressed than the last. The quality of the food is outstanding—creative, flavorful, and beautifully executed. The fusion element adds such a fun and unexpected twist to traditional omakase, and the variety keeps things exciting with every visit.\n\nWhat truly sets Sushi on Me apart, though, is the vibe and the people. The energy in the room is always upbeat and welcoming—fun music, lively atmosphere, and a staff that genuinely seems to love what they do. The team is just as warm and attentive on your 5th visit as they are on your first. It’s rare to find that level of consistency in both service and experience.\n\nIf you’re looking for amazing food, great vibes, and a team that treats you like family every single time—this is the place. 100% recommend."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twNVdGb3pjR1JtU1VjeVdWcG9NVUpqT1RsWE0xRRAB",
            "text": "The food was astounding and the sushi chefs created such a fun atmosphere to be apart of. They helped us celebrate our friend's birthday and made it an unforgettable night. We had so much fun; can't wait to come back and experience it all over again."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KNmIzUlVaekZCVTNkd1VtcDJNR0k0YXpsTVdHYxAB",
            "text": "I had an amazing time at sushi on me! I always love to come here on special occasions and this time it was for my sister’s birthday. All the chefs made it a fun and hospitable environment and made it a special day for the birthday girl. Food was amazing and chefs made everyone feel as if it was their birthdays on a Thursday night! Overall a 10/10 experience, come here if you want an amazing 15 course omakase experience and for the even better company!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wQk1DMW5TblJpZVRreldtdzNaa1F3VVZWd1JWRRAB",
            "text": "Sushi On Me truly lives up to its five-star reviews. The moment I walked in, I was greeted with a warm welcome by one of the staff members who then told me to have a seat while the chefs were preparing the dishes.\n\nI sat down at the counter bar and was treated like a friend by the staff. They poured me a sake shot, made jokes, ensuring that I would continue to have a great time.\n\nThe omakase itself? They were incredible since the very first dish. I tasted Japanese delicacy coupled with high-quality and creative pieces. One of my favorites was the grilled eel in panang curry. I could have never imagined such a fine combination of Japanese sushi with a flavorful and traditional Thai curry. It was nothing like anything I have ever experienced before. I'm craving the dishes again as I write this review.\n\nWhat truly made this experience a highly memorable one for me was that I came to celebrate my graduation, and the staff members went out of their way to make it personal. I was surprised with a handheld firework and sincere congratulations.\n\nThank you to Sushi On Me for turning what seemed like a regular dinner experience on the outside to be one of the most unforgettable nights of my life. I could not recommend this place enough. I will be back 1000%."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWRlNWTXdSRGh4U21Zd1ZqTjZiR3R2YmtaSE1FRRAB",
            "text": "I never write reviews like this, but it needs to be done here.\n\nGoing to this place felt like going to the CIRCUS. A circus with drunk servers, comically bad customer service and food that was so bad we had to leave finishing only the 4th course out of 15.\n\nCame in, restaurant was empty and we were greeted warmly with sake that wasn't the worst but was not the best either. The servers / chefs  started apologizing saying that they were not ready to take us, we patiently waited for them to prepare the bar and food. While getting the bar ready they shared, that \"they are drunk as hell\", offered us to get drunk too, I refused nicely, stating that I am not drinking today. After that, the circus started.\n\nThey started playing all different genres of music loud, switching the vibe from classic music to trap / techno / edm. Honestly, I would stay, if the food would be at least good and worth $150~ pp. But all courses tasted same, caviar, both red and black were clearly artificial, curry sauce and no other creativity with straight up bland raw fish, I couldn't handle it anymore, the fish was not sushi grade, I am so sure. Since I was not drinking, I asked if they have any zero proof cocktails, they said no, I asked if they have coke or lemonade, they said no, but they have DIFFERENT TYPE OF COKE. or weed. Apparently the place doesn't have a liquor license, which I could understand, but not having anything, but the sake? And not even having ice?\nWaiters were hovering and I felt so pressured to respond and laugh, it was fun in the beginning though, but being drunk and making food?\n\nAfter I said, we have to go, waiters took it a little too personal and said, I was being rude, \"accusing\" them in being drunk (even though they bragged about being drunk and made us toast with them many times). Tried to gaslight, that they are not drunk. Said we have to pay a full price.\n\nFor this circus? We were generous enough to leave $160 cash, since they don't even take CC's.\n\nThey threatened to call the owner, which was funny too, them trying to escalate the situation, where clearly no one was mean to them. I said fine. And they let us go leaving $160 telling us that they hope, they will never see us again."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kSk1GSTNUbWxaTm04M1VHWjNURlJQTnkxRVFrRRAB",
            "text": "Cheap but still overpriced. Rushing a so-called omakase in 50mins is funny. Food is not good."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twTmJGUkRaREJtVXpCdU4xUkRNREprTlVGbmJHYxAB",
            "text": "This is your sign to book it and go\n\nAwesome service, great atmosphere (more party than a quiet dinner) and the food is delicious!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKRGhwdC1YNDkzYWJREAE",
            "text": "Love this place! Food was great, staff was nice overall."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKVDhnSmlONEpITTNBRRAB",
            "text": "Everything's awesome here!  The food's great, especially the fresh sashimi.  The waitstaffs are fantastic, always on top of things.  They're super friendly to everyone, and the whole place has such a great vibe – 100% for food, service, and atmosphere."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQU3E2NnI2b01hbnZnRRAB",
            "text": "INCREDIBLE experience"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZbXByYWJnEAE",
            "text": "If you are searching for a fun/lit omakase restaurant with speakeasy vibe and unlimited sake this is the place for you. The freshest fish I’ve had, they get it shipped in from Japan. Fatty tuna was my favorite. Music was great, presentation on point."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZZ3VLdUZnEAE",
            "text": "Great spot, got my dad wasted"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZb055VVZBEAE",
            "text": "Super delicious, best omakase experience I had"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvcEoyalRREAE",
            "text": "I had a great time here at Sushi on Me. The staff was attentive and my sake glass was always full. The food and the presentation was excellent and you can expect a mini concert from Sake Boy to wrap up the wonderful dinner. The place is a bit hidden (hence the speakeasy category) but once you find it you will be surprised by this hidden gem. They take Venmo in case you decide to tip extra for the mini concert lol."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvMHZUcE5REAE",
            "text": "Great time, very fun experience - staff is hilarious"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJMVlQSEhnEAE",
            "text": "My favorite Omakase place in NY\nFun and Friendly people with good vibe and great music! ! !"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJODViY1FBEAE",
            "text": "Absolutely fantastic! The best sushi I have ever had. My husband and I already want to go back. The staff and atmosphere was also wonderful. I would Absolutely recommend. They were able to make accommodations for a member of our party with a shellfish allergy."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJelpLbEd3EAE",
            "text": "If you want great food and a great time, you should 100% go here!! Had a lovely time!!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3eXNQdGlnRRAB",
            "text": "One of the best experiences in New York City in my 3 years here. Scrumptious food, divine vibes, and unlimited sake. I wish I could re-experience my first time here. My only advice to those who come here: let loose and enjoy every bite!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnNV9tcS13RRAB",
            "text": "Super fun experience - very small shop but the chefs were great sports and clearly enjoyed what they did. Not to mention a great deal for omakase + unlimited sake!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURndHB5cEJBEAE",
            "text": "This was the most memorable dinner I’ve had in my life!\nMy bf took me here for Valentines’ Day because I LOVE sushi.\nIt was perfect!\nThe 15 courses were all great, although some of the fish did not taste as fresh, the atmosphere and vibes made up for anything.\nThe chefs were so amazing, explaining every dish and making this experience great.\nIt was an intimate lovely experience that I would recommend anyone to do.\nI almost forgot, the UNLIMITED SAKE!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnMjQzc3V3RRAB",
            "text": "This place was amazing. 10/10 everything, truly. The service was great, very attentive, informative and fun. My partner and I and the other couples were a bit more low key at first but the chefs and Sake boy did a great job at hyping up the vibe. The music and song choices are incorporated with the experience and the dishes, such a fun time. BUT THE FOOD😮‍💨spectacular give me 14 of them. The course consists of appetizers, main dishes and dessert. The appetizers took it home for me, especially the oyster and smoked salmon dish. We are already planning our second visit"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnN09qTXd3RRAB",
            "text": "Amazing 15 course omakase with Thai flavors and influence. The catch is that here they give you unlimited sake with a rich and energetic atmosphere. The chefs are a joy to dine with, and the courses were all memorable. Cash only, but the value and experience is unlike any omakase at this price point. Make sure to reserve!"
        },
        {
            "date": "수정일: 9달 전",
            "language": "pt",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqbk1ld25RRRAB",
            "text": "A experiência foi divertidíssima em todos os aspectos, uma proposta realmente diferente, a começar pela \"viagem\" de 40 minutos para chegar ao restaurante. Para mim, é uma releitura bem executada da culinária japonesa, com preparos e molhos de outras culturas, numa dinâmica de serviço alucinado, regado a muita bebida alcoólica, o que faz com que os clientes fiquem engajados e de alto-astral o tempo todo."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfLUpqTFRREAE",
            "text": "Not good sushi. Not fresh. I’m skeptical about these other reviews."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmcWRHX053EAE",
            "text": "Great food and fun atmosphere.  The fishes are super fresh and some very creative appetizers.  The unlimited sake is awesome!  I drank a lot and I think it is diluted.  I only got a little buzzed.  But overall great fun and a very good deal."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmNHFQVDF3RRAB",
            "text": "You need to come here if you want a good time and good food!!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmd3RTdkh3EAE",
            "text": "Absolutely amazing experience! Every single course was made to perfection and delicious. You could taste the lengths the team at Sushi on Me go to ensure the fish is clean and fresh. Will absolutely be returning!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmcFBHMmxBRRAB",
            "text": "Wild time. Will be back with people that visit the city"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmanN5alZBEAE",
            "text": "Excellent, excellent, excellent.  Need I say more. ?"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmMXN5TUhnEAE",
            "text": "I have been here like half a dozen times and every time I always get excited to come back. However this time I felt like something was missing and lacking. They raised the price but everything was still the same. The service was still very good but for some reason I felt like it wasn’t as good and as fun as it used to be. The food didn’t taste as amazing, maybe because they were all the same as before so it didn’t surprise me anymore. I felt a bit rushed for each course, maybe because there were not many people at the dinner. Still, the hosts should have found the way to entertain the guests in order to keep up the reputation of the restaurant. Though I and my party were having good time among ourselves, I just thought that it would have been better if things were different. I also thought that they should change the menu more often to keep regular customers coming back and still be able to have fun."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2X2FESlRBEAE",
            "text": "Loved it!!!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQdlluTWN3EAE",
            "text": "Had to leave because the music was ridiculously loud.  But, if that's the vibe you're looking for, this is your place."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzNzdDekF3EAE",
            "text": "We had a 6:30 PM reservation on a Wednesday and we ended being the only people there. It was nice to have the whole restaurant to ourselves but there was no energy since we were the only ones there and the food came slightly too fast. With that said, the three guys were really friendly and did their best to keep us entertained.  I was even able to ask for a five minute smoke break and they let me choose some songs that I liked to be played over the speaker which was nice since I was pretty drunk at this point from the unlimited sake pours and wanted to hear “my music “.\nThe fish was fresh and all 15 courses had enough variation where you didn’t feel like you were having the same Nigiri over and over again. A couple of appetizer courses were extremely flavorful, but the problem with that is they overpowered the fish. When I think of Omakase, I think of subtle flavors, most of their flavors were the opposite of subtle which made for a very exciting meal. (the only thing that was missing was Uni of some sort in any of the courses)\nOverall, a really great meal with a bunch of really fun guys."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzaV83NDhnRRAB",
            "text": "Came here for my Fiancé's bday cause she's been wanting to check this place out since it was recommended to her. I don't care for sushi, and I literally ate everything. The food is delicious, the staff is great and the sake is always flowing. Definitely worth it for a date night, birthday, friends hangout etc. Just make sure to make reservations"
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuNE9hamd3RRAB",
            "text": "This place is definitely not your usual omakase. They have a mic for you to sing if you want. The whole omakase set is prepared for you one after the other with unlimited cold sake. They definitely put on a show for entertainment. Because the 2 chefs are from Thai, some of the sushi is Thai infused, which was delicious! The whole experience is about an hour. They only seat you at the bar where they prepare the sushi in front of you. These seats are about 15 max.\n\nThe only con was the dessert, which was mochi ice cream. The actual mochi was not chewy but grainy and broke down and left a bad taste on your tongue. Frozen raspberry was good tho. To end the whole experience with bad mochi was least expected lol but the people there are super nice and the sake boy is quite the singer and refills your sake every single time without fail screaming LETS GET WASTEDDD🤙 haha"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3bmEtd0NnEAE",
            "text": "My husband took me here for my birthday, and I took him here for his birthday. We love this place singing, dancing, omakase, excellent food unlimited sake. It’s cash only, intimate, and definitely not a place for kids. The staff is very attentive and very communicative about allergies and special events It’s a show. It’s a vibe. It’s an excellent time. I highly recommend\n!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5MTYtVWxRRRAB",
            "text": "It was a great show. I can’t imagine this as a great food but every thing is better with unlimited saki and amazing companies.\n\nMy wife and I had a great time. It wasn’t hard to find just under staircase and you felt transported out of New York.\n\nThe food is amazing. They put up a great show and quality is reasonable. I enjoy the food but you can really drunk with the saki.\n\nAmazing restaurant and definitely a visit if you are in town. Experience depends on the host."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3eUlQWkhBEAE",
            "text": "Wowowow! What an amazing experience! And it truly was an experience. A small group seated at the counter for a super intimate experience. All the staff were kind, personable, and really funny. The food was exceptional and the vibes were off the charts. I can't recommend Sushi On Me enough!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURubmRYenFRRRAB",
            "text": "This has been on the list to try for a while and I’m so glad I finally made it. It is so unlike any omakase place I’ve been. While so many tend to be quite subdued and all about the fish, this place is fun! Not that the quality of the fish suffers - all the courses were very solid, if not mind blowing. But the chefs are a riot, made sure everyone was having a great time, provided a great setlist to accompany the courses, and kept the sake flowing. In keeping with the atmosphere, it is a very celebratory place - there were a couple birthdays in our group. Just a really fun place for dinner and good value. I’d come back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURicHJiaXBRRRAB",
            "text": "came here to celebrate a friend’s birthday and reserved the entire restaurant. LOVED the ambience, the staff were so fun to hang out with! had the time of our lives, food was great, and even had a karaoke sesh! i’ve never been to such a hyped up omakase restaurant, def would consider this for my birthday! only wished we saw the menu first so we could look at what we were getting! they were super accommodating w allergies, helped us out with pictures, knew all the hit karaoke songs for our group. extremely friendly and fun staff!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwMElxWlRBEAE",
            "text": "This place is not your traditional omakase experience (but dare I say better!). The courses themselves were mostly delicious, especially the salmon, but the highlight is definitely the atmosphere and entertainment. The chefs create a genuinely fun experience for everyone there, and with great music to boot. All you can drink sake can be dangerous for those who can’t handle their drinks (like me) so enjoy responsibly 😂 Overall, 11/10 experience, and we’ll definitely be back!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGdHFpQ2Z3EAE",
            "text": "I celebrated my and my best friend's birthday there. The food was delicious. It was my first Omakase experience and it was so fun. The plates are small but after 15 courses (!) They get filling. They also provide unlimited Sake. The ambiance is so fun, music, jokes, the chefs' vibes are great. They make it very entertaining. I would definitely recommend."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1N1BmZTdBRRAB",
            "text": "LOVE!! Super fun experience. The sushi isn’t like the highest best premium quality but it’s delicious still and the experience truly is what makes it. The chefs are a lot of fun, there’s unlimited sake, and the bites are quite innovative and tasty.\n\nThe whole experience is about an hour and costs $89 before tax and tip. Everyone sits at the bar. Highly recommend."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNadUtLMFR3EAE",
            "text": "I've been here twice for two different occasions and both times have been a wonderful experience. The chefs are super kind and interactive with customers as it is extremely limited seating so make sure to plan far in advance if you want to dine here. The fish is very fresh and they have a lovely party vibe so if that's not your thing, make note of it for when you're in the mood for that. $89 for 1 hour of unlimited sake and 10 courses which honestly is one of the best deals you can get in NYC. Cash only and make sure to tip well if you visit! 12/10 would come again!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxcEpmMU1nEAE",
            "text": "Fun place. We had the last time slot on a sunday. Great food. The Thai influence on some of the pieces were amazing. Never ending sake and at the end of the service, the karaoke came out. Never had this much fun at a dinner before. Can't wait for a Houston location to pop up."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCX0s3RjJ3RRAB",
            "text": "What a wild ride! The food is delicious and the experience is a non-stop party 🎉. The music is LOUD but sets the tone for an atmosphere of full throttle enjoyment. The staff are really amazing, funny, attentive, and friendly. They're not kidding when they advertise \"unlimited sake\". I don't think my glass was ever empty for more than 30 seconds- you really set your own pace so if you want to get drunk you definitely will. This was as much of a show as it was a dining experience and I can't wait to go back!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKbHNlR3ZRRRAB",
            "text": "It was a little bit hard to find but knowing that you will need to go downstairs helps find the place. The atmosphere is that of a cozy speakeasy where you would relax for a little drink and maybe a snack or two. The entire dinner experience was fun and full of fish and sake. The chefs and host engage with you to keep the energy level up but not too much to draw attention away from the food. The food was amazing and simple where the only thing to do was lift it into your mouth. The pacing felt perfect and barely felt the time fly by. I see myself returning again in the future."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwX192RFV3EAE",
            "text": "Best omakase experience I have ever had!! Such a great value for the quality and quantity of food, PLUS unlimited sake. The chefs are very fun and interactive while incredibly talented. Every bite was delectable! I can’t wait to come back with friends"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMaUtqdnNRRRAB",
            "text": "really fun experience, set meal with a fixed price per person that includes unlimited sake. the staff is really high energy. every course was great."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN0a0k3UGtRRRAB",
            "text": "One of the better and more unique omakase i've had in a while. staff was friendly and fun, everyone there was a chill vibe, and the food was actually quite fantastic. good cuts of fish and very different from your traditional omakase. it does move fast so you're in and out in a little over an hour. the music was fun and vibey and the small bar (probably about 10-12 people total) all good vibes. the chefs make it fun for everyone and they keep filling up your sake everytime your glass is empty which is great! all in all a unique and super fun dining experience. the $99 cash only price for 15 courses isn't bad either - they also take zelle! it kind of feels like a best kept secret because you can still get reservations on open table... for now"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXbnBtSVdREAE",
            "text": "Incredible experience. This is the second time we went and it was just as good as I remember. The staff is so kind and friendly. They are also hilarious and extremely generous with the unlimited sake. The dishes and flavors are interesting and unique. I wouldn't call this traditional but it is definitely the best value omakase in NYC right now. Can't wait to go back again!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4LVktTFB3EAE",
            "text": "Absolutely AMAZING. I loved the impeccable attention to detail.  I dropped a few grains of rice (after too much sake), and they swooped in & cleaned it up immediately. The staff was hilarious and attentive.  The food and the presentation were both aesthetically & deliciously pleasing.\n\nIt was definitely an AMAZING night."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoaXVIMU1BEAE",
            "text": "Best omakase experience, our second time eating, and we can't wait to come back again for more. The food was great,  the service attentive and friendly and the atmosphere was chill and relaxed,  there's no need to dress up so dress comfortably.\n\nThe restaurant might take a few minutes looking for it as it doesn't have a sign but we'll worth the effort once you find it.  It is located in the basement under a Chinese restaurant.  Look for Snoop Dog and when you see him, then you have arrived at sushi on me."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxazlxZHB3RRAB",
            "text": "The food was amazing. Every new dish was very different from the previous ones, and just as equally delish. Guys making the food are fully energized, lifting the atmosphere of the place high up. Fully recommend! Bring cash, though!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4MGZpY1d3EAE",
            "text": "What a fantastic experience. Sake flowing, delicious omakase and fun and energetic vibes! It’s cash only which I didn’t know but you can also Zelle.\nMake sure you don’t have an early morning the next day and make sure you’re in a fun mood!\nThe Smokey salmon was my favourite!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHNUozS25nRRAB",
            "text": "such a fun meal with a great vibe. the sushi was v high quality and there were amazing & unexpected thai flavors. it was unlike any omakase I've been to in the city. the chefs and hosts were very personable and made the experience even better. it is a very small space, so make sure you get a reso... but the plus side is you will meet the other guests you are seated by. the unlimited sake was also another plus! i would highly recommend and would definitely return.\n\nupdate: i came back a few months after first coming here, and it’s still a must-go-to spot. we loved the new appetizers, especially the salmon with the rosemary bubble smoke. we did feel like the dinner was more rushed this time, but we get it… i would go to a later seating if you can!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQybmQyVzJRRRAB",
            "text": "One of the BEST experiences I’ve ever had! Such a fun find! The food here is top notch, the staff is truly entertaining and hospitable and the experience is unmatched! There’s a lot of surprises in store :) Such a fun time, amazing omasake and a you must see for yourself. Bring CASH and get your reservations ahead of time!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwcEtXLXBBRRAB",
            "text": "Came here with a group of friends and it was such a fun and unique experience! This is not a traditional Omakase where you wait for the chef to hand you each piece, this is an interactive dining experience.\n\nThe course is an hour long and they serve unlimited sake, the chefs are so fun- they joke, sing, and dance. They even hand feed you a piece of nigiri while playing a romantic song 🤣\n\nAt the end of the course we the girls left with full stomachs but the guys were still hungry 😂\n\nOh and make sure you bring enough cash as they are CASH only!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPNV9tdW13RRAB",
            "text": "I got too tipsy to take all of the pictures… if I could recommend this place for a fun and unique experience, I would make everyone I know come here! I would say the omakase has enough variety to make you full with the unlimited sake of course.\n\nWould recommend coming with a few friends that like to be loud and maybe some dancing along to the fun and energetic workers. We had such a good time on a random Tuesday! I definitely need to come back!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLczRxd3FBRRAB",
            "text": "Highly recommended！Today is my first try here and they have become one of my favorite non-Mechelin omakase restaurant. Foods are fresh and creative I just can't get enough of the baby squid. What makes me like here the most is the chef they…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCX2NpdHJBRRAB",
            "text": "Was lucky to snag a reservation on New Years, the morning of - since I’ve heard reservations need to be made far in advance! Sushi on Me is not your ordinary omakase place because Sake BOY serves you unlimited sake and he made sure our glass was always full! The menu consists of 15 courses for $89 before tax and tip. Note: they take CASH only!\n\nThe moment you walk in- you already know you will be having a great time! It had such an amazing speakeasy clubbing vibe. The staff were fun, amazing and interactive. They really know how to have a good time and made the whole experience so much better! Their playlist consisted of old school throwbacks and after a few rounds of sake- you are guaranteed to go into karaoke mode!\n\nThe CBD bubble and the use of a THC smoke machine for two of their appetizers was what stole the show! You can also taste the thai influence in some of their dishes, which made each piece super unique!\n\nThis place is definitely worth the hype! Come and be prepared to have an amazing and unique omakase experience!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUNtN1BWYhAB",
            "text": "They successfully combined Thai flavors and traditional omakase. I have to say, the appetizers were really awesome! Also, the staff made us feel welcomed and gave us an wonderful experience, not like the normal boring restaurants😂 Highly recommend!"
        }
    ],
    "reviews_count": 77
}