{
    "name": "Coatzingo",
    "place_id": "ChIJm4WwoalfwokRwQhSKkQybN4",
    "grid": "QN3",
    "address": "79-11 Roosevelt Ave, Jackson Heights, NY 11372, USA",
    "rating": 4,
    "user_ratings_total": 480,
    "phone_number": "(718) 424-7272",
    "reviews": [
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WT2FVOVlNbk0xZW1SYWVXSjJjbEZ0TFZCbVQwRRAB",
            "text": "Omg this place is so good"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kVU9YTkVUMFJIT1ZkSVExcGtNVlZQYTBGTkxXYxAB",
            "text": "Autentica comida mexicana deliciosa"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6bEliRE53EAE",
            "text": "I completely got confused with this place because there’s like 3 places in these 3 blocks close to each other. This place is not up my alley, nor is is it horrible. However, got shrimp tacos- shrimp tasted so bad, got guacamole on the side and it was all brown and old, their birria is okay. Honestly the Coatzingo on 76th st is 10 times better ! The staff was very nice here but unfortunately that’s not gonna cut it !"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJN096dllnEAE",
            "text": "Extent service"
        },
        {
            "date": "9달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfaTVhUG9RRRAB",
            "text": "La comida muy deliciosa, ambiente tranquilo y buen servicio, es limpio. La verdad recomendado 100% la sopa de res blanca la recomiendo."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlX3JXdGxRRRAB",
            "text": "Very good"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2cVBMdEJ3EAE",
            "text": "Great food and service, great and cheap cocktails, food portions are big, specially soups, Definitely coming back"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2bk1QTnZ3RRAB",
            "text": "I really liked it! The service was great and the food was delicious. I only gave it four stars because it was not very hot or warm when it came to us but the flavor was there."
        },
        {
            "date": "11달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzNDZmTUtnEAE",
            "text": "jamas regreso antes cocinaban mejor hoy los chilaquiles son un asco"
        },
        {
            "date": "11달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzek9QT0dBEAE",
            "text": "El día sábado fuimos a comer con mi familia y le pedimos a mi hijo de 4 años arroz y frijoles y desde ese día a las 9 de la noche mi hijo a estado super enfermo lo lleve al hospital y me dijeron que se intoxico por una comida que estaba dañana jamas volveremos a ir a ese lugar por que no sabemos en que estado esta la comida que nos están vendiendo. Tengan mucho cuidado a donde entran a comer"
        },
        {
            "date": "11달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzM19tMlNREAE",
            "text": "Nunca había comido ahí pero ayer le pedí a mi hijo una orden de arroz y frijoles y olía como atún ya estaba hechado a perder y le agarro una diarrea muy fea a mi y a mi hijo k es un bebé de 4 años no vuelvo ir ahí"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzOFl6RTNnRRAB",
            "text": "I ordered by mistake thinking it was the restaurant three blocks away but it was a good mistake we loved the chicken tortas, will make the same mistake again 😀"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYM0wyU1hREAE",
            "text": "Good"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYX2FhQ0dnEAE",
            "text": "Me encanta mucho"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIbW9qcHV3RRAB",
            "text": "Update:\n\nStar Upgrade from 1 Star to 3\n\nRevisited the location on two different occasions for my taco fix and there were significant improvements in the cleanliness standards both front and back station visual to the customer. The restaurant was clean, the fridge was fully stocked and properly merchandized, the cut vegetables accompaniments were fresh and very tasty.\n\nIn the visual BOH—the grill was very clean and organized. The chefs had a proper flow of production to execute orders and there was no chaos (it usually never is because these guys are the best).\n\nWhat I did not see were sanitation buckets (red and green) although they could on the wipe system where they're single use\n\n…and the improper use of a Red Board. In this place they could be on a Red (Raw Meat), Green (fruit and veg) , White (cooked foods and breads). One the Prep is complete there should be a white board on the line to prevent any cross contamination (or the perception thereof).\n\n…and for the love of People please install a time sensored air freshener in the restroom. When you walk past the restroom to the seats the smell of someone else’s business is very off putting.\n\nChef Duqueroix Letter Grade: B\n(Presence of food consumed on the service line)\n\nPatron: you should eat here with the following in mind:\n\nAmbiance: beautiful and cultural.\n\nThis is a traditional Mexican restaurant where the food is good but could have a few areas of improvement. This visit was taco week and while the tacos I received were tasty the shells were served greasy and the plate was not clean.\n\nServing a dirty plate is disrespectful because it gives the perception that the cook does not care about the quality of the product nor the presentation.\n\nWhy the one star? This is one of my favorite restaurants and in my university days I’ve eaten here to literally save my life. It’s one of the best Mexican Restaurants in Jackson Heights, 13 years ago, but it seems that the quality has declined over the years. Back in the day they paid attention to detail—the meals were served flawlessly.\n\nNow on a small scale commercial note I believe they should bottle their Red and Green Sauces because it’s the best any Mexican Restaurant has to offer, to be sold onsite of course, as Jackson Heights souvenirs.\n\nIf they get back to basic standards of presentation and taste—and bring back the previous charm—Please STOP eating food on open view of patrons (behind the line and on the FOH bar) it’s not a good look and it’s against the law. For this reason alone is why I rated one of my favorite Mexican restaurants a one star because norovirus is deadly and bare hand contact with ready to eat food is not cool."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURualk3MXFRRRAB",
            "text": "The truth is that the food leaves a lot to be desired, even though I ordered 2 tacos I couldn't finish them because of the bad taste. They put guacamole on top of the tacos and they never offer you the spicy sauce.  Definitely not a place I would return to.  the tortilla was already destroyed."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaektYZVl3EAE",
            "text": "Whenever I want to eat Mexican food this is my to-go spot, I have been a loyal customer since 2019, I think the ambiance is family friendly and I honestly love coming here for freshness, value & service. The restaurant has made improvements with space, organization and decor through out these past years.\nTheir shrimp tacos are to die for including all other tacos but shrimp are my favorite; so fresh so tasty so juicy. Their tortas are also really good, sopa de mariscos my personal favorite (very spicy) by the way but so authentic and it can feed two people; I usually order this soup for me and my husband and we each serve a big plate, fajitas, green mole chicken, chicken tostadas basically all of their food is always so delicious and not once I have been disappointed.\nThey also offer chips and homemade salsa which I absolutely love and If you feel like having a Mexican michelada go for it, all the waitresses & waiters are always friendly and work with great attitudes so I always feel welcomed, so my recommendation goes to anyone looking to eat authentic Mexican food with awesome taste, big portions and reasonable prices."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURibVBmcC13RRAB",
            "text": "Terrible experience at the bar.\nThe “bartender” was rude and unprofessional, working with earbuds and on call, all while taking orders. While I was asking about the options on the menu, she seemed very annoyed and bothered since I was “interrupting” her call."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyakxPV3NnRRAB",
            "text": "I ordered takeout and when I went to the lady at the register she was a rude bitter lady.The lady with black glasses with a white hair clip  WHO HAD HER EARPHONES ON expected to hear me. She was nasty, had a whole attitude and it  completely unprofessional. Unfortunately a nasty attitude tends to make an impact on the food."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6Z051aEZBEAE",
            "text": "Las flautas 😍"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUMlpUMkh3EAE",
            "text": "I love their atmosphere! Service is quick and easy to order! I ordered spicy pork with beans, rice and cheese and it was delicious! Really affordable too ! Highly recommend stopping by here! One of the best Mexican restaurants in Jackson Heights!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEc0p5SDRBRRAB",
            "text": "Buen ambiente y servicio con buena comida muy recomendado"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5Mm9uUThBRRAB",
            "text": "Muy buena comida mexicana"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROLXF6TXZBRRAB",
            "text": "The tamales are sooo good"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsNGZlN093EAE",
            "text": "Have to do your homework ppl"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGMC1PZmFnEAE",
            "text": "Excelente lugar. Servicio maravilloso."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1a3ZQRWV3EAE",
            "text": "The food and atmosphere is great here. I think it's a little bit pricey. $20 meals for Mexican is a lot"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1MEwybENREAE",
            "text": "Nice mexican food.!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtcWJhWEVBEAE",
            "text": "Lindo limpio"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKcUxEM0hnEAE",
            "text": "Muy buen servicio y excelente calidad de la comida.\nLos tacos un excelente sabor al estilo Méxicano, una experiencia comer ahí un cachito de México en NY"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKemFMOVpREAE",
            "text": "Yes by far my best Mexican restaurant in NY."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKNE1Ea2t3RRAB",
            "text": "En lo personal depende de loque ordenes  para mi esta miy bien el servicio esta pésimo con excepción  cuando te llevan la comida fría es porque no están atentos Ho mo son eficiente"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4dmJqa2JnEAE",
            "text": "mucha limpieza y una atención muy profesional 👏👏👏⚘❤#1…"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4d2Nxb0R3EAE",
            "text": "La comida muy rica.\nLos trabajadores son muy amables."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoaTdHZ093EAE",
            "text": "Had fantastic time at this restaurant, food was very delicious. Only thing missing at restaurant was free Wi-Fi."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURodnBYMUpnEAE",
            "text": "La comida es muy rica la mejor torta cubana que me he comido. Son mi primera opción cuando quiero comer comida mexicana.! 🙌🏽…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURob3Yzcm5BRRAB",
            "text": "I used to like this restaurant, but today I ordered a delivery and after checking the taco toppings (radishes, onions, limes) I realized that they were rotten and my main dish \"pork ribs in green salsa with verdolagas\" was extremely spicy! I am mexican and I am a  professional cook too,  I know when food it's not right so I called them and after explaining everything the lady/ waitress just told me \" the taco toppings are edibles and your food is not spicy at all, you are maybe spicy intolerant \" that answer is not what I was expecting at all, basically she called me crazy! She didn't apologize or accept that the food was wrong and for me  that answer is completely unprofessional.  I don't recommend this place at all,after all I ask her if she was going to do something about it or I will not order again and she was mean to me she said, \"do whatever you want.\" I am so disappointed,  I spent $66.00 plus tip on a dinner that wasn't edible at all. Please do yourself a favor and don't order from them."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURodU5yeThRRRAB",
            "text": "I am Mexican , so it’s hard to find a real good spot where it taste from back home & this spot right here hits just like the mother land . I ordered a Coctel de Camaron and it’s by far the best one I’ve had in Queens 🤞🏼🤞🏼 I’ve spent new years in this place and Christmas. Always my favorite spot to eat Mexican food 🫶🏼❤️🤍💚"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCdjlxU0ZBEAE",
            "text": "Authentic and delicious food."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCMWNucGR3EAE",
            "text": "Try their nachos tejanos with bistec and chorizo, thank me later.\nAlso the carnitas platter If you are not into nachos, thank me twice."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCc1ptNUpBEAE",
            "text": "This is by far the worst Mexican food I’d ever had!\nGot my order completely wrong & found hair on my food smh! Please avoid this spot!"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCN3ZySXNBRRAB",
            "text": "Excelente servicio al cliente"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2b0o3NTdBRRAB",
            "text": "Didn’t know entree food portion would be that huge. Couldn’t finish it so had to pack for home. As for the taste wise it was ok I would say. I asked for spicy & it actually turned out spicy. Taco was good, quite big. Always love the tamarind juice. Very Mexican setting & the waitress was nice & friendly."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2cTUzeXVnRRAB",
            "text": "The food it’s good, the only problem they have to keep the restroom clean & with paper to dry your hands"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtaGRhX3d3RRAB",
            "text": "I heard about this place, but was unprepared for how delicious the tacos were. I got Carne Asada (beef), Cecina (salty beef) and Camaron (shrimp). The meat was juicy and flavorful. Great service as well"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHNGREUVRREAE",
            "text": "Authentic and delicious Mexican food. You can’t go wrong with anything ordered here. Service is friendly and place is clean. Will definitely be coming back more often. Order the pozole or the barbacoa."
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtaVk2R0VnEAE",
            "text": "Trato amable muy buen ambiente y precios razonables"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxZ1l1X1NREAE",
            "text": "The food was good for the price. The beef in the tacos was just a little dry for me but overall the taste was good. We also got the  enchiladas with the rice and beans. The portion was big and the price was reasonable. They have a vast menu…"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtNjR2VHpRRRAB",
            "text": "No soy de dar reviews , pero la comida está pésima. Gastamos casi $70.00 dólares , pedimos tostadas de camarón, una mojarra, y unas salchipapas , las papas todas negras , todo terrible. Lo único bueno fue el servicio, muy amable la muchacha . Necesitan mejorar su comida. Trabajen en el sabor y presentación."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPcEpmdXVRRRAB",
            "text": "Love the tacos only reason y I go there."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLeTQ3MU9BEAE",
            "text": "The service was good and fast\nNice enviroment!\nWaitress were very nice."
        },
        {
            "date": "6년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZcnFxWUZBEAE",
            "text": "excelente comida mexicana, yo que no soy mexicano puedes pedir con o sin picante, buenas raciones."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPajgtVzdBRRAB",
            "text": "The Guacamole was the worst I have tried ever, i couldn’t believe that, I ordered 2 tacos de chorizo and i couldn’t eat them too. 🤦🏻‍♂️\nThe enchiladas were great tbh and the service was not bad at all.i didn’t like…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXeUlmNHFnRRAB",
            "text": "We ordered several tacos. The carne asada was a bit tough and gristly. The carnitas was good although we only got 1 that we ordered of 2. Service was slow. Nachos were minimal - a couple of chips covered in cheese and a little guac in the center. There are other places in the area that are better."
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPOXI3U0JREAE",
            "text": "La verdad me decepcione hoy de los tacos al pastor y los tacos de tripa, antes estaban mas deliciosos, no se que paso despues de que volvieron de la renovacion del local. Y pensaba llevar a toda la familia desde el bronx, espero y mejoren pronto. Ire otro dia para ver si ya mejoraron."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtZ1liUlR3EAE",
            "text": "This is one of my absolute favorite Authentic Mexican restaurants in not just Queens, but NYC! Everything is amazing, and the staff is really nice. The prices are also very affordable!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVdDhQOVZnEAE",
            "text": "Gets two stars only because the waiters were nice. Unfortunately our food was flavorless the salsas for the tacos was not good had no spiciness and only tasted like tomatillos."
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURleHJLTEtBEAE",
            "text": "Por que la comida no tiene el suficiente picante como debe de ser? Aparte no creo que sea nada saludable comer en la parte de atras con ese moho del techo.…"
        },
        {
            "date": "5년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzdUtDM3VBRRAB",
            "text": "Un lugar malísimo. Pésima atención las meseras son unas ignorantes inexpertas que no saben ni lo que está en el menú,  además  te  cobran muy caro y los utensilios con los que te sirven sin de plástico  ,  la comida es más o menos  pero no vale pena pagar por algo así.  Muy malo ..."
        },
        {
            "date": "7년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBa2ZhdzJRRRAB",
            "text": "Es un buen lugar para ir a comer en familia\nHay buena comida y otras no tanto,las meseras muy amables y casi siempre están atendas y aunque a veces ponen música muy alta y creo que tienen que tener…"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRZzVQU2tBRRAB",
            "text": "The food is exellent. Eat there many times. Love their Tostadas de Chicken. I never try their delivery service and don't know until what time they deliver. Muy buena la comida y creo que los deliveries son hasta sierta hora. No creo que los deliveries son 24hrs."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCd29pN25nRRAB",
            "text": "Pedí 4 tacos y todos me los sirvieron fríos los de cesina eran bistec no cecina el de alpastor era carne enchilada y luego solo me dieron una tortilla y cuando les dije el error se molestaron la salsa toda cruda fea no lo recomiendo"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzdjRTLWRREAE",
            "text": "Amazing food. We went to try the salted beef cemina and got what I think was an al pastor enchilada platter or something like that. Everything was amazing, big portions, extremely filling, and great service. The al pastor was my favorite part."
        },
        {
            "date": "9년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRaHZiemZBEAE",
            "text": "El Sabado 19 de Marzo fui a comer con mi familia a este restaurante. Fue una muy mala experiecia por que nos dieron tacos de cabeza la cual ya no servia. Casi me dan ganas de bomitar! La mesera nos dijo que no podia cambiar los tacos ni…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVd3ZDNUpnEAE",
            "text": "The fresh pineapple water has no flavor and the huarache meat has not even salt or pepper not to mention the dishes are same or more expensive than Manhattan, i will look for other place because the AC was like a fan, very hot inside for that prices, no way."
        },
        {
            "date": "수정일: 4년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5c2JHVnNBRRAB",
            "text": "The food was excellent./ la comida era deliciosa.\nThe men's room was filthy. There was no toilet paper./ El bano de Hombres estaba sucio. No habia papel higienco.  10/30/2021 @ 8:00 pm"
        },
        {
            "date": "수정일: 7년 전",
            "language": "es",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRMnAtRFZnEAE",
            "text": "Yo fui a comer aqui una sola ves y yano volvi  la comida muy rica de eso no hay duda pero El servicio que  me dio una mesera la verdad deja mucho que pedir La morra  ami casi en todo me ignoro solo atendía amable ami amigo   yo le pedía algo y solo desia ok ahorita  te lo traigo  y no fuera él pendejo de mi amigo xk de una le llevaba loque pedia y yo le desia y lo mio y la mensa desia disculpa ya voy x El la verdad se paso. Desde que llegamos la trate de buena manera   pero  en fin nose porque  hacen eso  deberían atender alas personas x igual y esa morra solo atendía bien alos morros xk no solo en mi mesa Se mostro hamable   asta con la mesa de alado 🤔🤔😒😒😒😒 El dueño deveria de llamarle la atención asu personal que sea asi talves lo aran xk les dejan mas propina site portas como esa chaba en fin pésimo servicio 👎🏻👎🏻👎🏻 y agradescan que le di 3 estrellas"
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyc3RmeUhnEAE",
            "text": "Un lugar muy agradable para venir en familia o con amigos , los especiales simepre muy ricos y porciones muy buenos , las bebidas muy buenas y las meseras muy amagles y atentas , es lo que cada persona busca para pasar un buen rato y comer bien. Lo recomiendo al 100% .\n\nTipica comida mexicana 100%"
        },
        {
            "date": "수정일: 7년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRMHZHQWJnEAE",
            "text": "Un lindo lugar para comer un pozole rojo!!!"
        },
        {
            "date": "7년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURna3FXN2NBEAE",
            "text": "Restaurant familiar,comida mexicana me encanta todo lo que vaya con lo mexicano,talvez exagero pero practicamente la comida mexicana es una de los ricos sazónes que he probado,nada como unas enchiladas verdes o talvez algo mas común,los…"
        },
        {
            "date": "7년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBcDdTdmR3EAE",
            "text": "Yo soy de mexico y la verdad la comida de aquí me da asta pena.  siendo mexicano no la recomiendo a de mas que es muy caro no quiero ni entrar en detalles sobre los platillos por que la verdad me da flojera describirlos pero es mejor comer tacos de la calle que de aquí"
        }
    ],
    "reviews_count": 71
}