{
    "name": "El Chivito D'Oro",
    "place_id": "ChIJmzOMQ69fwokR-0ktXlXcNrs",
    "grid": "QN3",
    "address": "84-02 37th Ave, Jackson Heights, NY 11372, USA",
    "rating": 4.4,
    "user_ratings_total": 2122,
    "phone_number": "(718) 424-0600",
    "reviews": [
        {
            "date": "수정일: 18시간 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxNWJHWlhREAE",
            "text": "Muy buena carne me encanta este Restaurante"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaWVZVVTRNVlExVGxOVWQxRTVja0p2ZDNJMFNtYxAB",
            "text": "staff forgot to leave water at table and cup was dirty.  ordered mozz sticks and they were low quality frozen sticks.  the meat was underseasoned and pricey!  used to come here when i was younger and i loved it!"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SUU1tUlpWREZITW01R1JsZzRiM2REUlhsaU5HYxAB",
            "text": "Great soups!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21JeFkyODVjbVp6VEdOR1J6VlJWMEowY0MweVNrRRAB",
            "text": "I did not physically eat here but had leftovers from my parents and wow the food was delicious ! 10/10"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkb01WZzVhVjkxVkdjek1sOUlWVGN4T0VRdGNFRRAB",
            "text": "Great neighborhood staple.....been around for year.....and there's a reason .....consistency."
        },
        {
            "date": "4주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Sc1VVTlBYMWRqV204MlNIRjJNelpMTW5WR2RYYxAB",
            "text": "Les recomiendo ami me encanta y es mi lugar para degustar una rika parillada"
        },
        {
            "date": "4주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaSlZFazFSVlpwY1VOU05tTnBkV1ptZFMxRGJtYxAB",
            "text": "Claudia nos dio una recomendación excelente, la entraña es deliciosa y acompañada de yuca frita es la combinación perfecta"
        },
        {
            "date": "4주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkYWNqVnJTVVZVZDJkV1V6UTNZbEpxUkdKZk1rRRAB",
            "text": "super delicioso se come, cuando vuelva a estados unidos con mucho gusto repetiré 🙏🙏🙏❤️❤️❤️"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaT1gzSldTV2xsYVRaclIyWmlSbk15V0hsM1JFRRAB",
            "text": "La peor parrilla da que me he comido pensé que era solo era cosa de la mesera que no sabe brindar un buen servicio pero el parrillero entro también en esa, uno come ahí por las cosas típicas de Uruguay como la carne en un punto no bien hecho, el Pepe ron chino, el picante al estilo uruguayo. No me colocan el Pepe ron chino la carne parece una suela de lo hecha… que decepción no sé si esto está así hoy porque no está el mananger o q honda"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201TVdsUm5kbWQ2TVRWUmNGVjZXVEpFTkY4NWVFRRAB",
            "text": "Delicioso todo"
        },
        {
            "date": "수정일: 1달 전",
            "language": "es",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSUVRFRTNRakJMYTA5SFQzRTRTRTlKZFZORVpXYxAB",
            "text": "Comida deliciosa en Jackson Heights"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRNjY2VS1nRRAB",
            "text": "Best steakhouse in NYC bar none. No Frills but some of the best food you will ever have."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pnelZIVTRXVGsxYVZaaVRGUndTM0JMZVhVNGJFRRAB",
            "text": "Exelente comida"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0NFdXOXBaVTFTWVRWNlJEVmxiV1YxZFhOV1QzYxAB",
            "text": "Great place to visit in family.."
        },
        {
            "date": "2달 전",
            "language": "pt",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSR1dHUlVlbTUyWDFaUFFWcEhZbXREWWpCWVRXYxAB",
            "text": "Excelente"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5bFNFRnVMVTB3Wm5adVUweHFObGhxZWpaU05YYxAB",
            "text": "Best place in Queens, not only for asados, everything on the menu is delicious."
        },
        {
            "date": "수정일: 2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJMnBmVjNnRRAB",
            "text": "Los mejores Canelones de todo New York 😋Comí Canelones de espinaca con tuco que delicia de tuco y de canelones.Para empezar es un tuco bien a lo Uruguayo hecho con carne que se nota de muy buena calidad que que esta cocinado a la perfección .La carne super blandita.Lo segundo es que la mayoría de los restaurantes Uruguayos hacen unos canelos de espinaca donde la espinaca no la sazonan para nada y te das cuenta que es espinaca frizada sin gusto a nada y aquí están super rico el relleno de espinaca cocinado con cebolla y sazonado delicioso super fresco. Te lo sirven con su queso parmesano rallado y pancito francés calentito. Los jueves siempre está la misma mesera o moza que es simpática,  servicial y atenta .Un clima genial armonioso para comer en paz con linda música"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGNlZXdE5jVjlaZVc1TU4ySlBlWE5MVFMxVVRuYxAB",
            "text": "Venimos por primavera vez nos encantó la parrillada excelente servicio, no se demoran   La señora mesera que nos atendió muy atenta  volveríamos a venir recomendado 100 /"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDaFp5MmdRRRAB",
            "text": "5 stars !!!!!! Yummmm"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6MHJqYjR3RRAB",
            "text": "Always a favorite, I grew up in this neighborhood, is a great place!! And 33 years later I take my family and friends."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25vMWJ6TmlTMWN0TUZRd1NWWklYMnBaVVhsSE5HYxAB",
            "text": "Muy rico todo y muy buenos precios !"
        },
        {
            "date": "수정일: 3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25seVV6UnpjMHBCVlhobGFGVkJSVTl1UmtKbE5tYxAB",
            "text": "Se come mucho y muy bueno. Repetible 1000 veces y más"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aa2MzTndkbTFsV2pST00xWjNhVWxDZEROWFlYYxAB",
            "text": "Way to expensive for what you get here ! There meat was tough chewy and some things liked the chorizo tasted off ! Only good thing was empanada and dessert . Much better places with much better food in the Queens area to spend your money on . Never again !"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkck1sbFZRelJqVVRCSFJtd3dVRGxsYVhacmNYYxAB",
            "text": "Es una auténtica parrilla Uruguaya. Te sirven con gusto, la comida es inmejorable, las porciones muy grandes, los precios justos. Lo mejor es que no te apuran, ni para pedir ni para pagar, lo que no es nada habitual en nueva York."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWR1NuZG1hR016ZG5SMFJrMVFjMDh5TW1oTWNYYxAB",
            "text": "This place was great years ago and it’s sad to see how far it’s fallen but even then the food is still pretty good but sometimes it’s a bit lacking."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xZeWVuaDRUWEJNUjNWUWRVcFZhRFp1TmtWdVRWRRAB",
            "text": "Ive always passed by and decided to finally come in to the restaurant. Right off the bat you notice the meat on the refrigerated display that looks fresh and honest to the indecisive consumer. The place is a little cramped but nothing intolerable to your average new yorker. The portions were big and the atmosphere is beautiful, but the quality of the food was not there. The meat was not seasoned and some cuts were questionable. We might have gotten unlucky considering the overwhelmingly positive reviews. That aside the waitress seemed irritated with my party despite displaying phenomenal attention to everyone else."
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twMmEwZHlTemxMVWtsRloySjZaekJxZW1oUWJYYxAB",
            "text": "💯 recomendable"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21reVpHRldOMXB2VTIxdk5HeFJVUzAyTW5jeU1VRRAB",
            "text": "Have been coming here since a child and it’s just as good as I remember."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kTU0wZGFkR0ZaWldGbE0zcHVja3QwWjFjM2JsRRAB",
            "text": "Good family restaurant. Good food at decent prices"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Sc1VGVm9OSEptWTBSdWRrTnNNSEZOYjBaaFpGRRAB",
            "text": "Entraña was pretty good, very chill soto to eat at. Great music too!"
        },
        {
            "date": "수정일: 4달 전",
            "language": "es",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURial91YWdnRRAB",
            "text": "Entre al Chivito de Oro a celebrar mi cumpleaños , wow no esperaba un ambiente tan divertido, la parrillada estaba deliciosa, el precio muy económico, la música excelente, variada, romántica, bailable, tango, salsa, que artista tan profesional, bailamos mucho, definitivamente regresaré otra vez.La música es los Miércoles después de las 7:00 pm.\nEs un lugar que está detenido en el tiempo, necesita  mejor ambiente, pintura nueva, decoración."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wc1gzZHlSbWxxTVRGNVRXd3lSRXhwYzI5dE5IYxAB",
            "text": "OUTSTANDING place to eat uruguayan barbecue. As a uruguayan myself, I get emotional every time I go there, it reminds me of home a lot. It's by far the best place in NYC to eat some high quality barbecue, and the staff is great!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkd2RVcG9ZblI0VkZWM2R6QlFWV05sYjI0MFQyYxAB",
            "text": "Best meat in the city!"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJU0ppdW1UX3NxMWRBEAE",
            "text": "Muy rico y excellente ambiente."
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNU1F2NWJZdWRqVlF3EAE",
            "text": "El lugar es excelente, el servicio, la comida, el ambiente, todo. La comida es deliciosa y el lugar muy acogedor . La atención 10/10. Los cortes de carnes son de buena calidad , suaves, jugosos y con sabor . Sin duda alguna volvería y lo recomendaría. Si estás cerca y deseas comer una deliciosa parrilla de carne , este es el lugar.\nDe postre pedimos el tiramisú, muy delicioso.\n\nLa cantidades de las comidas son muy generosas para el precio ."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJZngySnlrci1XVld3EAE",
            "text": "Food still good but service has declined. Lately."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQbkFtdC02aHFLbVFnEAE",
            "text": "We had an amazing experience, staff was welcoming to our family to celebrate Mother’s Day!!!! Our server was so nice and polite!!! We really appreciate to make us feel comfortable!! My parents were so satisfied with the food and customer service!!! Muchas Gracias el servicio al cliente muy bueno nos hicieron pasar un día de las madres muy agradable!!!"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJeTdrNXFaaDRyNWdBRRAB",
            "text": "Le mienten a la gente con la milanesa a la napolitana...la misma lleva morrones (pimientos), huevo duro, palmitos y hasta le pueden poner hongos, ....nada de eso ...un trozo d carne (grande , para ser honesto).....con 1 feta d Jamon, 1 d…"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPT0NqcWJieS0zZjB3RRAB",
            "text": "If you like the Southern Cone (Argentina, Uruguay, Chile, and Paraguay) and want to experience some of it here in NYC, this is the restaurant for you!\n\nMy friends and I ordered a meat platter for 2 (steak, pork, and chicken) and the food was phenomenal! It was on top of a mini grill, which had a small fire underneath, so you won’t have to worry about your food ever going cold. The steak is thick and juicy when chewed on so that is definitely a plus. Both the pork and chicken tasted great as well.\n\nThe atmosphere felt like a fusion of Europe and Latin America, making newcomers feel like it is such a unique Latin American restaurant and differentiating itself from what people might consider to be the typical Latin American restaurant.\n\nIf you’d like to experience the cuisine and atmosphere of one of the most unique regions of Latin America, this is your go to."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvdmJ5ZjRBRRAB",
            "text": "I had the pollo a la parrilla. The chicken melts in your mouth. So delicious. I loved it."
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvc2JtZXdRRRAB",
            "text": "Excelente"
        },
        {
            "date": "6달 전",
            "language": "zh",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvNHV6aXdnRRAB",
            "text": "味道不错，分量很足，服务很好。"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvN09xbVBnEAE",
            "text": "Great lunch."
        },
        {
            "date": "5년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzMEp1NDBnRRAB",
            "text": "멕시칸과 미국, 한국의 분위기가 혼재. 좋았음."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJek4zUkhREAE",
            "text": "Nice size restaurant.  Very welcoming environment.  The service is wonderful.  Mom and I got the Parillada for two.  It is a variety of meats served on a small grill.  We also had a choice of two sides.  We got Potato Salad and Tostones.  It was so much food that we bought more than half home.  They give complimentary Bread and Butter when you come in and Chimichurri and Salsa.  They have many other offerings. The prices are reasonable for the quality and amount of food.  It's a good place for groups, families and even solo dining.  I highly recommend this restaurant."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJNWRuSWZnEAE",
            "text": "Pleasantly surprised with this restaurant....Very low key and old school feeling place...Almost like a diner feel... Service was on point.... Very impressed with their selection of meats. Started with half a sangria..(for her cause i dont drink)..Had the Bife de chorizo..Shared the bife and had leftovers cause it was so big....... AMAZINGLY BIG AND DELICIOUS!!! Potato salad also delicious..The chimichurri was so good id put it on everything!! EVERYTHING!!!!!! Thank you to Carla my server. Nos vemos pronto!! P.s. I ordered empanadas to go.. Also 100% delicious!!💪🇺🇾"
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNma2FhVHpRRRAB",
            "text": "The food is amazing but I consider the costumer service to be a little slow which can be understandable since it was at full capacity at the time. Server was nice and attentive."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoemJ6TmV3EAE",
            "text": "Nice spot to try if you are craving steak different ways. The chivito is a sandwich. We had the steak version which was delicious. We also had the steak with sauteed onions. Great for this that love onions - they were cooked to perfection! Portion size is big so you can definitely share.\n\nThe staff is very friendly and attentive."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0dFBYZ1BBEAE",
            "text": "This place is amazing if you crave meat. It's my 4th time in 7 years that I've came to this restaurant while visiting NYC. My favorite is the Parrillada for 2, but it really serves 4, it's alot of meat. The service is amazing, they've always treated my family and I with the most warmest welcomings. Any questions we had about the food or service was answered. I definitely would recommend coming here with an appropriate. Thank you for the good and service, it's already 5 stars!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCdnZxa3JRRRAB",
            "text": "I am not writing this review to tell you what to do with your hard-earned money. I am going to share my thoughts and you make your own decision if you would like to try this place or not.I have been going to this place for many years now and it’s always good. Usually, I get the parrillada for two. It comes with some flank steak, beef sweetbreads, sausage/chorizo, beef ribs, bread, and two side orders which can include green plantain, sweet plantain, garden salad, fried cassava, delicious garlic fires with parsley, and others. The staff is friendly, and the place is always clean. If you go to this restaurant on a Friday, Saturday, or Sunday be prepared to wait. If possible, try to go before dinner time or after 9:45 PM, and most likely you will not have to wait.  The restaurant does not have a parking lot but there is a lot two blocks away and it’s only about $5.00 p/hour. Do not forget to ask for the chimichurri and tomato sauce. They are both amazing and will significantly enhance the flavor of your food and even bread. look at the picture for the tomato sauce."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2c1lmaHhRRRAB",
            "text": "I would strongly recommend this place. Very authentic Uruguayan, I over ordered and was not disappointed. The meat was cooked to perfection, the watercress salad was very good. I also ordered the beef empanadas and they are a must try. I will absolutely be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMcVBTWkN3EAE",
            "text": "Sooo good for the price and portion. We got the caesar salad, shrimp in garlic sauce and meats for 2. This fed 5 of us and we got a to go box!!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNjNUxXMzlBRRAB",
            "text": "Solid restaurant for meat. I've been here several times and even though my favorite cut of meat is ribeye (medium rare), I have to admit that the best item on the menu I've had here is the skirt steak. Big portion, very tender and super juicy. Price is more than reasonable ($28 and it comes with a side dish, I usually get the house salad). I even got a glass of house wine for $6 and it was actually pretty good. Service is fast and courteous. Recommended."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtLUlyVmtBRRAB",
            "text": "The food was great and the staff very really nice. She even offered us a sample before we order one special food that had like liver or some other intestines in it. Which I am grateful for the kind offer as she was right it wasn't something we would enjoy!!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZX0kzVG1nRRAB",
            "text": "Great place for South American grilled meats. This place is Uruguayan style. I had the Short Rib and Skirt Steak. Very good, yummy. The fried plantains were huge and good too. Their juice with milk was good. The free bread was also good, looks like they placed it on the same grill. Rice and Beans were good too. I will be back."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURndE9tVF9RRRAB",
            "text": "Delicious!! Got a piece of sirloin medium rare and it was the juiciest, fattest piece of meat I've had in years! The grill cook likes to show off his skills every time I peep through their windows so I finally popped in to try.. I'm so glad I did!!\n\nGenerous milk shakes and $4.50 sangrias.\nTons of seating but they do fill up for dinner.\n\nWill be back!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEdV9qU2FnEAE",
            "text": "Soy ecuatoriana y fue mi primera ves en un restaurante Uruguayo , pero me encantó, el servicio de la mesera fue excelente, nos explicó el menú y que era lo que podíamos pedir. Parrillada para dos, fue nuestro plato pero creería que fácilmente comían 4 personas porque es bastante carne, y las alitas buffalos que estaban deliciosas. Remendado 100% el servicio es rápido y tiene un buen ambiente."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURodXFtVTBnRRAB",
            "text": "Food is good, but it is a lot of meat so it is a little too much for me. Papaya shake is pretty good. I also like their complimentary bread with chimichurri sauce. Portion is huge, price is a little expensive, but then again it's all meat so it makes sense."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREOGJDalVnEAE",
            "text": "El Chivito de Oro in queens NYC offers an amazing experience to uruguyan culture.  Exceptional entraña and pasta Alfredo, boasting the perfect combination of quality and affordability. The warm ambiance and welcoming staff add to the dining experience, making it a restaurant worth returning to. Highly recommended for anyone seeking delicious food at reasonable prices in the city.\n\nHonestly best entraña and Alfredo Pasta in town!"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNobFA3bndRRRAB",
            "text": "Gran servicio, muy atentos todos! Un ugar muy agradable para comer, el local muy limpio. En cuanto a la comida todo estuvo muy bueno tanto la carne como las pastas y los postres buenísimos 🙌🏻"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWdi1PLURnEAE",
            "text": "We were a group of five who came hungry. We asked them how much we should order and the server said we should get two of the meat platters for two (which seems sensible for the group size). But when we asked if it would be too much they assured us it wouldn’t be - but when it arrived it was plainly too much! The food was excellent, for sure, but we could only get through 50% of it. It’s very heavy. So that’s a word of warning to anyone who is interested in portion size.\n\nThe sweet breads were by far the best item, followed by the sausage.\n\nThe servers were very nice and gave us extra chimichurri on the house :-)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREdzd6SFhBEAE",
            "text": "Staff was friendly & food was delicious. Carne, Mollejas y Chorizo Parrillada Para 2. This is also my go-to spot for Chicken Empanadas."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3X1AtLVd3EAE",
            "text": "The food is delicious and their personal is so friendly and helpful.  I understand now why there was a line of people waiting when we got there. It was my first time eating there my friend who is from Uruguay invited me and I'm so grateful…"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKMmRycFBnEAE",
            "text": "Great food friendly staff excellent service no matter how busy the place is"
        },
        {
            "date": "수정일: 1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNla3RqZWNREAE",
            "text": "Es el mejor Bife de Chorizo en Jackson Heights.\nLa atención es excelente.\nComo siempre la mesera de nombre Sisi, es fantástica  dando el mejor  servicio a los clientes.\nComida deliciosa, abundante a muy buenos  precios.  Indudablemente allí se come la mejor Parrilla Argentina  de  todo Queens."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWaEoyaU1nEAE",
            "text": "I have been coming to this restaurant for many years and it still has the best parrillada in the area. excellent service!!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURna0l2Q2RBEAE",
            "text": "If you want good steak this is the place to go. The staff are friendly, the food is excellent and they have the best chimichurri sauce in NYC. It tastes like home cooked food (with a lot of love) in a restaurant setting.  Don't forget to order a pitcher of sangria.\n\nWe love the ceviche,  skirt steak,  ribeye, fish, the parillas, it's definitely a steak lover's place."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlcUl2SlpREAE",
            "text": "If you’re a meat eater, this is the best place to go 🇺🇾! Really like the beard there🥖 with the sauces and gravy. Can try different types of marinated meat, sausages with a great family proportion!\nCassava fries was yummy too, just too heavy to eat them all~ staff there were sweet to introduce the menu with us, few mins work from station, and we definitely need to have a walk after this meal. *full*"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsLWFfMjVnRRAB",
            "text": "Great food. Large portions. Staff is super nice. Great for larger groups."
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3aXJEb25nRRAB",
            "text": "Una experiencia maravillosa. Recomiendo las tarta  3 leches."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNINS12ZFRBEAE",
            "text": "Es como si nunca me hubiera ido del paisito, el servicio y la gente de 10, el ambiente espectacular y la comida para pedir uno de cada uno en el menu. Las empana estuvieron buenisimas, al igual que la provoleta y el asado cocinado a la perfeccion. Muchisimas gracias por la hospitalidad gente! Vamo arriba Uruguay!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHeTVlcWV3EAE",
            "text": "We ate many times there, is a comfortable place, great service and the meat there is always great flavor and juicy!\nIn my picture “sandwich de entraña” delicious and is big!\nIs a bit expensive than usual but it worth…\n\nThe churrasco is great!\n\nNOW THE COST OF SANDWICH DE ENTRAÑA IS 20$!\nWith those prices you should be in Manhattan not in Queens.\nI will never come back again.\nThanks for everything."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNcGFxUDhBRRAB",
            "text": "Very good skirt steak. Meat was perfectly medium rare and really juicy. All in all three stars so far. Bread was super fresh but they took a while to bring it."
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXemFXQi1nRRAB",
            "text": "Como Uruguaya orgullosa tengo que decir que la comida de ella hace que se te haga agua la boca. Desde sus pastas, a su clásica parrillada y hasta el ambiente de uruguayos de verdad, es un gusto ir siempre!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBMjV5cVFBEAE",
            "text": "Really good place for Argentinian steak but every time I come back I see the prices rising. Its a bit disappointing but the food quality is still good.  I just hope there quality stays the same or gets better while prices keep increasing.\nParrillada para dos was good and perfectly cooked. The potatoes were awesome as well.\n\nTip: don't use the butter for the bread. Use the chimichurri insted."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzb2QtdnR3RRAB",
            "text": "This is one of my favorite restaurants. My boyfriend and I come so often we get treated like family. Everyone is so nice and the food is always great! Some days the steak will be better than others but it never fails to satisfy us. Been coming here for a long time and will continue."
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRcGV2UGhRRRAB",
            "text": "Deberían despedir a la vieja trata mal a la gente te viene prácticamente a gritar a  la mesa que dejes propina en frente de todos la señora con lentes que atiende obliga todo el tiempo a dejar propina"
        }
    ],
    "reviews_count": 77
}