{
    "name": "Popeyes Louisiana Kitchen",
    "place_id": "ChIJof3A855fwokRLdTvlej5j3Y",
    "grid": "QN3",
    "address": "83-10 Astoria Blvd, East Elmhurst, NY 11370, USA",
    "rating": 4,
    "user_ratings_total": 1217,
    "phone_number": "(718) 205-6024",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Wd1kwRmhaRFJ4UW5WQmVrUndkMGRHT0hOMk9FRRAB",
            "text": "Mobile delivery is slow, food was cold by the time i got it"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paQmNUUjRVa2xvV2s0NFpFVkRRMTgyTW5nM2VuYxAB",
            "text": "Really good chicken from that specific place."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOa1IwaGZibTFqTFRkVFZVMWllVXR4TjNaT05uYxAB",
            "text": "Coming all the way from New Jersey to LaGuardia airport to pick up my daughter. Stop by for Popeyes at the pit stop a hair before 11pm and purchase Fried chicken 3pc for $6.00 as her night snacks.\nA young kind lady Nishat whom work there, offer additional pieces just light my night. Thank you"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25velRuZGpNbE5GVFRocWNEWjJiRkJrV2t4Wk9XYxAB",
            "text": "Got food poisoning from eating the wings and fries.\nThey need to do better."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201S01taEZUM2RpTms1VFJWWm5ZVTFDUTJvemEzYxAB",
            "text": "No restrooms and a homeless person sitting inside. I won't be stopping by here."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VMS1pzSmlrOUwtdHBnRRAB",
            "text": "DO NOT ORDER FOOD FROM THE APP FOR PICKUP FROM THIS BRANCH. THE FOOD IS NEVER READY. YOU WILL HAVE TO WAIT EVERYTIME\n\nThe older lady that works here really hates her job. My online order for pickup is never ready, its not even started. she always wants to verify my order number and name to make sure im the correct person picking up even though shes been seeing me there for about a year now. surprised she doesnt ask for ID. only then she'll start my order if shes not busy with other customers. incredibly slow service. there are times ive waited up to 15mins for an order that should have been ready for pickup"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0ME5Hc3RNVlkwWmpCSldITTRZekl0WDJGM1NVRRAB",
            "text": "Had a great experience at Popeyes! Nishat at the counter was absolutely amazing!she was incredibly sweet, patient, and welcoming. Even though it was a bit busy, she handled everything calmly and with a smile the entire time. Thank you for the warm and friendly vibe!the food was served fast and came out hot and fresh!Definitely coming back. 😊🍗"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4cVdrOWtMV0l5YVdReVRESkRRalJFY1hCNmQxRRAB",
            "text": "Had a great meal at Popeyes! The food was hot and tasty, but the best part was the service. Priyanka served me with a smile and was super friendly. Made my day better — thank you, Priyanka! 🙌🍗"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Cd2FHMHpXRE5PYkZOVlQwZFpZVnBuTjJFMWMxRRAB",
            "text": "Cold, dried out chicken for chicken wrap"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tocVoxVjZlRzQ1YjE4d2JHUkZOWGRvYVRaM1VGRRAB",
            "text": "Everything is good except whenever I place my order 8 out of 10 times I miss something from my order I don’t know what kind of service is that whether it is pick up or delivery"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMaTN3LTNYcG9qTGlBRRAB",
            "text": "I want to send thanks to Tarannum & Meem for always getting me in & out of there after placing my order . They always have a smile & are always friendly . Thanks 👍🏽"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKN29uTlN3ODVlb3VRRRAB",
            "text": "Tarannum was great customer Service"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJZnJ0b3F3MWREZ1R3EAE",
            "text": "Service and food never good anytime of day."
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvNHBILU53EAE",
            "text": "Muy mala atención...no dan servilletas, ni salsa ni hay baño"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvOFBiZWt3RRAB",
            "text": "I work around the corner from this place So I came here a few times. food was not all the way cooked Probably and I feel like they need to change the oil cause I can taste the old oil taste in the chicken The Staff are really nice Tho. They just need to improve on there food. 2 many people are not happy with the food Here."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJanFmVDB3RRAB",
            "text": "Go there for the food and come out feeling good and satiated. Popeye's as usual."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJc3NHVTJnRRAB",
            "text": "They don’t have manners how to serve and refuse to use restrooms to coustmer even they mention restrooms for coustmer only!!\nworst experience ever!!"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvelpyZkZ3EAE",
            "text": "There's always a huge line with only one person working. I've been going there for over five years. Popeyes do something"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3bEw3SXZnRRAB",
            "text": "If I could give 0 stars I would the chicken was raw and I am incredibly angry."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3OEpYTVNnEAE",
            "text": "Too expensive small fries 4$every thing  else worse"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLX0xHOWl3RRAB",
            "text": "I went when they opened up fresh food & kind staff."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRb2ZfTTNBRRAB",
            "text": "I work around the corner and have tried a couple times to order from this location online so I can run on my break and pick up my food.....its never ready when I get there, multiple times I go and tell them the order number and they proceed to grab a long chain of receipts from their online order register and start to do the order.\nAnd this is after standing there for 5-10 minutes on top of the 15 minutes from time of order and watching them fill all the orders from the people who are ordering in store...awful service, im done going to this location for now"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxeHF2aHJ3RRAB",
            "text": "The food is old. Fried chicken needs to be fresh. It cannot sit for too long or it dries out. The last few times I went, the chicken sat too long and was dry. In this part of Queens, this is an issue with many fried chicken places. You have to catch when a fresh batch of chicken is made or else. The macaroni and cheese was dry. I wasted a trip and money for my lunch. This location is not cheap either. I will have to go twice the distance to the Popeyes in the hood for fresher chicken, so be it"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfbk9PQVJnEAE",
            "text": "The chicken sandwich is worth it! Get it makes, and put chic fil a sauce on it! Popeyes has the best chicken sandwich!"
        },
        {
            "date": "9달 전",
            "language": "pl",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmeDdQWmFnEAE",
            "text": "Pyszne, świeże jedzonko, bardzo miła obsługa !"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmaWNuQlRnEAE",
            "text": "i went there yesterday at around 8 for some regular chicken. The staff was really efficient and eager to help which was very welcoming. i will definitely go there again. Thank you popeyes ❤️"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmcHYtOVlnEAE",
            "text": "I had a very disappointing experience here today. My friend and I went around 10 PM to grab some wings for takeout. We asked for the regular wings, but the lady at the counter name maisha  ended up packing ghost pepper wings by mistake. To make matters worse, she made us wait while she was talking over the phone and seemed completely uninterested in\nhelping us. The whole experience was frustrating, and the service was very rude. We won't be coming back."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzN3VMSWNnEAE",
            "text": "Great speed and service 👍"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzMEwtanV3RRAB",
            "text": "Very once in a while, I stop in for my lunch break. The staff is always so sweet. The store is always very clean. It's really nice that they have a parking lot up front. It's nice to have a place like this in such a secluded neighborhood."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzZ0xLSDZBRRAB",
            "text": "Staff is always pleasant."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuNTlxRURREAE",
            "text": "Best service, nice behavior. Food quality is so good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIcnZMZDl3RRAB",
            "text": "I went around 10 pm and they close at 10:30 I asked for wings and they said they didn’t have any. They were too lazy to fry another batch and told me to go. Some guy ordered the last 24 pc wings and they didn’t bother telling me in advance that that guy took them all. Very shitty service and lazy workers."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURILU5mNDN3RRAB",
            "text": "Their service and food quality and the environment is very good condition"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3eHRfR0dnEAE",
            "text": "We used to go here all the time but they lowered the quality of the chicken the food tastes not at all as it used to. The last 2 times we went was the same. Not planning to go again"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiLTVUVV9nRRAB",
            "text": "Buena"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiX1liY0ZnEAE",
            "text": "El chico no quiso aceptarme monedas, solo billetes. Les entregaron la comida a muchos antes que a nosotros y eso que comimos en el lugar. El lugar tenía un ambiente raro. No me gustó"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiaHRmTE9REAE",
            "text": "The food was good, but the service was not."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURia0l6NGFnEAE",
            "text": "At 10:15pm I order 5 piece spicy chicken meal for pick up. I asked the lady few times is it spicy chicken she said yes. I came home and opened the bag I found all of them are regular chicken.  If you don’t have spicy chicken then tell people you don’t have any or your kitchen is close. Speak the truth why would you lie?"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyallPekhnEAE",
            "text": "Me encantan sus fries"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwdDRLbkhnEAE",
            "text": "Service was good and safe, and clean.   The chicken was good but the cold sole was nasty. It had no taste whatsoever."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMeGZIX3JRRRAB",
            "text": "Order 1/2 ahead cause they would get busy with 2 costumers and you have to wait for the fries. Smh"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUcm83YVp3EAE",
            "text": "I just stopped at this Popeyes and there is only one person in the front and one person cooking.  Not good!!! But, they are both doing awesome job."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnX19uODNRRRAB",
            "text": "Good taste!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqb3RiQmVBEAE",
            "text": "They turned off the fryer 45 mins before the closing time and refused to serve my order. Bad service and the manager himself is super rude and encourages his employees to be rude as well"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSbmJPOVBREAE",
            "text": "Been here before a few times. Always friendly and helpful. Today the food was way off. I mean WAY OFF! Ordered two Chicken Classic sandwiches and got I don’t know what!   The chicken was soft and rubbery. They were very dark in color and there was NO CRUNCH. I ordered them with extra pickles and had to wait so I figured they were going to be fresh. Not left over from the day before.  I had to eat something else and put them in the freezer for an exchange.  I WILL take them back and update this review. It’s the first single star review I’ve ever posted.  I had to wait a few days before posting this review as not to use the wrong words.  I am thoroughly disappointed!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURzNFlMV0xnEAE",
            "text": "This place is very clean. Walking in, you'll notice there's no set line. People just kind of line up and it swings the way it needs to, which causes traffic at the entrance/exit. I'd recommend they invest in a partition to alleviate any stress for people trying to leave or come in. The bathroom's very clean as well. It seems the hospitality does a great job at cleaning the area on the hour, which isn't the case for most places. Parking is a bit of a drag, but I guess they make due being on Astoria Blvd.  The servers were excellent at taking orders and ensuuring the customer received everything they asked for ... the first time. It shows they care about making customers happy as they greeted each one with a smile and wish them well after they oaid. Take a stop at this location and see for yourself!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXNHFHTzlRRRAB",
            "text": "the store is very good. I went at 1:00pm & there was a long line & it lasted less than 10mins. the girl who attended me was very kind and friendly she gave me everything I asked for. I asked her if they had strawberry jam she said no but anyway she check. I told her that if didn't have it it's okay. Let me get honey mustard or barbecue sauce, and she got all of them. I highly recommend the store."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURvcjlDci1RRRAB",
            "text": "Looking for some fast fried chicken 🐔 and some buttery biscuits with scrumptious sides? This is there place.  This location offers free parking and fast, friendly service on a very clean facility. The food is always good and the prices are reasonable. Hands down, this is a much better choice than Kentucky Fried Chicken for sure.…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ4bjVPZWxBRRAB",
            "text": "The 3 stars is not for the food but for the service. After having to wait for a long time in line I got to the counter and the guy there tells me that he did not receive my order. I showed him the confirmation email and he said \"I understand but if I don't get the ticket I can't give you the order\" Finally I asked so what should I do? And he had the nerve of telling he doesn't know. If he doesn't know, who knows?\nAfter all, the order was already there but he didn't see it. He didn't even apologize.\n\nAlso, I dont know if it is just today but there is a long line outside."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNDODRQcDJBRRAB",
            "text": "Very bad customer service  because you have to wait a lot just for a small order. I don't recommend it. Too much wait. For fast food and you wait 40 min? Even in a restaurant,  it doesn't take  too long."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4MDZ1dHBBRRAB",
            "text": "I’ve never usually had problems here but recently in the last months the food has been horrid as well as the service. I placed an order as well did my friend so we went into the Mobile order side to tell the employee that we each had a Mobile order, we stood there for ten minutes waiting for Someone to assist us. And it wasn’t until we tried getting the workers attention 5 times did he come up to us and asked us what we needed. The restaurant was relatively empty so it wasn’t like they had many orders or a super long line. The cook and another employee were having a screaming match in the back and it was pretty awkward. The cashier asks us what we needed and we explain we have a mobile order, we wait another 10 minutes just for him to come back and say that they ran out of fries. At this point we were over it so we just say it’s fine because we just want to get out there. We ask him if we could get extra chicken or extra biscuits in place of the fries and he agrees. My friend and I ordered one tender meal as well as a 12 piece family tender meal for the rest the friends we had waiting at her house. As well as not having any fries they had 0 sauce and the employee that was assisting us was giving us the worst attitude, my friend and I were pretty understanding of the situation so we didn’t really put up a fight but I felt the attitude we were getting was uncalled for. After taking our food and getting back to the house we take the food out and realize it wasn’t even chicken tenders. It was half cooked fried chicken. It’s was very gross. Only thing that was good were the biscuits, so we just ended up having Chinese takeout and biscuits."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURneUtTa3B3RRAB",
            "text": "Good chicken, good service, overall great place! Not too expensive"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNncWQtX053EAE",
            "text": "There’s a tiny parking lot out in front shared a few other stores, During my visit it was almost completely empty and the floor was being mopped with what seemed like dirty water as it smelled pretty bad but none of the employees seemed to…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKMzZhaEVBEAE",
            "text": "Positives are the food is good and the place is clean. However, slowest service in fast food I've ever experienced. Theres not even a drive through so I'm confused how they're so backed up. Also, the restroom is out of order?. Can't even…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREbTRfblhnEAE",
            "text": "The crispy chicken and fish sandwiches are delicious.  When I'm feeling like having a dessert, I'll get the apple pie 🥧.  That also is good, especially if it makes it home with vanilla ice cream 🍦"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4LTc3MHBBRRAB",
            "text": "Got order wrong, wouldn't fix it wanted to charge me for a new order, didn't give my$ back trough out the mistake. 2  cashiers.  long line miserable service, unfriendly,  it wasn't for me, but I was embarrassed to go in there for anyone. Over priced food tht will  clog ur arteries n kill u. I said plse don't make me call on u, I didn't want to, it wasn't my $,  I Haye fast food places. I will never go in there again"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHNjlXV3VRRRAB",
            "text": "I placed an order from 83-10 Astoria Blvd location and this is how I received my order…… this isn’t the first time, a fellow coworker had the same issue."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwcWFmV0hBEAE",
            "text": "I always find it a bit odd to review fast food places, like McDonald's, Burger King, or, in this case, Popeyes. Is there anybody out there who hasn't actually been to these places? It's a bit more \"this is what I think…\" than an actual review.\n\nGenerally, Popeyes is one of my favorite fast food places. I like the spices in their chicken breading, and I like many of their sides.  However, on this night, while not bad, things were not great. The chicken was actually fine. However, my side (the Cajun rice) was not really hot, and the biscuits tasted like they had been sitting around for quite a while. Given that it was fairly late at night, they probably had been sitting around for quite a while. Further, and this is unfortunately a problem at many Popeyes, the place was a mess. Many fast food places pride themselves on being \"cleaner than your kitchen (Though I suppose that depends on how clean your kitchen is), but that certainly wasn't true of this place. The best way to describe it would be \"scruffy.\""
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBc1BTQUFnEAE",
            "text": "I went like two days ago, and that line was dumb long bruh. But it came my turn to order, a large ass order of like 16 pieces of chicken, they had it ready in like a minute. So the wait in line was worth the quick service of getting the food to me. Also, every piece of chicken was soft and could pulled off the bone easily. Great job."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwMGJHb1V3EAE",
            "text": "Yes, the chicken sandwich are Good. It’s definitely worth the wait. However this location working system is pretty slow compare to other Popeyes. Some Popeyes will have your food ready within minutes. This Popeyes will sometime take up to…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4N3VIb0l3EAE",
            "text": "Not sure if its the supervisor/manager named Farzana who was berating employees. She was humiliating them during rush hour while they were trying their best to keep up with the orders. Although the food is good I will not be coming here anymore. Cant support a business that doesnt respect their employees."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4NS1DeTVBRRAB",
            "text": "The workers here are a mess. Everything seems so unorganized, they are constantly running out of food and everyone has an attitude. The food took such a long time, I understand it gets busy but an establishment shouldn’t be so shortly staffed. They are always out of sauces and soda, there always seems to be an issue here"
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnNk5HaVZnEAE",
            "text": "Cashier was great, took our order efficiently. Gave us kind notice that we would have to wait on the breast meat for our family meal. All the food seemed fresh, and served with a short wait that ensured that we were served and out the door in a timely manner."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM4b3FQY1hREAE",
            "text": "Great food, terrible management. I had the food delivered through a 3rd party courier, door dash, and it came on time. Food was still warm even though it was a little far off. We ordered the ultimate family feast and was missing a large side. Considering how far it was, we didn’t want to ask for a delivery guy to just deliver a side. I called to ask if we could have a partial credit for a side and they told me no. They asked me to come in and pick it up myself. Now what is the point of ordering delivery if I was available to pick it up? I told them I’m unable to pick it up and they told me “ well too bad. If you want the side, come with the receipt”. Even though I asked for the manager, he was too busy and told the worker on the phone to “make them come pick it up”. Waste of time."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZamRIRkdnEAE",
            "text": "This place is so disorganized.  They dont have mac n cheese, no lemonade, no strawberry buscuits,  asked for no mayo 3x and they still put it. Then i had to wait 10 min for a new one. My family was done eating and i still did not have my sandwich!! Never coming here again. Gives Popeyes a bad name!!!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJeGNpX1R3EAE",
            "text": "I came in during a trek out to Cititield. I was cold but the food was warm. They were quick to help and prompt with service. It looked remote. There wasn't an overcrowding and the line was well managed. The place was clean."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNncTVxQWVBEAE",
            "text": "The chicken is always good never greasy you can eat more than two pieces and not get nauseous like some of the other chicken places. the sides are all good and the biscuits are excellent service was very quick and friendly all in all another excellent visit to Popeye's. Thanks for being there."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQycE5EV25nRRAB",
            "text": "There is always a long line just to order and usually only one person working the counter. But honestly, the most frustrating is that you know you are running low on fries and each time it takes more than 5 mins to make. So why not ask in…"
        }
    ],
    "reviews_count": 68
}