{
    "name": "Plaka",
    "place_id": "ChIJCan7lKFfwokR01MXHdeWrSQ",
    "grid": "QN3",
    "address": "75-61 31st Ave, East Elmhurst, NY 11370, USA",
    "rating": 4.5,
    "user_ratings_total": 283,
    "phone_number": "(718) 505-0515",
    "reviews": [
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1amFrUlBNazFQWTB4Q1lrSk1URGRIUkhKaFoxRRAB",
            "text": "We love the staff, the food, everything! Delicious Greek food, 10/10. The staff is always so friendly and kind to us and to our toddler. It always feels like we’re dining at our friends house. Highly recommend this place!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWdkxWSmlOVFIzWTNKcWNtSm1VR2RvWkc1U1gxRRAB",
            "text": "Delicious food and excellent service. Can't wait to go back, but I live far. I look forward to going to Queens to eat here."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWME1rMVphVFZLVDNwV2FsUlVYME5GTmtFeloyYxAB",
            "text": "Plaka embodies what I love about New York. More often than not, you can drop in on a random neighborhood restaurant and have a meal that will knock your socks off. And, at a reasonable price, too.\n\nWaiting for a family member to arrive at LGA, I decided to eat dinner at a restaurant in a strip center near the airport. I chose Plaka and had the grilled chicken platter with grilled vegetables. It was great and can't be beat at $23."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKN2psY3ZKaTl5NVN3EAE",
            "text": "very good service , food , wine"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKRHN1SUROOWJ5aHlBRRAB",
            "text": "Wow, this place amazed me. The service was great, the atmosphere was sound, and the food was spectacular, in both presentation and taste."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZcHFiQnlnRRAB",
            "text": "Service was fast and friendly, food was delicious and you can tell it’s a family owned business ? Correct me if I’m wrong hehe\nBut it was great and I would definitely be back again"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJOF9IakFnEAE",
            "text": "First time dining from brooklyn, delicious, fresh and fast. Service was excellent."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJeVBYNnNRRRAB",
            "text": "This restaurant is a staple for my family and I in queens. The staff treat you like family & the food is always made with quality and care. It’s a convenient location and there is always parking too. The restaurant is modest & traditional. I would highly recommend."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJalBtRVBREAE",
            "text": "Very nice everything! Bread wow, my favorite 😋. Smol bowl, but put food a lot 🫶👏😋"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnbWE3cGpRRRAB",
            "text": "We've been here many, many times (most recently Valentine's Day) and it's always a wonderful experience. The food, the atmosphere, the people (family owned and run and they make you feel like family) - everything is A+++++++++."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfeHNTYjF3RRAB",
            "text": "I have been going there for long  time ,I just don't find a reason not to go\nFood is good service good owners very down to earth peoples"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmOTdDaHVRRRAB",
            "text": "authentic greek food\n\nwell recommended."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmcGV5ZzlRRRAB",
            "text": "A must go customer service amazing, food amazing."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYX3QyNXR3RRAB",
            "text": "Delicious food and great service"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIMDRuT2dRRRAB",
            "text": "Beautiful atmosphere, authentic Greek cuisine, food is amazing!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3dTl5VGtnRRAB",
            "text": "Great family owned restaurant. Truly Greek!  Some of the dishes taste just like my yiayia made them. Delicious.  We are returning customers."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUemJidXJRRRAB",
            "text": "I was totally astonished with the delicious food. It was a great family service given to our group of friends. I recommend it highly to everyone!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyMGR5MXdBRRAB",
            "text": "Plaka is my local Greek restaurant where I've frequented the past 18 years. Their food is authentic and home style. Very tasty. Love the eggplant spread and the grilled chicken with lemon potatoes. Perfection! The gyro meat is great too!"
        },
        {
            "date": "1년 전",
            "language": "pl",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREaUlEcFJREAE",
            "text": "Suuuuper!!! Jedzenie! Obsługa! Klimat! Wszystko ekstra. Naprawdę można w PLAKA zjeść zmacznie i klimatycznie. Polecam!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEeVpTWk5BEAE",
            "text": "Delish food. Fun family restaurant. Friendly staff"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkM3NqUDl3RRAB",
            "text": "Simply delicious and good service"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOX002dVhREAE",
            "text": "Plaka is a lovely, old-school Greek spot. The food is great, and the owners are a delight."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsX3VhdnV3RRAB",
            "text": "Delicious authentic Greek food at reasonable prices. Branzino and grilled veggies were awesome. Great location with parking!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGdkx6aENnEAE",
            "text": "Simply the best Greek food you can find in Queens! Homemade flavor, generous quantities, wonderful service and owner, and always always always delicious!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1cUwzYjhBRRAB",
            "text": "Very delicious food. We were really lucky that our accommodation was nearby, and we could come almost daily to eat there. Everything has an authentic greek taste. That greek salad, french fries and chicken grill was perfectionnn. We also tried gyros and chicken sandwiches, which were also great. Definitely recommend the place."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURadDltU0FREAE",
            "text": "I’ve been to the restaurant, and ordered delivery multiple times. The food and the sauces are superb."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaM3VXdFVREAE",
            "text": "First time here w a recommendation from my brother. Very tasty\nWe had chicken w lemon potatoe eggplants greek fries greek fries and falafel to die for And too it off a lemon cake\nGreat customer service and we got to meet the awesome Ms Ana"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwMGQtYjRnRRAB",
            "text": "Best place for Gryos 🌯…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwejREVTd3RRAB",
            "text": "So good!!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwbWFlOEZBEAE",
            "text": "This restaurant is few blocks away from and it was my first time to dine in there. They don’t have special and not much dish selection. We ordered some drinks and they don’t have. They only have dry wine and Rossi.\nWe ordered appetizers octopus and calamari to share. The octopus was so tender and not bad and the calamari was hard and little smells. My main course was fish too bland and not bad. Some of my folks ordered chicken and pork chopped and they enjoyed.\nOne thing I love the most was the pita bread they serve before ordering or meals. It was hot and it was very good.\nAnd it was nice they gave us lemon cake as desserts and were good."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwaWRMMzFBRRAB",
            "text": "Food was good not great but the service was very good."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwNE9UbzdBRRAB",
            "text": "Me gustó su producto, muy buena atención...regresaré!!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPOTVIdkhREAE",
            "text": "Nice place, ok service."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKeW9qcXJBRRAB",
            "text": "Great food and fair prices , a true gem in East elmhurst."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKbllpYXFBRRAB",
            "text": "Dine in experience 5/5  friendly service and excellent food"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKN08tdWxnRRAB",
            "text": "Restaurante con ambiente  y atención agradable"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKeUl1X2R3EAE",
            "text": "Here is my report card  for Plaka. We came here with 6 adults and 4 children.. My daughter called them to reserve a space for us all. As soon as we got there we  were seated in a comfortable area.\nREPORT CARD\nEnvironment :Clean , spacious , comfortable , lovely.. A+++++\nAtmosphere:: Inviting ,friendly and relaxing  A+++++\nMeals  : Totally delicious, and very plentiful   Took some food home. A+++++\nService A++++=: Great !  Everyone was extremely helpful,  friendly  and efficient\nThe entire staff , that we were in contact with , is marvelous   A+++++\nWe had the pleasure of meeting one of the  owners of this restaurant .   As soon as we met her , we  realized why  this place  is so wonderful. She was very, very  friendly and generous ..\nHer husband was really busy so we didn't get to meet him .\nWe can't wait to come back here again."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4cHA2OGJnEAE",
            "text": "awesome gyro…my go to spot!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4aXR1T2RREAE",
            "text": "The food was great and the waiter was nice. The food took a little long and they had run out of bifteki but suggested a great tasting chicken breast instead. Considering the Mothers Day rush, we had a great experience."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4cElla0V3EAE",
            "text": "Very delicious taste and really enjoy breakfast"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSME5iRVV3EAE",
            "text": "This is my favorite cafe for breakfast. I go every Sunday but always crowded. The cafe is small but I like the girl Emily working there. She is excellent and very sweet, helpful, friendly, and has good memories. She knows my order. I don't have to tell her. Sometimes, it's extremely busy, and she is the only girl working and one chef, but she still can manage it. Emily, you go, girl 👏 👧\nOops 😬  This is Mila Cafe in Manhattan, not Plaka  🫢"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSeklQM2h3RRAB",
            "text": "Excellent restaurant. Service and food was great."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSdW9uVndRRRAB",
            "text": "Desde comida mediterránea hasta italiana muy recomendado"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURodjhYYTdBRRAB",
            "text": "food was ok, my friend is a slow eater, about 30 mins after being served waiter came over to ask if we were done!? mind you there was maybe 3 other customers eating! Will not go back"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoalptVmhnRRAB",
            "text": "Best Greek food in Jackson Heights by miles"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoM0pDVWlBRRAB",
            "text": "Omgness this place is such a hidden gem!!!\nIt’s quaint, nicely decorated and spacious; I definitely felt like I was in someone’s grandmothers Mediterranean kitchen.\n\nThe food comes out hot & fresh made with organic ingredients. I’m sooo in love with this place.\n\nWhen In Queens GO HERE!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoNFlhZEdBEAE",
            "text": "We ordered the gyro platter and pork souvlaki  platter to go. The pork was juicy and perfectly grilled. Our kids devoured the gyro with no leftovers.  The lady who helped us order was professional and kind. Must try if you are ever in the area."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCeVpuS3V3RRAB",
            "text": "The food was great and very satisfying portions."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCc29QWFlREAE",
            "text": "We enjoyed the food. We got a Gyro platter, a Chicken Souvlaki wrap, and a hamburger with fries. They were all prepared well. The ingredients were fresh. The service was adequate.\n\nI grew up in Europe. Greek and Mediterranean food have been among my favorites cuisines. This was among the best Greek food I have had recently.\n\nWe will definitely come back to try other entrees. Another big plus is that there is ample free parking, which is quite rare in Queens.\n\nOh, I almost forgot to mention that we had a serving of Baklava as dessert. I don't know if they make this themselves but this was great as well!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCaGZmd0JBEAE",
            "text": "Never been but I hear Italy is nice 👍…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlbHNIZklnEAE",
            "text": "Delicious Greek cuisine ! Everything we ordered was cooked to perfection. Family owned restaurant. You feel as if you are eating at home. Excellent service. Owner Anna is very welcoming and treats everyone like family. Awesome experience will continue coming here with the family! Many dishes if you are vegan too."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHdzRxT1pBEAE",
            "text": "By farrrr the best Greek food ever,, delicious food, fair prices , nice portions,  and the waitress was soooo nice, so professional, very friendly,,, the bathrooms nice and clean,,this place is very nice, even better then some Astoria restaurants, from now ,my best Greek spot"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLMzU2NXN3RRAB",
            "text": "Great flavor, very fast service, and reasonable portions. We enjoyed seating outside in the shade. The eggplant dip and the octopus were delicious."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhLXZPcXZ3RRAB",
            "text": "Awesome! I came to this spot for an early dinner, I really loved my falafel platter (let’s just say you definitely get what you pay for). Also happy that I finally satisfied my craving for lemon potatoes.\n\nService was great. Bathroom is accessible. There’s free parking."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlcmE2UG1nRRAB",
            "text": "Best Greek food in Queens! Get the gyro platter when you go!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtdnNyaFFREAE",
            "text": "ordered through grubhub, had no expectations about the food, but man I found a gem of an eating joint! The falafel wrap was delicious and filled with fresh veggies and the onion rings where unlike any other I've had. Cant wait to go dine in and order more from this joint."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZX1lmZGhnRRAB",
            "text": "Food has been good in the past, but today, 5/19 @ 6 pm  I walked in with my family, the restaurant was empty other than two or three other customers. Sitting by the front was a young lady and young man, the young lady gets up and nicely…"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBMXBpby1nRRAB",
            "text": "We just had my father's makaria (the Greek custom of a meal after a funeral) at Plaka and we could not have been more pleased.  Anna (the owner) was very attentive every step of the way.  The quality of the food and the service were excellent.  Definitely recommend this place for either a casual meal out or a bigger affair."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNva3RxNnZRRRAB",
            "text": "Plaka is a family owned and operated casual Greek Restaurant. The food is always fresh , yummy and has that home taste you crave.It is served with a smile and it is a great value. If you are lucky to get Anna´s walnut cake for desert, do…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyeDVlU0xnEAE",
            "text": "Great food & amazing service, a must try if you're in the area. Great family owned resto with great prices and menu selection. 5 stars all the way!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPOGRuZWxnRRAB",
            "text": "Mmmm!  Definitely order the grilled Octopus!  Perfect.  It’s so good because they get it from Spain!  Perfectly cooked!\n\nThen I got the Gyro platter with grilled vegetables, sauce, and greek salad.  It’s so much food, especially when they bring out pita with balsamic, olive oil and herbs to start!  Have lunch for tomorrow!  Could not finish it all.  The best was Sylvie though, she’s a gem!  Sent me home with sponge cake that her Aunt makes!  A wonderful cozy family restaurant with the freshest food!  You won’t go wrong! Enjoy!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2LTc3TXdnRRAB",
            "text": "Plaka has decent food, but it has seen better days.  Much of the food is too salty.  There is an employee (family member of a family-owned and operated place?) that smokes outside a lot, making it hard to enjoy outdoor dining.  He also grabs glassware by the rims with his bare hands, which is not sanitary."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURvd1BTbnhBRRAB",
            "text": "Occasionally I pick up takeout lunch at this Greek restaurant. Today was a falafel sandwich.  I was served very  quickly  and must say the sandwich and accompanying salad was very enjoyable.   The owner was there and greeted us warmly.  The…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRemZDZThRRRAB",
            "text": "The greatest authentic Greek food in all of NYC!  The owner Anna & staff make everyone feel at home and are attentive to everyone's wants and needs.\nI implore you to look no further than Plaka for  fine dining."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPOGM3eWZ3EAE",
            "text": "My new favorite place. The chicken platter was delicious.The waitress was very friendly and attentive. I’m definitely bringing my family here."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQybWZXQl93RRAB",
            "text": "Excellent place! I love the Greek salad!!!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ4aF9yLUNREAE",
            "text": "First time customer. Had the fried calamari as the appetizer which was absolutely delicious. Also had the gyro souvlaki on a pita. Delicious. Friendly service and clean tables. Will return."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1bmVpWU5nEAE",
            "text": "I had food here a few times, the food is Great my husband always had Greek lasagna. Now I am in Pennsylvania. When I go to NY I would definitely go eat there."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMycXB2M2x3RRAB",
            "text": "Good fresh Greek food. Wonderful family owned restaurant. Very good prices. Located in shopping center so plenty of parking available. Great take out too."
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtdnN2dExREAE",
            "text": "The best Restaurant in Queens!!..Es uno de los mejores Restaurantes Griegos de N.Y. localizado en el Antiguo Centro Comercial de Jackson Hgts. Tienen parqueadero gratis..y a mas de que su esquisita comida es muy Variada..pues tienen. Muy.…"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLLWZuVTd3RRAB",
            "text": "I love this place and not just because I am Greek, lol.  I NEVER order Moussaka or Pastitsio when I go out because no one EVER does it any justice.  Let me tell you, my husband(Who is Italian, what does he know? haha) ordered the Moussaka 2 days ago and WOW--it tasted like my mom made it!  It was PERFECT! BRAVO, Plaka and thank you!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURncGZpREJBEAE",
            "text": "Walked in around lunch time and placed an order. Was very disappointed to see the chef helping himself to some of my food. He was literally stuffing his face. So disappointed and btw they still had the audacity to charge me $16.50 for my order. Will not return here again."
        }
    ],
    "reviews_count": 72
}