{
    "name": "Café Salamanca",
    "place_id": "ChIJr0V1RKdfwokRH0EcwkHOHMo",
    "grid": "QN3",
    "address": "79-05 Northern Blvd, Jackson Heights, NY 11372, USA",
    "rating": 4.5,
    "user_ratings_total": 526,
    "phone_number": "(718) 458-2446",
    "reviews": [
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRellXcXNnRRAB",
            "text": "Excellent food and service. They have a variety of dishes and deserts,  as well as beverages.  The service is great"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oT1QyNWlSbUV4WkdZMloxcFlOVU5MVW05YU4wRRAB",
            "text": "Paella marenera was delicious"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21VeFRVSllhVGxYWms1dWIxbFRSakpZTTNkcVoyYxAB",
            "text": "The paella was absolutely delicious. The octopus as well I have by four another day because they are generous portions. I never eat dessert but this time I made room for it. Service was excellent, and the food was just very authentic.."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214NVMxaGlkbVZ1WkRKdE1sVXpRMDlITVdwcFpHYxAB",
            "text": "Family oriented restaurant serving typical spainiard dishes. Very friendly staff. Owner always comes around your table to show his appreciation and talk to you."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoWFUyRnBUVGRFWkhwcVZURm1VMFJhVDJGclZIYxAB",
            "text": "Of. course Spanish language                            muy buen servicio Regresamos pronto"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKQ1VqQkZNelIyTFZCUGFWOHRiR0Z1ZUZOd09GRRAB",
            "text": "Las tapas son deliciosas, las sangrías rojas y blancas uff muy buenas, la atención es espectacular, desde que llegas David y Julio te hacen sentir como en casa. Lo recomiendo 100%."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGeU1WZHJPRzV0VEhKbFVsaEhNSFZPTlhGUGNHYxAB",
            "text": "Todo en Cafe Salamanca es delicioso y excelente calodad. atencion lo mejor del sector."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWalVGRXpUM3B3V1V0Tlh6aFlTWGRRVjBsU1YwRRAB",
            "text": "The vegetable paella was delicious and a very big portion, enough for two people, or one person with take home leftovers. The Santiago cake was really delicious."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoUFdWOHhNRTV2VG5OQk4zUkpUbFV4WDNGcWJGRRAB",
            "text": "Visité Café Salamanca recientemente y, lamentablemente, mi experiencia fue negativa. Los precios del restaurante son bastante elevados para la calidad de la comida que ofrecen. Pedí pulpo, esperando un plato fresco y bien preparado, pero me sirvieron PULPO DE LATA, lo cual fue una gran decepción. La falta de frescura en los ingredientes se notaba en cada bocado. Haste el favor de evitar este restaurante."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwMVgyaGpXRXBmT1dOM2EyTnZhbGhqYzFKdlpYYxAB",
            "text": "I was impressed with their professionalism and customer service in a family atmosphere.\nThe paella, pulpo a la gallega and camarones al ajillo were delicious with  sangria and for dessert tarta de Santiago with a cafe Salamanca to end this amazing experience."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaVFZsVk1URU5LU2pONFVFcG1TRU5sWkdOM2RXYxAB",
            "text": "Horrible horrible experience, a tourist trap that we unfortunately fell for! Ridiculous pricing and below mid experience. Do not recommend at all."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMYlAwSUc3ekp1YVhBEAE",
            "text": "The absolute best! Great ambiance, delicious food and the service is wonderful. David y Julio are amazing. Always makes you feel welcome."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvNXZ1ektnEAE",
            "text": "Excellent place is my second time at this  restaurant for a private party  the food is delicious.  The service is great I highly recommend you go and check it out you would not be disappointed."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJMk42UkhBEAE",
            "text": "Very large portion served. The food is so so good! The waiter service is top-notch, just like the food served here. We had skirt steak, paella de marisco, and red sangria. Sorry we didn't take photos cuz we just wanted to eat and enjoy it that much. Maybe next time we share photos"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3OU9yMm9RRRAB",
            "text": "Super 👌🏽👌🏽"
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRa2M3R1NREAE",
            "text": "Mi lugar favorito por su buen servicio y amigable atención"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRcE1LNW5BRRAB",
            "text": "The various appetizers are delicious and a must try. Paella is ok, but do skip the steak salad."
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXLVpHa2hnRRAB",
            "text": "My family and I went here to celebrate my grandmother and uncle's birthdays. I reserved a table ahead of time through Google Assistant. The staff was so friendly and professional. We loved the mussel appetizers with the tomatoes on top. The…"
        },
        {
            "date": "수정일: 10달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRcC0ySWZREAE",
            "text": "Excelente 👌!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2bmR6YzNRRRAB",
            "text": "I just love this place! The food, the atmosphere, the attention and not expensive at all. I just can’t get enough of the Paella, Manchego salad and sangria! Come with family and friends is just that great spot that will leave You satisfied! Enjoy guys! No regrets!!!!!"
        },
        {
            "date": "11달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQdUtqbnlRRRAB",
            "text": "La comida es espectacular, el servicio es formidable.. es auténtica comida  española  amo este lugar .. la comida es deliciosa"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQOVpfSnR3RRAB",
            "text": "Great food and best service by David!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQMXB5N2tBRRAB",
            "text": "Restaurant Review\n\nWe had an absolutely delightful dining experience! The menu special was fantastic, and we thoroughly enjoyed every dish. We started with the buffalo chicken wings, which were perfectly seasoned. I opted for the chicken soup, lemon chicken, and flan, while my wife had the batatas, paella, and flan. Every bite was delicious and flavorful.\n\nTo complement our meal, we ordered two jars of white sangria, which were refreshing and generously filled throughout the evening. The service was impeccable—our server treated us like royalty, ensuring our drinks and needs were attended to promptly.\n\nThe atmosphere was just as impressive. The spacious seating and party room made the evening comfortable, and the music and vibrant ambiance kept us in high spirits.\n\nOverall, we highly recommend this place for anyone looking for great food, excellent service, and a wonderful vibe. We’ll definitely be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYdnR5OXNnRRAB",
            "text": "excellent food and great service\n\nif you’re looking to be transported to Galicia in Queens this is the place. step into the peace of northwestern Spain right off Northern Boulevard\n\nauthentic as can be, 5/5.\n\ncan’t wait to come back"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYdTZpdGpBRRAB",
            "text": "I wasn’t expecting a lot, but I thought it at least be decent. Smudges all over the cups, plates still had hardened food on them, sugar container had food still on it. I asked for new water glasses - they never brought new ones. Food was mid. Patatas bravas wasn’t crispy - I think it was sautéed? And there was no aioli - just bravas sauce made with very obviously expired paprika. Not sure how a tapas restaurant could not be going through tons of paprika every day but here we are. Really disappointing and we should’ve left but my mom thought it was too rude since we already sat down. If the tableware was that visibly dirty - what else is going down in the kitchen? This was what they were cool with us seeing….. what do they not want us to see? Can’t wait for the food poisoning tomorrow."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhenVMNlFBEAE",
            "text": "Nestled in the heart of Elmhurst , Cafe Salamanca is a culinary gem that brings the vibrant flavors of Spain to your table. From the moment you step inside, you're enveloped in an atmosphere that feels warm and inviting, much like a family gathering at home.\n\nThe service is nothing short of exceptional—every staff member treats you like an old friend, ensuring your experience is as memorable as the food itself. Their attention to detail and genuine hospitality elevate your dining experience to a perfect 10 out of 10.\n\nNow, let’s talk about the food. The paella is a standout dish, bursting with fresh seafood and tender meat, all perfectly seasoned and beautifully presented. Each bite transports you straight to the sun-drenched shores of Spain. The chicken parm is equally impressive, with its crispy exterior and juicy, flavorful interior, making it a must-try for anyone who loves classic comfort food.\n\nCafe Salamanca consistently delivers fresh, authentic cuisine that delights the senses. Whether you’re a fan of traditional Spanish dishes or simply looking for a cozy spot to enjoy a great meal, this restaurant is a must-visit. It’s a culinary experience that leaves you craving more, reminding you that good food and good company are the true essence of home."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuaUltd1FnEAE",
            "text": "Super bueno siempre"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiMWRpdkZ3EAE",
            "text": "Excellent menu del dia!\nDavid was a great host!\nAuthenticity was as good as it gets state side!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURianQyUDN3RRAB",
            "text": "I've lived in the neighborhood for over thirty years and never tried this spot, but finally did and enjoyed it greatly. The chicken in lemon sauce was delicious and the sangria was very nice. Everyone else was happy with their food too. The staff were super friendly and nice, including one waiter whose name I never caught who talked to us a lot about the culture of Spain. He was very fun and interesting. Worth checking out. My cousin got the shrimp in garlic sauce. Not a shrimp fan but I tried the sauce and it was also very tasty. Give this spot a try!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURicHU3aDd3RRAB",
            "text": "Me encanto y especial mente los mas ambles fueron David y Eduardo much as Gracias por si servicio."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiZ29qd0ZBEAE",
            "text": "Excellent food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyMTVTWWVnEAE",
            "text": "Love love love this place! The best Sangria I’ve ever had! The food never disappoints. David always makes us feel so welcome like we’re family. This is such a hidden gem. Please go you won’t regret it! ❤️"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMcWFfQjd3RRAB",
            "text": "Ambiente y servicio excelente.\nEn cuanto al sabor y calidad de su comida, pienso que podrían mejorarla."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMOU9MSUVREAE",
            "text": "La primera ,vez que quise entrar a este restaurant a comer mi esposo y yo no noa dejaron entrar porque la razon ,era porque mi pareja llevaba camiseta,lo cual me repugnante, discriminacion,y racismo por hecho como ibamos,vestidos, cuando hemos ido mejores restaurantes,y elegantes y de buena calidad, de comida sin embargo ,no entramos a comer...pero mi esposo no queria quedarse con las ganas de probar la comida, entonces regresamos ala siguiente semana,bueno total entramos ,tardaron en darnos una mesa ,y eso que estaba vacio, tardo el mesero en traernos,bebida,tardo en traernos la comida, bueno la comida una decepcion total, estabamos arrepentidos de Haber regresado,pesimo servicio,pesimo ambiente, mucha mala vibra,en fin no vale la pena ,el precio,y lo que venden primera y ultima vez que fuimos,en lo absoluto no lo recomiendo."
        },
        {
            "date": "1년 전",
            "language": "zh",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6eDhLZXBnRRAB",
            "text": "很棒的氛围，服务生很热情，食物分量很够，烤章鱼🐙很嫩 ❤️"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6cElmTlJ3EAE",
            "text": "Hoy vine con mi hija a este hermoso restaurante del cual no nos habíamos percatado previamente lo cual arrepiento profundamente por que al llegar aquí al instante la atención espectacular al igual que el ambiente.La comida también espléndida, demasiado deliciosa,ordenamos pulpo,mejillones y callos; absolutamente delicioso. Lo vuelvo a repetir,la atención es excelente y el ambiente da esas vibras de elegante pero al mismo tiempo tranquilidad como un lugar de comfort. Nos comentaron que también suelen tener música en vivo los sábados y que tienen un salón de fiestas lo que es realmente impresionante. Aparte la higiene es de extrema calidad, el baño muy bien aseado. Eso y muchas cosas más hacen este restaurante lo máximo sin duda volveré."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUakt2NzNnRRAB",
            "text": "It was good to see Julio after a couple of years.  The food quality is the same.  Truly enjoyed my takeout.   Happy to see they are still around.\n\nNaomi"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqcW9LMEpREAE",
            "text": "My friends have enjoyed the paella and I have enjoyed the garlic soup, the house salad and assorted tapas!\nThe staff are cordial and attentive.\nTry it if you are looking for Spanish cuisine."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREN2VhTWtBRRAB",
            "text": "Great hidden treasure, food, atmosphere, service & staff were amazing! Thanks David! I will be returning in the near future!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkdGRPU1ZnEAE",
            "text": "The food was descent. The fish was fresh & quite tasty. I liked the croquettes, patatas bravas & filet of sole."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkaXFQSWlRRRAB",
            "text": "Authentic Española dishes. The staff are attentive, and the ambiance remains tp its true Geography. I had a meal from the special menu (3 course meal), it was very good and  saved me some money."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0c0xiaEF3EAE",
            "text": "Excelente lugar para osar una velada tranquila y relajante. La comida es muy rica, pese a que su paella “valenciana” en realidad es arroz con cosas, más no una paella valenciana auténtica.\nMuy recomendable la sangri. Un tiramisú excelente."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsa1pYQVNBEAE",
            "text": "Delicious food and wonderful service. 😋"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhanRpVTZnRRAB",
            "text": "They  have  the  best paella on town...and  served  costumers.."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1aGRDQ1VnEAE",
            "text": "We were in the mood for Spaniard food. This restaurant was close by we found parking on the side street as we entered we were greeted by hosted and found our seats. The restaurant had a nice bar area and also a large sitting area. Decor and music were paused in time of the late 70's and 80's . I remember listening to Julio Iglesias a couple of times.  Was hoping for more of a folkloric music. We got a bottle of crianza red wine 🍷 and opted to the fixed priced dinner.  We did get an extra appetizer of figs wrapped with bacon. For dinner I had chilled mussels with a pickled pepper garlic they were tasty. For entree, I was served a paella with chicken sausage and clams. A generous portion. Dessert was a flan. Although I had a nice time. The food was missing authentic flavors."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURabXNmN1RREAE",
            "text": "We enjoyed everything but the food was on the average side. Maybe we did not pick the best options. The appetizers were very good, but then came the Paeilla which was large, but not very good. Lamb chops were dry. Tres leches cake was very good, and so the Sangria. All in all main course was disappointing. The service was very good, and also the setting, decor and acoustics of the restaurant. Better main courses could make it excellent place."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNacGItbkdREAE",
            "text": "Having just come back from vacationing in Spain, I found the food and atmosphere here very authentic. Will definitely come again."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNab05TZGlnRRAB",
            "text": "We were looking forward to this based on reviews.   The soup was less interesting than hot water.  The paella seemed like Rice-a-Roni with pepperoni and peas in it.\nMy chicken with cheese and bechamel sauce looked like Chicken Kiev crossed with chicken nuggets from the Schwann man… sorry Schwann’s….\nI’d say skip it."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwbFlYNjRBRRAB",
            "text": "Quisiera dar 10 estrellas. Cada vez que cenamos con mi esposo aquí nos sentimos súper bien atendidos. Todo el equipo trabaja muy bien y dan excelente servicio que no es muy común en Jackson Heights. Se distinguen por comida deliciosa, diferente, y muy buen atención al cliente. Aquí les dejo una foto de sus caracoles jiji 😜 🤤 😋"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwLVpEMWZ3EAE",
            "text": "Excellent choice, friendly staff, attention, and good food quality. I definitely will return."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXa1BfZ2xnRRAB",
            "text": "A little expensive some prices,  the patatas bravas are not the best but are fine for a starving person.\nService was good, friendly and fast.\nThe caldo Gallego and caldo de ajo was a bit salty but Is delicious.\nLa Paella valenciana was very delicious , you should try it."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoOFAyeHRRRRAB",
            "text": "They have tasty food here. Their seafood paella is really good and their gambas al ajillo is amazing. I like their lobster very much. The salmon is really amazing as well. The only thing I would not recommend is the patatas bravas, you can get the best ones at boqueria. Service is lovely and nice place to eat."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXOU82WlZREAE",
            "text": "Had not gone to this place for two years to the to the pandemic the service is excellent the food is very good in the music is very inviting the only disappointment that I had was that when they serve the bread they don’t slice it everything else was excellent I must commend in the services of David and Geraldo"
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNNdmVMSmJnEAE",
            "text": "The place has potencial, their food is good, the server we got was very attentive and helpful, but the place needs an upgrade, something different, needs a deep clean from top to bottom, also to be more flexible"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvN2NiVVhnEAE",
            "text": "The food was amazing. And super authentic. It's definitely the best paella in Queens. I highly recommend it. The seecice is amazing and everyone is very attentive. And they have a nice wine list"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxaFpPNERBEAE",
            "text": "Food was delicious and the service so good the waiter keeps coming back to check on us, thank you so much 🥰…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwNk1yQjZ3RRAB",
            "text": "Celebrated a 70th birthday with 30 people. Quality of food and Service was excellent. Our server David was outstanding.  The Owner Julio was great."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPaUp5elR3EAE",
            "text": "I loved everything I ordered today. The staff was warm and attentive. I'll be back to work my way through the menu."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCcjVieURBEAE",
            "text": "es un excelente restorante,he ido por 15 años,he celebrado mi casamiento,navidades, siempre con un buen servicio,muy buena comida y un grato ambiente"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBNWVYZ0RBEAE",
            "text": "Great food and environment. I will definitely return again."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBbDl1MkNBEAE",
            "text": "Very nice place with delicious traditional Spanish food and good service.\n\nWill definitely come back."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpeTRHNEJBEAE",
            "text": "Bad,bad,bad, called to pick up an order once I did they over charged me . Bread was unwrap, no forks or napkins in my order how I am supposed eat my food ?  Stay away from this restaurant   don't waste your money here."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnMTdpNk1BEAE",
            "text": "Get the octopus, garlic shrimp, and paella -absolitely delicious. Their almond dessert is very good also."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN5NjYtU3B3RRAB",
            "text": "I love this restaurant decoration\nIt’s really cozy. It remains me of my grandparents house. The paella valenciana was delicious and the steak. I truly love the tártara Santiago and the tres leches"
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1enVHVXFRRRAB",
            "text": "Es un lugar muy acogedor y el servicio excellente , la cómoda deliciosa me siento como si estuviera en la misma espana , la música el vivo con guitarra acústica me encanto , les recomiendo este lugar en el corazón de Jackson heights .  Es un lugar para todo evento"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCMHZtV19nRRAB",
            "text": "tasty paella 🥘 incomparable, great sangria, hot toasted bread…"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyNTdpQXVRRRAB",
            "text": "A great place to have a very well prepared meal. I love the shrimp in garlic sauce, the paella Valencia, stuffed lobster, and more.  I've never been disappointed.\n\nI have eaten here many many times over the past 20 years. Wonderful service, good music, nice atmosphere. You can go alone, or with your family and friends, and you will be treated like family."
        },
        {
            "date": "6년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURrc2RXZzJ3RRAB",
            "text": "Celebrando el cumple de mi papa, mi viejo que es modelo 1929, de esos no se fabrican más 🥳🌹🙏🏼…"
        }
    ],
    "reviews_count": 68
}