{
    "name": "Romeos",
    "place_id": "ChIJ_33jCAdfwokRYbfbBMTkfwc",
    "grid": "QN3",
    "address": "74-27 37th Ave, Jackson Heights, NY 11372, USA",
    "rating": 4.4,
    "user_ratings_total": 334,
    "phone_number": "(718) 458-2174",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GRWFYb3RZMUJWYm1SUldXaFNlWFkxWTJwVWQyYxAB",
            "text": "I guest that I had extremely high expectations because this location was once Armando's Italian restaurant.  I wanted to have a special dinner with my wife.  Instead of impressing her, I found myself feeling like no one cared about service.  The waiter seems more interested in getting his chores done than being attentive to our needs.  he seemed distracted and preoccupied with putting the wine bottles away.  I had to ask for bread three times. The place made me feel awkward asking for water and additional bread for my sauce.  Fortunately, there were only two guest at the restaurant because if it were busy, I am sure the service would be worst. I am very disappointed."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wdFVraDNaekp3VUZkeVExTmtUVzFwZVdJdGQzYxAB",
            "text": "Great price and the food was very tasty!"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ObFRtUk9WMVpLYkdkMmMzZzJVVFJMYWsxQmQzYxAB",
            "text": "Hemos acabado de cenar, 4 personas, todo muy bien, aunque no pudimos prácticamente conversar por la música en vivo que había, el ruido era mas fuerte de lo que debería, en fin, se pasó bien, todo bien justo hasta los últimos 5 segundos,  cuando salíamos, justo abríamos la puerta de salida y nos alcanza el señor, quizás argentino o no se de donde seria, de pelo largo, salió con el tarro para exigirnos el tip de manera abusiva, no se porque le dimos 20 dolares,  parecía un atraco de la manera en que nos exigió el tip, después de que  le dimos el dinero  hizo una cara de malagradecido,  en fin, no nos gustó su actuar, creo que uno es libre de  dar, si queremos y si no, no creo que sea obligación, como así lo quiso el, muy mal el sitio permitir esta clase de abusos, eramos 4 personas y lastimosamente no volveremos porque no fue la mejor actitud de ese señor....  muy abusivo y atrevido , fuimos a comer no a pagar por el show que seguro era de otros. No nos interesa."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poQlZuZG5ZMmROTUdwemVXRnljWEZQYzBwWU5FRRAB",
            "text": "Es un lugar muy hermoso su ambiente relajante un lugar muy bonito para disfrutar tu comida"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkcFh5MUVVRmRtU1ZsS2FEbHFka3RZVG1FMk9HYxAB",
            "text": "We recently celebrated a birthday. Glenda & Staff made the experience truly memorable. The service provided was nothing short of impeccable, ensuring a smooth and enjoyable experience for everyone. The food was absolutely superb, exceeding our expectations in both taste and presentation. The music and live entertainment added a fantastic atmosphere to the celebration, creating a lively ambiance. Overall, it was a wonderful experience that will be cherished for a long time."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GNVRIcFJkelpLTVU1eFpXZEVOVmcyVEc1WGVuYxAB",
            "text": "Glenda and staff, amazing job overall. I can't thank you enough for everything you guys did to celebrate my parents reunion.\nAmazing performance for Jimenita Ibarra Singer and Husband. Great performance.\n10 put of 10 recommend."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taNmJtSlJVRmhXUTNocWJUUnVhM0kzY0Zob2RtYxAB",
            "text": "FOOD SERVICE LOCATION  DELIVERY  ALL NUMBER 1  A MUST GO TO OR A DELIVERY"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOX25fc1N5dXRlczZBRRAB",
            "text": "Great food and service ! I had the risotto 😘"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPSGpvYlBCNmZxdkdREAE",
            "text": "Los raviolis de queso estaban deliciosos, la atención fue excelente. Y el lugar estaba muy organizado."
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZX3R1MWpnRRAB",
            "text": "Los sábados es muy bonito con musica y se puede bailar,buen ambiente"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURndjRyZWtnRRAB",
            "text": "Food is great. Best chicken franscese I’ve had. However I would just recommend the kitchen be mindful that it’s very easy to hear them from the dining room. For example if they play their own music from their own speaker, everyone in the dining room can hear it. It can be annoying to hear two songs playing at once, one from their own speaker kitchen and one from the dining room. I heard a guest complain about it to her waiter as well. Not sure if they did anything tho. I will come back and try eating here again. hopefully that was just a one time thing.\n\nI also love that they have live singing on weekends"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnZzZ5RDB3RRAB",
            "text": "Fantastic birthday lunch. Wonderful menu and fabulous service. Highly recommend!"
        },
        {
            "date": "8달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURncEo3Qmd3RRAB",
            "text": "Buen ambiente"
        },
        {
            "date": "8달 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNneDl1UjBnRRAB",
            "text": "Lo recomiendo comida fresca.muy buena calamares buenos .un servicio excelente en todo momento estaban dispuesto ayudarte en lo que neceditaras especialmente el señor Wilmar el bartender muy pero muy amables.les recomindo este sitio"
        },
        {
            "date": "9달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfcjUtSEtREAE",
            "text": "En este lugar canto los Viernes desde las 8pm. Acompáñenme!"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYd01UOWFREAE",
            "text": "Just go there and trust me. It is an amazing place. I am a vegan and gluten free person and  they have food for\nme. I asked if I could have garlic and olive oil gluten free pasta. They made it for me.\n\nThe service is superb. I love this place."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmN1BPSnN3RRAB",
            "text": "Wonderful for just having a romantic dinner to celebrating a special occasion!\nLoved it!!"
        },
        {
            "date": "10달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmaEtfeFBnEAE",
            "text": "Ambiance au top, très cosy et belle présentation. Quelques petites confusions liées au rythme de service pour le réveillon mais rien de grave. La qualité est au rendez-vous, je recommande !"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2dGZIRUl3EAE",
            "text": "Got stomach ache twice after eating here"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2X2FLTmlnRRAB",
            "text": "This little Italian restaurant in Jackson Hts is one of the best bangs for the buck. It’s catered by very friendly Spanish staff. This place serves the best hanger steak, surf/turf and pasta dishes, along with the best mojito and frozen margaritas ( generously sized ) I’ve tasted at very reasonable prices. It also carries a very warm and happy atmosphere with engaging live Latin salsa/dance music."
        },
        {
            "date": "11달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQNXZEYl9nRRAB",
            "text": "Muy descuidados y si son así con la comida no quiero ni pensar en regresar ,hice la reservacion por medio de una app que ellos tienen ,sábado 9:30 pm y me confirmaron llegamos y el lugar cerrado después de manejar 2 horas de long island se…"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzNnJUWENnEAE",
            "text": "This is an amazing restaurant, if I could give them 10 starts, I will do it. From the Manager, the server, the music, the food everything is just perfect, we hosted so many birthdays this year and every time they treat us so nice. I will highly recommend this place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYNl9mcW9nRRAB",
            "text": "Definitely a great place to visit, if like great food, ambience and live music I will recommend specially a Saturday !"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURud2QyZmZnEAE",
            "text": "THE PRICES ARE TO HIGH ! TIP 20% IS TO EXPENSIVE ,NEVER CAME BACK,VERY DISGUSTING."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMNFlhdVpREAE",
            "text": "Lasagna 100%,  lobster in pasta with marinara and a cappuccino\nWe also had the pear salad, which I always order when I'm there. The salad is really good."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIM0phSUZ3EAE",
            "text": "Recomendable al 100% y hemos disfrutado de la calidez de las que atienden y la exquisita comida que nos sirvieron."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIb29pNXp3RRAB",
            "text": "Es cómo sentarse a comer en un restaurant de alta cocina en Manhattan . La comida es deliciosa, tiene un menú muy completo, el servicio es inmejorable y el ambiente excelente, puedes disfrutar de música en vivo de calidad  y diversión familiar\nlos sábados .\nLo recomiendo"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3bnVud1BnEAE",
            "text": "Exceptional Italian restaurant.."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3eDhDSGNBEAE",
            "text": "Lovely Italian spot in the neighborhood. Get the calamari, any pasta, and steak. I haven’t been here for the music, but I know they have a good lunch special. They have a nice selection of wines as well. They also have sports on which I’m a fan of."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyNzdLNjhRRRAB",
            "text": "Agradable. Limpio. Muy buena atención. Rica comida. Buena presentación. Agradable música. Cantante espectacular. Gracias por el buen rato."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMaGNpQWdnRRAB",
            "text": "La mejor pasta de New York! Indiscutiblemente lo más rico! Y un servicio fenomenal"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMMmJ5REx3EAE",
            "text": "Una de las meseras más bien la única mesera mujer es una prepotente y grosera mal servicio por parte de ella"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMODhEdTNnRRAB",
            "text": "Es un lugar muy agradable, la comida exquisita, buena atención."
        },
        {
            "date": "수정일: 1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxc0tTMHJ3RRAB",
            "text": "Ambiente, servicio  y sabor de su comida exelente."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhdU9uenFBRRAB",
            "text": "Great place to have a nice, delicious and quite family meal or a private event, just celebrated my kids graduation and confirmation,  had an amazing time, Charlie and his wife are the best in Jackson Hights."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMbE9xWFN3EAE",
            "text": "Me gusta su atención"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6NEluWFBREAE",
            "text": "Amazing food and very friendly staff ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUOWREbTR3RRAB",
            "text": "Excellent authentic Italian food, great service ,and a large selection of wine that compliments the food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNULWNHbXBBRRAB",
            "text": "Very nice staff and food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqbW9DMVZBEAE",
            "text": "Delicious Food.  Must Try 👌"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqNHRlN0N3EAE",
            "text": "What makes this cozy spot in Jackson Heights so special is the outstanding service. Staff is incredibly attentive and accommodating. Food is good, portions are generous."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREbzRiZndBRRAB",
            "text": "Delicious Italian food. This lobster & veggie dish was very tasty."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtdy1xQzRBRRAB",
            "text": "Attentive staff, excellent service, wide selection, great tasting and big portions of food. I've always had excellent dining experiences here."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5ek1yMlJREAE",
            "text": "I often visit this restaurant with my friends to have a good time. However, today it was surprising to see that the restaurant was empty, and the food wasn't as good as it used to be. We ordered drinks for happy hours, but when we received…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkNjVYRFBnEAE",
            "text": "Who knew that there's such a posh romantic restaurant in the heart of the nitty-gritty Corona? Went here for a girls' night Restaurant Week and they did not disappoint. The food was amazing. Ordered the calamari appetizer, salmon entree, and desserts. The plating for each food was nice with ample portion. As for the atmosphere, loved the mural and Valentine's Day decor. Definitely recommend this place for a girls' night or a romantic date."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkNDZ2U2p3RRAB",
            "text": "Buen sitio de comer yo recomiendo 😘…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkbHR6cDhRRRAB",
            "text": "Amazing deal for Valentine's Day. Food is always A+. Clean and nice staff. Must eat at this place."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0djdUamNBEAE",
            "text": "👌❤️…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxcHBiWjNRRRAB",
            "text": "The ambience is nice and always decorated according with the season. The food is delicious and the price is reasonable. The place offers live music and entertainment, good food, great cocktails, and good service. I highly recommend this place."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWa3VMaXVRRRAB",
            "text": "Pésimo servicio y la comida amarga\nNo recomiendo para nada este lugar"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzcUk2UjZBRRAB",
            "text": "We were pleasantly surprised how great this place was. Great service and delicious Italian food at a pretty reasonable price point. We had three drinks, a salad, two appetizers and one entree for $99. The ambience was nice too - they did a great job with the renovation. We'll definitely be back for more"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNobk16OHRnRRAB",
            "text": "The restaurant has a very cozy atmosphere, but is very tight for moving around. If a busy night, like the night we arrived, you can have drinks and appetizers at the bar. Be ready to get bumped around by servers and guests. The party we were waiting for was already there yet the hostess didn't know what party we were a part of, so we were there for almost a half hour while our party was already seated. Overall the food wasn't bad. The braised short rib fell off the bone and was delicious, but my wife's plate left much to be desired in terms of flavor and presentation. The baked clams were a bit dry and could have used more garlic sauce. The bonus to the evening was that there was live entertainment. Not bad for a group outing but not my first choice."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyNWRyWUlREAE",
            "text": "Haven’t gone to this little jewel in jackson heights! The mushroom ravioli was the best, the meatballs dod not disappoint either. Would come back again"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN5emF2aU5nEAE",
            "text": "Amazing environment during these tough times with covid. The food was very fresh, especially the fried calamari, definitely recommend that appetizer. Waitress staff was friendly. Overall it was a great experience."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJMWZ6X1FREAE",
            "text": "This place is amazing for a Local Italian Restaurant . I was there 2 times since they Opened Nov 9,2018 . I was there on Nov  15,2018  and then Nov 20,2018. Great food clearly . The neighborhood needed a good restaurant and not to…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhNHNqZEV3EAE",
            "text": "Good Italian food and excellent selection. The chicken parm. is well-done and smothered in cheese, tender and juicy. Lasagna was also a hit with our group as was the Papardelle. Enjoyed the experience."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHOE1TR2JnEAE",
            "text": "My food was great, the service is great too. An old-fashioned restaurant, which is better to come with a family or a large company. A bit noisy if you sit inside, but this is a feature of such establishments."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2Z3ZHc1lREAE",
            "text": "I would not recommend this place because food took over one hour to come out. Mind you there was 3 other tables inside and there already had been served. There was 2 tables outside and they already have been served. When we received our food. Steak was burnt. We ask for well done not burnt. I got the Penne pasta and was under cooked. Tomato sauce taste like it came out of a can. The only good thing that came out of the kitchen was chicken cutlet. That's the only reason it gets 2 stars. The servers and waiters were excellent. The lemonade was good 👍 This is where you come to dump your gf, If you want to be fancy. When we left the restaurant was packed."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN5LWVmUHpRRRAB",
            "text": "The best place, good service and delicious food.\ngood weather, the waiters serve amazing.\nand it is a good place to celebrate any occasion."
        },
        {
            "date": "4년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhdHZ6eXF3RRAB",
            "text": "El ambiente es muy agradable y los viernes se baila muy bien el único detalle es que en el plato de salsa pesto sirven solo 4 camarones, le indícamos al mesonero y trajeron 2 camarones más que lo cobraron como ración extra, en fin mi amigo estaba molesto pero luego con el baile se le paso"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvZ1lpVkpBEAE",
            "text": "The food is delicious, the service is good and you can feel at home because the place is nice and comfortable."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQwcXNqV2tBRRAB",
            "text": "Hands down one of the best service at a restaurant I received. The lunch menu is very affordable, only $20 and you get an appetizer, lunch, dessert of cheesecake or tirimusu and coffee or tea. The waiter are amazing as well. This place is about a year old and it's a nice little spot. It's not busy at all during lunch hours."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLNk9XUTdBRRAB",
            "text": "Great food!!\nOrdered 3 whole lobster dish to take out .\nPacked with seafood.\nEveryone loved it!!\nVery fresh and delicious!!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2dmF2T013EAE",
            "text": "Sorry, but this is mostly for 50s year old and spanish type... not authentic Italian... food is OK...  the atmosphere is very loud.\n\nnot recomended for family with kids."
        },
        {
            "date": "6년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwdHR1VE5nEAE",
            "text": "Desde que llegamos al restaurante fuimos atendidos con excelencia y cuando probamos la entrada y la sangría supimos que todo estará de primera y con unos precios razonables. Gracias por la atención."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLblBmNDdnRRAB",
            "text": "I love the food at this place! I recommend their eggplant parmigiana - the best! It's served with linguini al sugo! Don't forget trying their glass of Malbec - very good quality!"
        },
        {
            "date": "6년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVdjViVlFREAE",
            "text": "Exelente Atencion y.una Exquisita Comida pa pasar en un buen ambiente Familiar. Se los recomiendo a la Familia de mi Novia q están x aka de vacaciones les encantó todo la Comida."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCcV9mVlNBEAE",
            "text": "I celebrate with my family there and everything was great! I love the bronzini fish 🐠"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSb3FhR2lnRRAB",
            "text": "Let me start of by saying that we visited this restaurant twice and both times it was disappointing. The first time we went was during the pandemic when NY finally allowed indoor dining. The restaurant was busy but seemed organized. We were sat in the front of the restaurant where it was somewhat separate from the other diners which was fine. We didn't realize they would forget about us. We sat there for almost 20 before a waiter came over to ask if we had ordered? Already a red flag. After ordering drinks and appetizers it took another 45 min to get our food. We were extremely frustrated and hungry. The waiter didn't apologize for forgetting about us nor did he offer to discount anything. Although my husband enjoyed his meal mine was nothing out of the ordinary.\nWe decided to go back last week to give it another shot in hopes it would be different. We made a reservation and arrived 5 minutes early. As soon as we walked in we waited for a host but no one appeared. The bar tender which was across from us asked very rudely if we had a reservation which I answered yes. He almost seemed annoyed we were there. He sat us at our table and walked away. He almost tripped on the way out and I realized he was drunk. Very unprofessional. The food is not great and the service is terrible. They also lack management. I would not recommend this restaurant to anyone."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNMHFEamlBRRAB",
            "text": "Great restaurant. The waiters were amazing and the food was great."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxNk8teFhnEAE",
            "text": "The food and service was exceptional"
        }
    ],
    "reviews_count": 71
}