{
    "name": "Jahn's",
    "place_id": "ChIJh5G77qhfwokRQxa2rO4j0eE",
    "grid": "QN3",
    "address": "81-04 37th Ave #1, Jackson Heights, NY 11372, USA",
    "rating": 4.4,
    "user_ratings_total": 990,
    "phone_number": "(718) 651-0700",
    "reviews": [
        {
            "date": "1주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxc2FqbGFZa0ZOUW04MlIxTm9jMUpPZVhoR1dHYxAB",
            "text": "La atención del personal es excelente"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20weU5GWk1hRzV0VWpsQmFVaG1TM0ppT0hSUlMzYxAB",
            "text": "classic american diner spot in jackson heights/roosevelt avenue area. expansive menu with plenty of options for all tastes and it all sounds so nice that you will probably get stuck on what to order.\n\nwe ordered a chicken parm sandwich, which came with fries and a chicken noodle soup and was one of the daily specials. also went for the big jahns special breakfast which comes with everything you'd want at brunch - eggs, bacon, sausage, and pancakes. jahns also has a huge ice cream selection and we got one strawberry malted and one vanilla milkshake.\n\neverything was really tasty and reasonably priced with great service - definitely recommend"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1RFdVNXpkbTVGVDBsaGIxZE5kbTVFU0VoNUxXYxAB",
            "text": "Perfect place for couples"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSbFgySnZSMlptY0c5MVNGRlllblJXWTFGRFNsRRAB",
            "text": "I genuinely try and see things from other people's perspectives, but this was really sad to experience.\n\nMake sure to only order what's specifically on the menu. ANY change to a menu item results in a pretty big upcharge. The food was good, all I asked for was a change from potatoes to a salad, which was a few pieces of lettuce with two slices of tomatoes. No dressing.\n\nI understand that if you ask for anything extra or substitute certain items for others, it would result in an upcharge. Apparently the guy in the front was proud to say this place has been open for 65 years. Good for you, but you can't upcharge someone $4+ when I substituted potatoes for that. 65 years shouldn't even be a justification for that. Did you just upcharge everyone for a cheaper change for 65 years? Is that how your business was built? I can tell you don't like admitting you are wrong.\n\nHe went to claim that this substitution is the same as someone asking to get 2 eggs for free.  Every time I tried to talk, he just deflected with something completely different to try and throw me off. It was like talking to a brick wall. I worked in the service industry, I understand some customers are going to be mean and want more for less, I've dealt with them. I was respectful when bringing up my concern by the way.\n\nHe went on to say that there are costs associated with a simple substitution. According to him, I ordered dressing when I didn't. Mind you, I didn't even get the coffee with the special I ordered! You already save money from not having someone spend the time to cook the potatoes in oil, seasoning, etc. I got a few pieces of lettuce and two slices of tomatoes. You also saved money from forgetting the coffee!\n\nWord of advice to that front desk guy: Maybe take a break, and think about what made the business successful 65 years ago instead of just using it as a way to say you're right. It is LESS work and money to grab some raw veggies Instead of cooking potatoes.\n\nThanks to the chefs for making the good food though, and the guy that walked by to offer coffee to my parents is a great guy. The waitress should have at least just mentioned the massive upcharge when I wanted that cheaper substitution. I should have taken a picture. I respectfully brought up a valid concern and I get talked to as if I've never ordered food in NYC before. It takes a lot to get me to write a negative review, and you did it. Congrats. Here's to another 65 years."
        },
        {
            "date": "4주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tORExYTkhaMVpYZG1waFMxTjBUbTB4VVY5dFozYxAB",
            "text": "El servicio es excelente"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaRmMzb3dNVkIxYlZOeWRHZExObmxmTFdGSWVFRRAB",
            "text": "Love this place. Everything about Jahn’s is soothing, and it’s a total happy place. Great food, and amazing ice cream. Love the decor and the fact that it’s always there for you!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201TU9WVm9MWGhOTUZoT2VTMWZkazA1TkhGSmJrRRAB",
            "text": "Located on busy 37th Ave. We walked by Jahn’s one time and got reminded that morning so we went. There was a parade so cross streets were blocked and finding parking was more difficult. Meter or residential parking spaces around. Not far from Roosevelt Ave/Jackson Hts/74th St station hub.\n\nLoved the ambiance - like an old fashioned ice cream parlor/diner with the stained glass lampshades and dark wood/maroon upholstery. Narrow and long space up front, more tables in the back. Was full when we went but glad wait wasn’t too long.\n\n3 of the waitstaff asked to take our order, but the one who actually took it became assigned to us- was patient and kept returning to check on us. Our coffee was refilled a few times.\n\nThought prices were ok on the menu but noted later of $1 more for egg dishes (i really should check the bill while there in case have questions). I did see a note at the cashier stating a $0.50 surcharge due to the egg shortage but this was when I was already paying.\n\nLarge menu - breakfast served all day,\nto lunch/dinner options. Got a corned beef from the egg sandwich section. Portion was ok for me, corned beef a bit dry so coleslaw and pickle helped, fried egg overwell (wasn’t asked how I wanted it).\nAn order of Chocolate chip pancakes was big. Regular buttermilk pancakes can be picked as a side, instead of toast and hash potatoes.\n3-egg Omelets - quite a few to choose from. German one had the hash potatoes already in it so can opt for pancakes.\n\nWas looking forward to some ice cream but disappointed when I learned the hot fruit toppings were not real fruits. Maybe will still order next time just to try.\nIce cream menu needs more details. Had to ask what each section was about: Tummy Tickler =1 scoop, Double Double =2 , Large Tummy Tickler= 3-5 ; Banana split =2 , Royale =3 (so shareable!).\nHad “names/titles” but no specific description of what’s in each one."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wWk0xSkVTbFppU2pnNGRqUnNVVzlSYXpaaWVXYxAB",
            "text": "The burger was over cooked they said it was 12 oz it was smaller than the bun - the turkey club was cut thick - the server didn’t come back to the table until he came to pick up\nThe dish never asked if we wanted anything else - we stopped to pick up Chinese food on the way home - never going back- shouldn’t have left a tip"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCUWVUTnRWMkpZTFd0RGJISXpXV1k1ZERWclJYYxAB",
            "text": "Classic old diner. They make a great grilled cheese and provide unlimited coffee."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxc2VsZHZjemhCWHpoTlNGQm5PVjlaWVhKMk5XYxAB",
            "text": "Pecan pancakes were to die for a really really amazing pancakes perfectly cook Cali grilled chicken wrap was OK at best and penne. Vodka pasta was also OK. Not too impressed. Fries were good, but I would really go here for the pancakes."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GRmNVSnBXblJXYlVoNlFTMUZPV0poT0hsSlVIYxAB",
            "text": "My parents and myself are regulars there. Anyone else complaining are just passing by consumers.\nServices is amazing no complaints! The staff are attentive, kind and humble people.  I love love their Omelet and waffles 🥰"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201b1QyWk9NWEJKY1ZKdlkwSnhVekUyZUUxb1puYxAB",
            "text": "Great old-fashioned diner with great food and even better sundaes"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kMlVFcG9lWGxTWjBFNFZrbE5UbEZYWkVObVNVRRAB",
            "text": "Had a lovely date with my girlfriend, just a clam experience, would come here again since they do care about having great service, very kind and lovely."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OYVZsSjBjVVl6ZEdJeGVYWnlWRkJ6UzBKZlJGRRAB",
            "text": "Been going there for years since I was a kid."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURza2JIOFhREAE",
            "text": "Food is good but sometimes service is really bad"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wRmRqbG1RMjgxVVZkVlptRklNSGc1VVVWblJsRRAB",
            "text": "The food and service here is great. Such a nice old school diner and atmosphere. Happy to dine local and in a community staple in my area!"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OeVV5MVVOVXhDTjFWa2ExOTVNSFJMUm1wa1MxRRAB",
            "text": "Comida típica estadounidense.. Muy bueno todo"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kweVFVNTVkVW8xV21GdlYzaFZNV3BPTkhkZlNWRRAB",
            "text": "It's a typical diner and the food is alright. The atmosphere is the traditional diner atmosphere.\nThe food was nothing special."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OTVEwRlhhMkUwWW5sdGFFOW9aVkZMU3pGU2VXYxAB",
            "text": "Food was cold when it got to.us, the sausages were cold. It appeared that someone took them off another place so they would not have to cook them and gave it to use. Our waiter to not see or check on us for 14min, it was not crazy busy perhaps moderate. This place certainly went down"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210dGFtZGhVV2N0TVU5cmRsUldSMGRTZGtRMGNYYxAB",
            "text": "Perfect cute diner! Loved the tuna melt"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VLYlZ1OUdaemNhMXFBRRAB",
            "text": "Forget any other Dinner — this place is a gem. A true step back in time with a wonderful vintage atmosphere. On top of that, the food is delicious and the service is outstanding. An unforgettable experience."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKYlY5ZlBodm92THhnRRAB",
            "text": "A cozy classic diner! Had the fluffiest French fries!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJOThhcmFREAE",
            "text": "Always come here when I need to feel at home."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3d09MTUNREAE",
            "text": "Claudia is great! But the food sucked."
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3MmJtZVJnEAE",
            "text": "Exelente"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRMDdEcVpREAE",
            "text": "Best and Only Diner in Jackson Heights"
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRdzZlQVlBEAE",
            "text": "primera vez que visito este lugar y me  gustó, buena atención, el sitio acogedor y deliciosa la comida en Queens NY."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRdWFDY0dBEAE",
            "text": "It reminded me of years ago...."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnNXMzY2tBRRAB",
            "text": "Excellent as always. Best deep fried French toast in 5 boroughs and beyond. I hope this, the last Jahn’s location, doesn’t close too. Please keep supporting local businesses!"
        },
        {
            "date": "10달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmX2FQYzBnRRAB",
            "text": "Muy buena Atención los meseros muy amables siempre están listos para ayudar los precios muy razonables muy buena comida"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmbmZtS3FBRRAB",
            "text": "Everything you want from a real diner"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2clAyenJ3RRAB",
            "text": "Although it was super busy, we sat in a booth pretty quickly."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzX082SmRBEAE",
            "text": "My favorite neighborhood diner. It is such a gem. It’s one of the rare New York places that feels like your time traveling. The vibe and decor here is perfect. When my family are friends are visiting from out of town I always bring them here and as soon as they walk through the door they give an audible gasp and say “oh my god! I love this place”. And their food is great too!! I love their breakfast and coffee. Staff is always friendly, too! I love this place so much. Highly recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYM0lUME9BEAE",
            "text": "Everything was delicious and wonderful service\nI love banana pancakes 😋😋😋"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYeV9lbjRnRRAB",
            "text": "Pedi un Fresh toast con fruta y eso era los panes los rociaron con huevo medio los pasaron al comal y zas para la victima que fui yo, una total decepcion,  yo queria disfrutar mi desayuno sentada en el park y para colmo no me pusieron cubiertos y syrup,  que frustracion."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKd1BIc0xBEAE",
            "text": "Butter melt down"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIdWZudG13RRAB",
            "text": "Such a wonderful staple in Jackson Heights, we moved to Westchester 10 years ago but still try our best to visit when we can."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURINUtYTFJBEAE",
            "text": "Es un lugar espectacular y una opción muy acertada si quieres comer y pasar un tiempo ameno con tu familia"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3LThEdlNnEAE",
            "text": "Growing up on Long Island, we had our local Jahn's Ice Cream Parlor, right next door to the Skating Rink.\nThis is the LAST Jahn's left, and we hope it stays forever.\nThis evening, we shared the Roast Brisket Platter, which includes Soup (Vegetable 👍), Bread, Potato (Baked 🥔), Vegetable (Broccoli), Beverage (Lemonade), and Dessert (Rice Pudding 🍮). The Brisket was a little dry, but the Gravy helped, and everything else was fine, all good, solid diner fare. We've been here before, and we'll come back again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3eEl6TWFBEAE",
            "text": "I love diners in general and Jahn’s is one of them. What makes this diner unique is that rather it being along a major highway or boulevard like most diners, it is squarely on 37th Avenue in the middle of the Jackson Heights so it is fairly easy to walk to. Aside from that, there are no frills - just straight good food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3eVBtSUFREAE",
            "text": "I went for breakfast with my dad, they are always busy and good service with good food, back then I use to always get burgers with fries with good amount but it’s been a while I haven’t had it. Today I got breakfast can’t wait to try burger again soon! It’s worth the price"
        },
        {
            "date": "수정일: 1년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6NElhajV3RRAB",
            "text": "Los desayunos son lo mejor que puedes encontrar y lo mejor a un buen precio....."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3LXN6Sm5BRRAB",
            "text": "This lovely place will never let me down. My family and I come here for breakfast one a week. I always get myself the Bacon cheeseburger deluxe, it never ever goes wrong. It's juicy and so tasty. The customer service is amazing, they treat each other and their customers like family. Im glad this place hasn't modernized itself because it's one of a kind spot."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3NnRTMGVnEAE",
            "text": "Buen servicio 👍…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3d3NqQ2F3EAE",
            "text": "I am giving this review as I don’t appreciate the fact that I was overcharged.\n\nI visited your restaurant twice last week whilst staying renew York from the UK. We really enjoyed the food and couldn’t fault the service, the clientele also seemed very contented. So this came as a shock!!\n\nI paid for the meals with my debit card under 40 dollars on both occasions but when I looked at my UK statement, I have been charged additional monies as the tip had been adjusted.\n\nWe are in another diner just down the block and paid similar prices without being ripped-off.\n\nIs this how you treat guests?"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiMFlMWWNREAE",
            "text": "I did not know  this diner existedin Jackson Heights.  . Nice typical diner.  Very attentive staff.  One of the few remaining diners in Queens!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiektydXd3RRAB",
            "text": "Great old school diner luncheonette and dessert place. It is the last of what was many locations. I had a great breakfast and served quickly. I just ate too much for the dessert.😂"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNid3RqMVZREAE",
            "text": "I'm a fan of breakfast foods when it comes to diners. That said, I'm always leaving feeling good 😊"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiMkwySElREAE",
            "text": "The real ice cream parlor, established over 150 years. Nice service, still reasonable prices 👍"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyMDZfR2lnRRAB",
            "text": "Coffee, banana split and pastrami/egg/cheese sandwich. Very reasonable price and good environment"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4cmNENmJBEAE",
            "text": "You can’t beat a classic. This place has charm and really good diner food. The shake and ice cream selection are of course the standouts. My boy gave this a high burger rating of 5/5. It’s a small space with no parking, so don’t be surprised if there is a wait. Kids menu is diverse."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkMzlTcUN3EAE",
            "text": "A place where you can feel the traditional New York flavor. Started in 1897 as an ice cream chain, the lampshade with a stainless steel glass feel is unique. Went for a simple lunch for a friend's birthday, and this is actually my third visit. I can't say that the food is the best, but the kindness of the staff and the unique atmosphere of this restaurant are something that anyone visiting New York should experience at least once. Grilled American Cheese Toast was topped with tomatoes, crispy bread and rusty cheese. The neat tomatoes piqued my appetite. My friend ate an omelette and said it didn't taste bad. We had a great time here, and refilled coffee is above average."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURab1BlQjNnRRAB",
            "text": "I loved the atmosphere of this diner, really gives you nostalgic vibes. I came for brunch over the weekend and was seated quickly. Booth was spacious and comfortable, menu was huge (and quirky)\n\nWe got the Mexican omelette with pancakes, topped with strawberries and bananas. Omelette was delicious, and they were generous with the amount of fruit for the pancakes.\n\nWe also ordered the Cheeseburger Deluxe, asked for medium rare, and it was cooked perfectly.\n\nIf you order coffee, you get unlimited refills, which they're quite adamant about offering to do. In my opinion the coffee was a bit weak and watered down, but for the price and the quantity it was expected.\n\nOverall, great value and experience. I definitely will be back with some friends, maybe to tackle the Kitchen Sink. I'd also try the waffles next time, they smelled delicious when they were making them."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1ak5TM01REAE",
            "text": "Definitely one of our favorite spots in the neighborhood. We are always treated like family and the staff is so heartwarming and kind. Food wise the pancakes are perfectly fluffy and well made. We come consistently for breakfast and we are never disappointed. The dessert menu looks so tempting but I have yet to try. Will do very soon!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtMF9fb3RnRRAB",
            "text": "Nice traditional diner. Waiters here service people nicely. Ordered an omelet with potatoes & breads. Coffee is refillable. Definitely will come again if we are around. Btw, interestingly they write recipes manually, only when you pay with cards then you got a separate one with the total amount to sign."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGc2ZXX2ZREAE",
            "text": "This is as old school as it gets here in NYC. Since the late 1800's, Jahns has been serving the community and stepping in here, its amazing to be apart of that history. I sat down imagining the many people from the past decades and century who have come through this establishment. And the ambiance just brings you back in time.\n\nThe service here is amazing. The waiters are on their A-Game, tentative, thoughtful, always making sure you're accommodated.\n\nI had the breakfast here and haven't had a chance to try out the ice cream so I'll comment on the breakfast.\n\nThe breakfast is your standard, basic diner fare done very well. No complaints from me. Bacon, eggs, pancakes, home fries, omelette, sausage. Stuff you can't go wrong with and they don't get it wrong here. It's basic and I mean that in a very good way. It's exactly what I was seeking and exactly what I got. The manager was super friendly, filled my cup up with extra coffee and went around making sure everything was okay. I wish I got his name.\n\nVerdict: If you're in Queens, looking for some old school classic dining experience, with the ambiance and history of that to boot, look no further. Jahns is certainly worth your visit!\n\nPros:\n-Great ambiance\n-Great Service\n-Good pricing\n-Great history and classic diner ambiance\n-Basic diner food done very well\n\nCons:\n-Not really a con but if you're looking for something more out-the-box or extraordinary this won't be the place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUcy1qTWlBRRAB",
            "text": "What a great experience. Wonderful classic food that tasted great and interesting, classic ice cream selections as well. A blast from the past but remains relevant and worth visiting."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKbTkyNVhREAE",
            "text": "Nothing short of what you would expect from a classic Diner. Great Reuben, great pancakes, great burger, great shake. Well priced, friendly hospitable servers and quick service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNWdjh5ZFV3EAE",
            "text": "Coffee was not strong. Burger plate was fine, breakfast dishes were good, always get the sundae. Consistently a good experience"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEcnBIbVRnEAE",
            "text": "Very nice place. The food is so tasty! It’s affordable and too many options on the menu. The pancakes were the best."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJcDZpVFZREAE",
            "text": "Nice place with a good atmosphere! However, the sausage was incredibly fat and the bacon was too salty. The pancakes had very plain taste, but at that price it was acceptable :)"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoOXBqNkxnEAE",
            "text": "Jahn's is one of those places that stay in your memory.  I first came here as a young teenager.  We used to come for their incredible Sundaes.  Some things have changed, such as the mini Jukeboxes in the booths and some things on the Sundaes you now have to pay extra for.  However, it still has that feeling of nostalgia.  The food is good and so is the service.  If you come on your birthday, you get a free Sundae, which is a very nice touch on their part.  It is a neighborhood staple in Jackson Heights.  It is a place that welcomes friends, families and solo diners, equally.  The prices are good and the portions are big.  I hope this place stays around for generations to come."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJM29TZUZnEAE",
            "text": "Delicious food at great value. The restaurant has recently been remodeled, though no public wi-fi. Extremely busy on Sunday mornings and afternoons — you will wait fifty minutes if you are lucky! Small though clean bathrooms."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREcXZ6VmJnEAE",
            "text": "Hear business since 1897 , ice cream is very good not that sweet that what I want . Staffs are very friendly, even not morden layout but still clean neat and comfortable to hang out."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnMWRqWXRRRRAB",
            "text": "Right in the Heart of Jackson,Hiegths Queens near the corner of 37 Ave and 81St one block from the 82nd St 7 Subway station.\n\nI order a Breakfast Western Omelette with American cheese and white bread it's was very good and satisfying, to top it off with coffee really made my breakfast and Lunch, they do have specials that Finnish at 11:00AM, there's plenty of seating but depending of the day of the week it gets pack.\n\nI been coming here for years and this place has survived many changes in the neighbor, there are many restaurants in the area,the staff are friendly and helpful,  nothing beats JAHNS diner."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSX2JmWEdBEAE",
            "text": "Estuvimos desayunando en un parada de un tour guiado. Todos comimos el sándwich de pastrami y nos encantó. Sitio económico y muy recomendable."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOaHR6dXlRRRAB",
            "text": "Jahns was a treat my parents would use to bribe us to behave when I was a kid in the 70’s. Alas the Jahns we went to on Myrtle Avenue is no longer there. There is, however, the Jackson Heights store still there. Our recent visit brought back all of the wonderful memories and the ice cream is still the BEST. Their coffee is also amazing. Not the modern half caf almond milk cold foam latte BUT an old fashioned cup of excellent coffee served in a white coffee cup."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUbWIzczF3RRAB",
            "text": "Yesterday I visited, I sat at the bar and the waitress with a rude attitude asked me if I needed a menu and I answered that they were there but I hadn't realized they were in that place, I ordered an omelet with cheese, When I was eating it, it didn't have cheese, I asked them to change it and the second one did have cheese but it had pieces of egg shell and I also ordered pancakes and in the same way it had pieces of egg shell. When I wanted to ask for the bill, no one turned around, and when I paid the girl who is in the area to collect, she only asked if she should leave a tip and in the end she didn't even say thank you."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJbW9HUXZBRRAB",
            "text": "Lovely! A place in Queens where one can feel transplanted to another time and era. Had floats, ice cream and staff were super accommodating and explain the menu very well."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqNXRMemZ3EAE",
            "text": "Great nostalgic diner. Service was fast and friendly. Ice cream and fries were so delicious so make sure you get dessert."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBNy1fSlN3EAE",
            "text": "Having heard about this place and craving some ice cream on a hot June day, we decided to check it out.\n\nWe were not disappointed. Apparently they are also a Greek diner of sorts but the food was not to be on our plates. There was only one thing in our sights: ice cream sundaes.\n\nWe had a fairly tough time deciphering the menu though. There's a lot of cute local names for things and no descriptions. We asked the waiter and he tried to tell us to just build our own sundaes. But with all the fun names we were curious and the friendly waiter flagged down the \"boss man\".\n\nHe better explained the menu and we were like \"OOooooh\". The different sections are really just different sizes of sundaes with different themes. The themes are based around a single topping.\n\nSo really just go ahead and order the number of scoops you want and the toppings you'd like and there you go!\n\nFind pictured my strawberry/cherry vanilla banana split. It was great!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVMDRYRWF3EAE",
            "text": "Still a great place to get ice cream after all these years.  A vestige of Queen's older days.  Been there 60 years.  Real flowers on every table and every table is marble is a nice touch.  Yes they still do sell \"The Kitchen Sink\" sundae.…"
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBeGFINFlREAE",
            "text": "Beautiful restaurant with a large variety of almost everything you can want from a diner! Their desserts are what they’re known for. I usually come by for a quick bite for a date. They serve you large portions & are always refilling your water/ coffee cup. I definitely recommend their spinach pie & anything on the dessert menu."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNOXNpSnR3RRAB",
            "text": "I've been coming to Jahn's for a few months now, the food, the service, the portions, the value is all amazing. Simple done really well and you can tell it has been the recipe for success unchanged for decades. Mexican omelette with potatoes and toast is incredible."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURzLWV1MHl3RRAB",
            "text": "This place is very old, it est in 1879. It has its nostalgia but this place is not very clean, its DUSTY. floors look like they get clean twice a week. Doesn't look like they mop. Food is eh. I wont come here again. At least I can said I visited the last JAHNS.\n\nP.S. owner,  please clean this place up.  It has potential."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtNlpXZmp3RRAB",
            "text": "Such an appealing gem of a diner, I just had to stop in for lunch. Had a roast beef triple decker which was pretty good.\nLooking forward to dining there in the near future."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCemEtV2NBEAE",
            "text": "I was craving for a classic old school NYC diner. This place satisfied my craving thank you so much!\nWhen I'm back in the city this will be my first stop for breakfast 5+"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEM0pTbVh3EAE",
            "text": "Good day, how are you doing? We have returned because she expressed a desire to sample the French toast, and here it is."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURzOVBiTUZREAE",
            "text": "Services are great! Food is amazing! I love their steak and fresh berries waffle!"
        }
    ],
    "reviews_count": 79
}