{
    "name": "Ricky's Cafe",
    "place_id": "ChIJyagBDAdfwokRVsUCMXWw-qc",
    "grid": "QN3",
    "address": "75-02 37th Ave, Jackson Heights, NY 11372, USA",
    "rating": 4.3,
    "user_ratings_total": 454,
    "phone_number": "(718) 478-1360",
    "reviews": [
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taRWFsWmFMVmxGYWpWcmQySTRSbTFzUjJsRk9WRRAB",
            "text": "The best of the best avocado toast I’ve ever had in my life!! Looks like a huge portion, but salad is pretty light, the bread is not too hard as usually avocado toast is, and super easily to cut, the dressing is so tasty. Would love to be back when I travel to NYC again."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205QlVYcEZkVTl1WDJFM1pYZEhkM05vY0haVGIxRRAB",
            "text": "Yummy food in casual decor and great service"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGelVWWjBZMkV6Y3kxM1ZVTlZVSE01YWxwSVoxRRAB",
            "text": "Nice place with great food and service. Surprisingly secluded feel for location."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xscVNtaFJYMXBOWkZoblpYUlhVVkJmYUdaMlpYYxAB",
            "text": "Lovely cafe with warm service and traditional eats and drinks"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205NlUwRnNkMHhVV0d0SFlYZFlZMHRFWWkwNFIxRRAB",
            "text": "Nice people awesome food and drinks"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOT2IyMUllbXBrUkVzMWNuUkhaa05UYkhsNVpFRRAB",
            "text": "Los trabajadores de ese lugar son muy profesionales, atentos y muy efectivo sobre los pedidos"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0WVFYUjZTVGd0ZG5RNVZISXdSMFpyY0hwWlRrRRAB",
            "text": "Lovely spot. I'm not here very often, but when I am in the neighborhood to visit my friends, this is my favorite place to get breakfast. The pancakes and bacon are fabulous and I have always gotten good service. I highly recommend."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5dlozcE5kbTR3VjFnelYzcDBVSGw0YVMxaFMzYxAB",
            "text": "Great diner.  Love the Sancocho de Gallina that is served on Fridays."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xScVJsVllaV3RyZDJsVmJFSXpZMFJCVW5CMFdWRRAB",
            "text": "The breakfast wrap was delicious.  I didn't finish it all and heated it about two days later and it was still tasty.  Highly recommend this diner.  The staff was also very pleasant."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WWGJrNU5aMkV0WmtGS2EweFJSMlp5ZWtwWFdtYxAB",
            "text": "Very friendly service. Food here was exceptional. I judge mashed potatoes and they either use a very good quality instant mash or make it themselves but it seemed better than ihop mashed potatoes.  Had their steak n eggs and it was delicious. Server was very friendly,  and somehow knew we were new customers and took good care of us. For a place as busy as Jackson Heights,  it was weird that they knew we haven't been there before.  It felt they knew their customers and were very much involved in providing a good experience.  I appreciate that. Try it out, food is good"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VKS1ZzSm5UbHJhdktnEAE",
            "text": "Avoid the shakes. It was more milk with chocolate syrup.   The burger was cooked well but no flavor.\n\nThe staff was nice, but did  check in again until we were done.\n\nWill not be going back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VLQ3MxSUhQMk0yR09REAE",
            "text": "This place never disappoints. Great freshly cooked homemade food that's quality at its best. Owner is usually there working. Menu can vary with delectable tasty surprises. Salmon with cilantro lime rice was amazing. Price and the wait is worth it. That's how you know they make every dish to order with love and pride. A comfortable sitting area has a bathroom. Near the subway. Also has counter seating.  Always friendly. Gd for breakfast lunch and dinner. When in Queens visit Ricky's Cafe you won't regret it."
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VONnNtYkRxNE43ZkZREAE",
            "text": "Muy Rica La Comida Y Muy Amable El Personal"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJV2d4SXItX2JqdFd3EAE",
            "text": "Great place to eat....great service. A real neighborhood cafe..."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPeTA2T1BtNHQtU2V3EAE",
            "text": "Super good service,"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VNdW9rN2pmc2FyOXl3RRAB",
            "text": "Conservative cafe with conservative employees bad vibe 0/10"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOcXRxMDFRRRAB",
            "text": "I've been to rickys a few times now and every visit is a great experience. I don't come as frequently as I'd like, each visit has me looking forward to the next. Coming to Ricky's is a special treat. Everything is made fresh so it takes a little bit to get your food. They always refill your cup of coffee multiple times. In the past they even offered me steamed milk. My favorite part is they never rush you out the door which is lovely and pricing is extremely reasonable. This place should be cherished.\n\nArchived Review:\nI've been looking forward to trying this place. I just moved to the neighborhood and I am in a bunch of the jackson heights facebook groups. This guy darren & \"racoon rich\" have been torturing me with photos of there meals from here. I was in the mood to go out for breakfast and new instantly this was where I wanted to go. Phenomenal service and great food will definitely be back."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRaWFDc3lnRRAB",
            "text": "Great Happy Hour & Wings for the area. The guy serving was incredibly nice and welcoming. Honestly these wings took me back to my high school days. Never thought I would be able to taste wings like these again. I definitely will be back for the wings. Get the sauce on the side!"
        },
        {
            "date": "수정일: 8달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4NWFLNmRREAE",
            "text": "Me gustó, es un ambiente acogedor, la atención es excelente..recomendado en Jackson Heights NY."
        },
        {
            "date": "10달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2bGRPYWh3RRAB",
            "text": "Très bonne adresse pour se restaurer à un prix décent pour la prestation. Serveur très sympa, pas mal de choix à la carte."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2eHJiTy13RRAB",
            "text": "Great place for breakfast or lunch.  Great food and great service"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQaklUVk93EAE",
            "text": "I needed a place to get some coffee and a bite to eat while I had some time to kill before dropping my daughter off at LGA. We found this place 10 min from the airport. Real friendly service and the food was delicious! So conveniently close to the airport. Stop in, if you have time to kill before dropping off at the airport, and go enjoy some good food with friendly service here!"
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpbFBDSl9BRRAB",
            "text": "The friendliest staff and some pretty great french toast"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQbzZfMC1nRRAB",
            "text": "Great food with generous portions and friendly service.  We had the steak and eggs, and the  turkey club.  All was great, including the coffee!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzbmEtTF9RRRAB",
            "text": "Good"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYaVplamVREAE",
            "text": "Loved this place, I went there twice while I was staying in Jackson Heights. The vegan choice is not big but what they had was good enough for me - especially the avocado on toast (no egg) it was amazing. I also had the vegan burger which was good. Great service from Barbara and the other ladies on both occasions. Recommend."
        },
        {
            "date": "1년 전",
            "language": "pt",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYcnF5MUFREAE",
            "text": "Melhor sopa de lentilhas que já comi. A avocado toast é saborosa e nutritiva. O ambiente é agradável, bem localizado, sentei em uma mesa com vista para a rua, atendentes atenciosos e educados. Comida maravilhosa !"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYcHFYT0J3EAE",
            "text": "Staff there are loving respectful people...When I first walked in staffs showed me nothing but love welcome me.. New to NYC nothing knowing anyone not having no family here. I'm from Philadelphia PA yes I'ma Philly Girl Ricky's cafe my new New York family ❤️❤️❤️❤️💓💓 My favorite place to eat food delicious place clean whole place wonderful....Love Harley ❤️😘\n\nPs\nCOME EAT YOU DEFINITELY WONT BE DISAPPOINTED"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyaGVxdm5RRRAB",
            "text": "The Huevos Rancheros I had, were delicious. The staff was so cordial and prompt with my coffee and my order. I will definitely come back all the time."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURybksyNzV3RRAB",
            "text": "Many excellent dishes, very fresh and with generous portions. Dishes for any time of day. A super friendly, longtime neighborhood place, diner style. (Pictured - the beautiful Cobb salad, an excellent choice for these hot summer days, a meal in a bowl!)"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNZNTZDREZBEAE",
            "text": "This place used to be great.  Unfortunately I cannot recommend it any longer.  Portions were reduced,  the quality of the food and ingredients used went down, and even the service is lacking. It's really a shame."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqNmJldVJnEAE",
            "text": "Excelente lugar buen servicio"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqN296VUh3EAE",
            "text": "Delicious steak and eggs great and friendly servers."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREc2NmQVJBEAE",
            "text": "Dropped by here to get a bite to eat on the run.  Got the Cheeseburger Deluxe- it was really good!!! And so was the company.  Everyone in here was very nice and it was like eating with family.  ❤️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5ODZYcTFBRRAB",
            "text": "Ooh man. LOVE . love ❤️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5c1A2T3pRRRAB",
            "text": "First time visit Super disappointed Egg was undercooked watery in the inside Asked to check and they agreed was undercooked Served again and the vegetables inside wasn’t cooked at all The waiter said I had to ask them to cook Wasn’t it the job of the cook to saute the veges ?Never going again"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkbjRudnlBRRAB",
            "text": "I think that's enough for a restaurant that is proud of its own food. I saw people walking down this street happily eating out of the window. Finally, today I am eating here, and the customers' happy faces are not just the taste of the food. The bright face and kindness of the owner and staff make me feel like I am eating at home. I ordered today's soup, garlic oil spaghetti, and French fries. Oh, no! I don't eat cilantro, but I wouldn't have cilantro in it. If it weren't for cilantro, it would be a soup like clear beef soup in Korea. Garlic spaguettes are usually. But there is an important twist here. The moment Step mixes authority green hot sauce (like jalabino and avocado) with spaghetti, the taste changes. What a clean and light spaghetti. It's so delicious. Steph was right to try it instead of Tabasco. Freshly fried French fries taste savory and delicious as if fried in clean oil. I think there will be another reasonable price and good atmosphere"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0dVpXZ2N3EAE",
            "text": "Aquí encuentras excelentes desayunos a un precio accesible."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOXzlmV1lnEAE",
            "text": "Very bad coffee was cold and spilt and food cold never will order again"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxdi02REJBEAE",
            "text": "Wonderful food and great service. The homemade hot sauce was amazing!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1NmFmc2RBEAE",
            "text": "Good food"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1NHZMRXhBRRAB",
            "text": "This is a very enjoyable place to eat. It's not huge, but there's room for a number of tables and customers. There is a modest selection of dishes, but the quality of the food is good. It's well prepared and presented. The food is mostly simple and wholesome, but there's also some creativity in the menu. The staff is friendly and helpful. I love coming to this diner. I've also had delivery from this diner, and it's also good. It's been around for a while."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURadUo2T0ZREAE",
            "text": "In my Many many years of living in the area. This was my first time trying Ricky's cafe. There is a wide variety of items to choose from and I came specifically for a late breakfast . I ordered pancakes, with strawberries, and blueberries and scrambled eggs. It was absolutely perfect, pancakes were fluffy.. Eggs were cooked just right. I always judge a cafe/diner based on their breakfast. Because if they can't get that right, there's no need trying anything else!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwck1EakFREAE",
            "text": "The people are very friendly not a long wait for the food easy-access if you're handicapped"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwdUpEYVpnEAE",
            "text": "Good food Good service Good price 👍…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKMXQ3SzhnRRAB",
            "text": "I’ve been here at least 4 times already I come here every Thursday I can before starting work and I always get the eggs Benedict. I love how I can sit where ever I like with no hesitation staff is friendly and food is good as well . They remembered their customers from what I’ve seen which is nice glad I found this little gem"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKM09Ua1JREAE",
            "text": "If you're looking for an affordable place to eat I wouldn't recommend this place. To be honest the only thing good I could remember from this place from the times I've eaten there is the green spicy sauce but after that their food is average, nothing crazy or interesting dishes on the menu. I went today with my boyfriend and we were STUNNED to see the check was $50 when we only ordered an entree each. We added up all our food and we saw the price was 36 and some change so when we asked the waitress why it was $50 it's because they charged us gratuity and did not tell us. On top of that to hide this extra charge they gave us a receipt without a break down of all that we paid and!!! didn't even tell us that they already added the gratuity! And if we're being honest the service was not great it took forever to be service water, when we came in there were only 3 tables besides ours with two waitresses and it already was looking like a struggle for them to keep up with the tables and not to mention that each table had about two people each. Not to add more insult to injury traditionally in an eating establishment you don't automatically add the gratuity unless the group eating is more that 4 people. I understand times are hard but we do not need to resort to lies.\nAll I'm saying is if you choose to eat here please check your receipt and ask for a receipt with all your items on it."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKeEwtbGxnRRAB",
            "text": "Food is fresh and yummy. Barbara made us feel right at home! We enjoyed our dinner. My daughter loves it at Ricky's. She has dietary Allergies, they are very accommodating and the food is delicious. She is now a regular. Highly recommend, bring your friends!"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKaC1idnpBRRAB",
            "text": "Definitivamente deliciosos desayunos Los encuentras Aqui en Rickys's Cafe 😋😋 💯 LA attention excellent  👍…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4aGVxU1d3EAE",
            "text": "I was there today, for years I been going to Ricky’s, today the service has horrible, the lady being the food only, I have to call her many times, she saw me was doing signal, but don’t know what she was thinking, not the same service anymore, missing the old Ricky’s café"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPME9xRFNnEAE",
            "text": "The quality of the food is very uneven. Well sized breakfast plates prepared fresh and cheerful service. The avocado toast was refreshing for being generous and not at all fancy. The pancakes on the other hand were salty and dry. The coffee was quite weak, but it tasted good enough when drunk together with eggs or spicy food. Service tends to be very slow. The only restroom has been permanently out of service, which is irritating."
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBNDZ5YVJ3EAE",
            "text": "I keep trying to give this place a chance and I'm always let down. Either it's empty and I get no service or the service is fine and the food is terrible. Way over priced- 3 flat pancakes for $6, and barely 1/2 plate of potatoes and eggs. I asked for cheese and it wasn't even melted. This is the last time I ever come here. I will spend the time to go up to Ihop - or Nevada Diner on Queens Blvd which is AMAZING.\n\n**the waitress tried to fix with more potatoes and she was very nice. I'm still not coming back but appreciated the fix. Toast was DRRRRY and never got coffee refill. Bummer"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnOUw3anF3RRAB",
            "text": "Great place to grab a quick and tasty bite.  Servicer was nice and a very relaxed atmosphere.  Good for a brunch with a friend or laid back date."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRam9ua0RREAE",
            "text": "Cucumber ginger ale - made to order by Barbara is sooo good as is Ricky’s black coffee. Homemade green hot sauce and fresh avocado added to the garden omelette hit the spot. So fresh - as is Barbara - you cannot miss this place when you visit Queens. Love it!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURldUtTYXF3RRAB",
            "text": "Nice setting, portions not that big. Overall it was OK. I prefer other diners in the area."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVcm9ISi1BRRAB",
            "text": "Convenient location near Jackson Heights at 75th street and 37th Ave. I was looking for late breakfast around noon. I found this place on the way, street meter parking. No host, small place so we sat ourself. Waitress took our order, my…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBX1BLZG5nRRAB",
            "text": "I was pleasantly surprised by how delicious the avocado toast (and the iced coffee) was at Ricky’s. The servers are lovely as well. I’ve lived in the neighborhood a long time and just never stopped in. I’m glad I finally did!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPaXB1OHFBRRAB",
            "text": "I love it\nMenus are f good. Love the customer services. Very clean and delicious food out here."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtOU5Dcm5BRRAB",
            "text": "This was my first time eating here.\nI ordered smoked salmon in scrambled eggs. The eggs were scrambled soft as requested. It was served with a fresh mixed salad. I enjoyed the food and the coffee was very good. The service could be improved. They did not bring the water I asked for so I drank the water I had for walking.\nThey also forgot napkins.\nI would go back."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvNlplek9REAE",
            "text": "Good food and friendly staff -- tried the eggs benedict very tasty"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4d3V2SjFBRRAB",
            "text": "This used to be my husband and I’s favorite breakfast joint in Jackson Heights. We went there last Sunday and we were sad to note that quality had gone down. The omelets looked different and the avocado inside my omelet certainly didn’t taste very fresh, there was no salt in the home fries.\n\nPlease also check your bills carefully because they’ve started adding a mandatory 18% tip fee to the total and you could miss that if you don’t check each item and end up double-tipping. Kind of sneaky of them to do that when minimum percentage tip is 15%. It’s like trying to make the customer pay for the fact that they can’t pay their staff a livable wage. We used to pay $30+ for breakfast for 2 people there, last weekend we paid $50+ for the same thing. Most likely my husband and I won’t be going back after having been regulars there for quite some time."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJemRxUjB3RRAB",
            "text": "Around here there is only street parking so make sure to come by train if possible.\n\nThis place is a dinner like at the corner and the staff is very friendly.\n\nWe sat here drank coffe and our waitress was awesome. She did not bother us making us order things. she only told us to make sure to call her when we ready, and that is great cause we took our time.\n\nTuna melt- I got it with dinner roll and a cheddar cheese. Amazed with the taste. The food here was pretty good. this is a very nice meal. I will come back to have it again.\n\nI do have to say that they took a little long to bring the food and it was a little cooler when it got to the table.\n\nSo the biggest negative to me was the food not being as warm as I hoped but besides that it was a great place to come a chill, drink some coffee and not worry about a crazy waiter trying to flip the tables.\n\nI will come back again for sure."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJZ0tuTm1BRRAB",
            "text": "These people care about your dining experience. Food is fresh, carefully prepared and thoughtfully presented. For example the hummus is prepared in-house and is always fresh with just the right amount garlic, lemon and other spices. So I…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1eWRuVWl3RRAB",
            "text": "Their milkshakes and cappuccino was great! The owner is so nice and offered our family to use the restroom if we had to. She gave us tips on getting to Times Square as well! We will be back during future trips!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQycjVhaExREAE",
            "text": "I have to say I was expecting more from this place, but they disappointed me again and again, after few visits at different times I have come to the conclusion that it is over priced, waitress work with difficulty because they don't do team…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyNmVEajd3RRAB",
            "text": "I love this place. It is a homey, local safe haven. The servers are extremely kind, and the food tastes great ! The pricing is good for the area, meaning, not expensive. I always have the empanadas or the garlic roasted potatoes."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwNDlIdUt3EAE",
            "text": "Very high quality food and nice staff! Prices are up there ($13 for a Cobb salad), but this cafe has a diner vibe which is probably why. Worth it if you're feeling like taking someone out for dinner or treating yourself."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNVa0pXS1JREAE",
            "text": "Horrible experience!  Have been there twice this week and both times left unhappy.\n\nFirst visit ordered a spinach omelet and got it with out the spinach and was charged for ham when there was no ham and I did not order ham!\n\nToday waited over thirty minutes for pancakes, eggs and bacon!  EVERYTHING CAME OUT ICE COLD!  They bought it with no syrup the waitress never came back to the table I had to take the plates to the register to give my complaint!  NEVER GOING BACK!\n\nCAN I GIVE A NEGATIVE STAR RATING?  THAT US HOW I FEEL"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzOHFHc1ZREAE",
            "text": "The lady at the kitchen suggested me and my friend \"Chicken Romano\" and it was so delicious. She personally cooked it for us. One of the best Cafes in Jackson Heights. The staff here really cares about pleasing their customers. I love it!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXaWRXb2JBEAE",
            "text": "Bday breakfast with 2 awesome Waitresses!\nand great food like always!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRaVpYeW9BRRAB",
            "text": "The food is always fantastic! I come here often for late weekend breakfast. Cheap and tasty Steak&eggs and amazing hummus. My only issue is with the slow service..the people are great, nice and friendly, but not as attentive as they should be."
        }
    ],
    "reviews_count": 71
}