{
    "name": "Salvaje Social Club NYC",
    "place_id": "ChIJfyYinx1fwokRvPBNz8PIQmY",
    "grid": "QN3",
    "address": "79-11 Northern Blvd, Jackson Heights, NY 11372, USA",
    "rating": 4.6,
    "user_ratings_total": 646,
    "phone_number": "(929) 991-7799",
    "reviews": [
        {
            "date": "수정일: 13시간 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SNGJUWlpabTFHWW1sbk1qbHlObGwxYVZwNFdGRRAB",
            "text": "Muy bueno el servicios pero fuimos buscando latín party de la Northenblvd y nos dieron American partyy, bastante decepcionante el DJ parece traído del Bronx ( no es que el Bronx tenga nada de malo, pero es diferente la música dmque buscas en un club en el Bronx. Brooklyn, Manhattan que en la Northenblvd)"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoVFNtRnROM2xwVG10YUxUbDRabEpaTjNWTU5WRRAB",
            "text": "Absolutely loved my experience at Salvaje Social Club! The vibe here is unmatched — from the music to the crowd, everything feels upscale yet fun. The cocktails were amazing (especially their signature drinks), and the staff was super attentive and friendly all night. The atmosphere is perfect for a night out with friends if you are looking beautiful decor, great energy, and everyone’s just having a good time. I’ll definitely be coming back — 10/10 experience!"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSNmR6aEJjMnR5TFhkTWJHMWpWelo2VVhOV1pWRRAB",
            "text": "Ty to Isabella the best waitress"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT204NGJ6QlBVMmd6Y21aM05sUlpZVE10ZUVkWVIwRRAB",
            "text": "Spectacular place. Spectacular evening ."
        },
        {
            "date": "1주 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5MFNXOUNVMWhwUzA5cmFGWjJYMVJ2VkdoUmJVRRAB",
            "text": "Pésimo\nLugar no lo recomiendo te paran y te quitan el\nAsiento y ni siquiera dejan que te tomes tu trago tranquilo y dicen que ya tienes que darnos\nAsientos groseramente primera y última vez que visito ese lugar no tienen educación"
        },
        {
            "date": "2주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Gb1RtSk1TVFpuUzFGVlJrWXRPVkJPUjE4MmJIYxAB",
            "text": "Muy buena música, buen ambiente y un excelente servicio nos atendió el bartender Maikol fue muy amable y servicial. ya e ido varias veces a este lugar me gusta la atención y la comida"
        },
        {
            "date": "2주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twNlNtTkxSM3AzVjNKM2VqQTJiRkZHVkU5QmRGRRAB",
            "text": "Fui atendida por Michael Acosta todo a tiempo y con la mejor atención y disposición totalmente satisfecha"
        },
        {
            "date": "2주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WalgzQkNZVm8xZWpCTVRqazNZamRaZVhCdllsRRAB",
            "text": "Muy agradecida con la atención de Michael el bartender un excelente servicio y muy amable volvería a ir fue mi primera ves pero me gusto mucho ."
        },
        {
            "date": "2주 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCWlRURlVTVjlxU0RkbGJYSktVRWgzUlRSaFYyYxAB",
            "text": "Muy lindo el lugar, el sonido y la decoración espectacular pero me parece una falta de respeto que el cliente pida un Tequila Reposado y le den Montezuma creyendo que las personas no se van a dar cuenta! Ademas de cobrar $20 por trago e incluir la propina te dan trago Malo!"
        },
        {
            "date": "2주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1cU5VMUpXSFJuUkhCUlJVcFJkMlpGWjJremNHYxAB",
            "text": "El ambiente se este lugar es increíble el lugar es cómodo la comida superó mis expectativas me gustó mucho la atención del caballero Michael espero volver pronto"
        },
        {
            "date": "2주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KaFRFZEZZa3RVT1dWaU9HeGFkbFpSWlhGelFYYxAB",
            "text": "Hola fui a este restaurante con unos parceros a conocer este lugar y la verdad quedé satisfecho con todo lo que ofrecen en el restaurante nos agradó mucho la atención del joven Michael  fue muy atento y nos recomendó platos la verdad volveria"
        },
        {
            "date": "2주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WRFJrRlFWelpNZW5veFJVUlNlVkUyTmpsNVVWRRAB",
            "text": "Fui el Domingo con mi familia y es un excelente lugar, son deliciosos los platos que tienen son exquisitos.... Y atención al cliente de Michael es muy cordial, muy atento... Recomiendo muchísimo este lugar"
        },
        {
            "date": "2주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkelVHeERiMFY0VWpSWVluazFhRUZ6WnpKblkxRRAB",
            "text": "Michael Acosta excelente"
        },
        {
            "date": "2주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214SE4ydzFPRlZaY1ZWRE9FcE9kV2xHY3pkRVRFRRAB",
            "text": "Maicol\nExcelente  servicio"
        },
        {
            "date": "2주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SSlowUjFPRFZxY1RoNWRYa3lkV2t6WlhWUmNWRRAB",
            "text": "El servicio del bartender Michael fue excelente muy amable y servicial"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ablNYcFpibTkzTjNkd1ZtOWZibkpQTlRNNWRsRRAB",
            "text": "Food was great. But was charged gratuity for 2 on a Friday. Atmosphere was awesome."
        },
        {
            "date": "4주 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Vd1pVZElTR295TTFWeU1rSlFiVk5SUzFGWE5tYxAB",
            "text": "Nos hecharon del bar porque nos quieren obligar a comprar una botella apesar de estar consumiendo"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKMmJESkNPV3BpYlhOQmVETjRRWGt4YkRSNU1rRRAB",
            "text": "I recently visited El Salvaje and had an experience that left me quite disappointed. I attempted to use my points on Toast Tab, but the waitress informed me that the promotion is only valid during happy hour. This restriction was not clearly communicated beforehand, which was frustrating.\n\nWhen I asked to speak with the manager to clarify the situation, instead of a manager, they sent over the bartender. This felt inadequate, as I was hoping for a more authoritative response regarding the promotion and my concerns.\n\nOverall, my experience was not what I expected, and I left feeling unsatisfied with both the service and the handling of the situation. I hope to see improvements in communication and customer service in the future."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21keFNFczBTMk0xY2xkM1NFaG1hSHBDZUhScVNYYxAB",
            "text": "Love the food there. Drinks are quite good. Nice staff, great DJ for the vibe. Been there twice on a Monday and once on a Friday. Definitely recommend."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GclpIUTJkM0k1YlVSaWJ6ZFJURk5MVldWMllXYxAB",
            "text": "Fuimos 3 amigos y el servicio de la bartender fue totalmente deplorable, la atencion muy lenta y solo estábamos nosotros en la barra.  pedimos todos el mismo cóctel de maracuya pero al repetir la segunda ronda notamos qué el sabor no era igual en ninguno de los tragos. Los precios super elvados. Y la hokka por las nubes. Hay mejores y sitios mas económicos para pasarla bien."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210YWNFVnBSQzFVWm01T09GUmpVVk50UlhsNFZVRRAB",
            "text": "Un ambiente de poca madre 💯 % recomendado volvería una otravyotras veces más"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oQmFrMTNWbFoxUzFGdllqQlhMWEZFWVZCVWRFRRAB",
            "text": "Visitamos el lugar con mis amigos y siendo sincero fue una experiencia única, la comida estaba al punto exacto en cuanto a sabor y textura, la atención de Camila fue inigualable haciéndolo sentir como en casa."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xalMxSnhWV1JPTUZGcGVGZDRSVVZZTWpoV1VVRRAB",
            "text": "El servicio de Camila es ejemplar, siempre a disposición del cliente ajustándose a las necesidades y restricciones. La comida es lo más cercano a la esencia de Latinoamérica."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paVFIycFRXRE5NU1RWM1MyUXRURzFKUW1oT1lVRRAB",
            "text": "Excelente lugar para distraerse un rato, los tragos muy ricos y buen atención de Sergio."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KVGJFVTJOWFZ0ZEdsbFR6Wm1RbFJRTkUxNGNIYxAB",
            "text": "Comida muy deliciosa y buen servicio de Sergio."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWRlptbGhiMjVZTlRCSWVXbHBkV0prTUVrMGNFRRAB",
            "text": "I had a greattt time. The food was great and the kitchen was open late. My host sergio was so attentive and kind. 10/10"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oRldUUkdhbVpNUVc0MlJXRTFhbmRpYkU5Q1EyYxAB",
            "text": "The place in the heart of jackson heights is a gem with ambience, service and people.\nDrinks served by Luis Miguel was awesome.\nCame here for Thursday's happy hour and the vibes were good. Will come back."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toSmNreFJOMnRCUnpFNGJXWmliWEkyYTJONVVtYxAB",
            "text": "Muy buen servicio de Sergio, muy amable y atento, también me gusto mucho el Miltons rice y los tragos excelentes."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aWVVtTlZMWFpJTkVGTlgwZ3daVEozY1VaV1JVRRAB",
            "text": "Me encantó el lugar\nRecomiendo mucho dos vacas y una jirafa son hamburguesas deliciosas\nY los tragos deliciosos especialmente el 7 train\nGracias a la atención de Daniela súper recomendado\nVolveré ❤️"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kb1FYcHdkbTk2ZWpCTk5YTkJiemxST0dKT2EzYxAB",
            "text": "Me encanta el lugar lo he visitado por varias ocasiones especialmente los martes me encanta el 2x1 para chicas en margaritas y el take out que tienen despues de comer los tragos y la comida deliciosos gracias a la bartender Daniela\nGracias salvaje"
        },
        {
            "date": "수정일: 2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqMi02YWR3EAE",
            "text": "Excelente servicio de Daniela\nEl lugar hermoso y la comida muy deliciosa"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oVFVqRnJXWEZUWWt4VlRuQTRRbWhaWlVsb00yYxAB",
            "text": "La comida es deliciosa y la atención también súper buena! Lo unico malo es que los baños mantienen sucios :("
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkWVpVeG9PR1JXVUd0b1IzZHlXSGhDZVd0S1oyYxAB",
            "text": "Excelente servicio por parte de Camila  muy buena  atención y muy buena comida demasiado fresca muy recomendado"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tFNWIwdFRUa1pPUjJ4dVQzSndTMmxWYkZKcllVRRAB",
            "text": "Great atmosphere!"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oRWFHczVYMjlTV0hoU1pYcE9ObU16WTNaak5XYxAB",
            "text": "Wow, wow, wow! Excelente servició, ambiente de lo máximo y la comida ni se diga! Muchas gracias Luis Miguel por tu servicio excelente!"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pBMmJXVXhMWGhMZUhoSFpsWnZNazlDU0dwMVZGRRAB",
            "text": "He ido a salvaje en varias ocasiones y definitivamente volvería a ir me encanta el lugar DANIELA es una de las mejores su servicio eficiente buenas opciones de licor y excelente actitud"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCRk5GOXVRVXhOZEVkaFVETkhaVXRIVkVwMWRHYxAB",
            "text": "Muy buena atención, me encantó el lugar!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xSFprNVViV2h4Ym1SUk0xZG5aMHhTVjJGYVYzYxAB",
            "text": "Security guard does not know trouble is. I was minding my business and he kicked me because of bunch of drunk guys. I only had a club soda and lemon."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sa2IydE1OVEl4TVV4dFgyZHZhMjFEYTJSZlNHYxAB",
            "text": "El lugar lo califico 20 de 10, realmente me encantó,  superó nuestras expectativas, el ambiente es sensacional muy recomendado y la atención de Michael marcó realmente la diferencia , fue demasiado cordial, amable y atento , siempre dispuesto a ayudar y a colaborar con nuestros pedidos , su atención siempre fue ejemplar."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKblFXZFJXRkZ6UWsxNVMwRm5PV3RoZFdrNVJsRRAB",
            "text": "Visitamos el lugar hace unos días con mi pareja y quedamos encantados. La comida y los tragos estuvieron deliciosos, ¡totalmente recomendados! Pero lo que realmente MARCO la diferencia fue la atención de Michael: siempre atento, amable y con excelentes sugerencias que mejoraron aún más nuestra experiencia. El ambiente es muy agradable y el lugar se siente acogedor. Sin duda, volveremos 🫶🏻"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBcXJtVm93RRAB",
            "text": "Salvaje is the best spot\nThe food is a bomb\nThe drinks are amazing\nThe staff are very nice and awesome\nLuis the bartender was super attended & knew Exactly what to recommend me for the menu . Thank you\nI give this place 10/10\n\nSalvaje is A Great Spot to chill & enjoy the vibes …\nLuis the bartender is A Great Guy &\nKnow the vibes does great drinks ….\nThe Food , & Drinks are amazing…\nIt’s a Great vibe to Chill\nFridays & Saturdays are lit 🔥"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjM1UxWXplWEJaYlRob1RYaGliRTFUUkhaV1VGRRAB",
            "text": "The food is amazing and the service is really good. Luis Miguel  is very friendly and he makes really good drinks !!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkdGMyMW5TMUk1TWxCNVRGcFJiRVJuTUU1RUxYYxAB",
            "text": "From the moment I walked in, Salvaje made a strong impression. The décor is absolutely stunning—modern, stylish, and full of character. The vibe is elevated even more by a top-notch sound system that adds just the right energy to the experience without being overwhelming.\n\nDinner was excellent—each dish was thoughtfully presented and packed with flavor. But the real highlight of the night was the bartender, Luis. Not only is he well-presented and professional, but he’s also incredibly friendly and charming. His drink recommendation was spot on—elevating the entire dining experience.\n\nIf you’re looking for great food, a beautiful setting, and top-tier service, make sure to grab a seat at the bar and ask for Luis. You won’t be disappointed."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2todFpFaG1SMlJLZGtjd2NVbElUazFXUkVWQ2VtYxAB",
            "text": "Excelente lugar la comida muy rica y sobre todo el servicio de Luis Miguel súper eficaz súper atento les recomiendo 🥰"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xMlRXdE1VRlp2Y1VOU2IyTktNR1ZwT0Y5WU1YYxAB",
            "text": "Muy bonito lugar y la atención excelente por Luis Miguel desde que llegué  muy atento y las bebidas excelentes lo recomiendo en la semana hay diferentes actividades y fin de semana brunch con ej recomendado 💯"
        },
        {
            "date": "수정일: 2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBd1ltWXRSekJTUm1zMmR6UnVka2RWVlZVNFVtYxAB",
            "text": "Muy buen lugar"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pac01qaERkbGN0WDJkbWJGVkJSbTFEWXpkd01IYxAB",
            "text": "I was really looking forward to trying this restaurant, but unfortunately, the service experience was deeply disappointing. I waited at my table for over 25 minutes without a single staff member acknowledging me—not even a glass of water was offered during that time.\n\nWhat made it worse was the complete absence of communication. No one checked in, no updates, no apologies. Also, seeing multiple staff behind the bar on their phones or sitting down or hiding, while guests (including myself) were clearly waiting and even getting up to find assistance. It wasn’t even rush hour about 4-5 tables were occupied. Eventually, I had no choice but to walk out without being served.\n\nI understand restaurants can get busy, but hospitality is about making guests feel seen and valued—especially during longer waits. A simple “we’re running a bit behind, thank you for your patience” or offering water would have gone a long way.\n\nI hope management takes this as constructive feedback and trains the team to prioritize basic guest care. It’s the kind of experience that makes people not return. First impressions matter, and unfortunately, this one missed the mark."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xseU4zTlFRVkZ2UVdOU2NETjBjVzV6YlhscVprRRAB",
            "text": "Muy lindo"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WTVExZHBjVGxhV1hnd2FHaE1jek50TVdkWk1XYxAB",
            "text": "Service was terrible and delayed… and the place wasn’t even busy. The thing that I found completely inappropriate or rude is the fact they allow for children to come in and solicit in the establishment. When I was there I observed SEVERAL children come in with candy and gum trying to sell to us. And literally NO ONE said anything. In an establishment that gas ALCOHOL, I think it’s extremely inappropriate to have children soliciting in the business."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkbFMyeG5jMDV1YWs1dldYZFZPRzQ1VTBzNFdtYxAB",
            "text": "Servicio excelente Luis y sergio"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBbW9PZ29BRRAB",
            "text": "Came here for Brunch on a Sunday and WOW I was impressed by the decor and the jungle theme. Everything is well thought out. The food is really good and they have some creative tasty eye-catching Cocktails. The staff is very friendly and our server ANDRES was really helpful and made great recommendations. Thank you, I will be back to explore the menu a bit more."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1R1FsVk5aa0l3UXpCQmFrTmZOMlJPU2pOMVduYxAB",
            "text": "Stopped by for brunch around 2pm, no wait time- which was awesome, I was sat immediately and greeted by a wonderful atmosphere and staff. The food was amazing, which was a plus. Will be back very soon!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxVGREZ3hTbVl6U1haUGIydDBiVkJDTkMxd1NuYxAB",
            "text": "Been going to salvaje these past few weeks with my girls and the last 2 times I had Jean Kevin as my server and he is the absolute best. So attentive, super nice and an overall vibe. Every time I come, I look forward to him being my server."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWSmJHOVNURTFtZFhwalF6QXRXakJHVEdsRVVFRRAB",
            "text": "I usually don’t leave reviews, but my experience at Salvaje Social Club last night was honestly ridiculous. The bartenders, servers, and security team were all great — no issues there. But the DJs completely ruined the night. I tipped both of them well just to play one song. When the first DJ ignored it, I assumed maybe he forgot, so I tipped the second one too. Still nothing. Four hours went by. I even spoke to the manager (light-skinned guy with long hair), and STILL they never played my request.\n\nIf you don’t take song requests, that’s fine — just say so. I would’ve happily spent my money on more drinks instead. But to take my money twice and completely ignore me? That’s not just unprofessional — it’s flat-out disrespectful.\n\nI’ve worked in hospitality for over 10 years, and I would never treat a guest like that. It’s not even about the song anymore — it’s about basic customer service. Whether someone spends $20 or $2,000, every guest deserves to feel heard. This was disappointing, frustrating, and honestly unacceptable. (I went here Saturday 11:20-3:20)"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfNkpQZ2lnRRAB",
            "text": "I recently dined at Salvaje for a birthday celebration with a group of 10. The establishment was beautiful and the music was great.  Unfortunately, our experience fell short of expectations, particularly in terms of service and organization.\n\nWe had reserved a table for two hours, and upon arrival, they combined a few smaller tables to accommodate our group. However, the waiter didn't take our order until 45 minutes into our reservation, which delayed the food considerably. By the time our large order was brought out, we were already nearing the end of our allotted time. At no point did the waiter inform us that we were running out of time, nor did they ask if we wanted to extend our reservation or wrap up the meal—something most restaurants typically offer in these situations.\n\nOnce our two hours were up, the staff removed one of the tables while we still had food on it, leaving two guests without a seat. Telling me that we went over our two hour reservation. When I expressed that this was uncomfortable and unprofessional, the waiter suggested they squeeze in the remaining guests near the DJ, in a corner that was cramped and hard to navigate. The area had very little space to get in or out, and it made our group feel rushed and uncomfortable.\n\nTo their credit, the manager offered us shots in an attempt to make up for the situation, and after further discussion, they removed the appetizers from our bill. They also brought us champagne, but unfortunately, the glasses were not clean.\n\nWhile the ambiance at Salvaje is beautiful, the service was disappointing and lacking in professionalism. If you’re planning to visit, I’d recommend sitting at the bar where the experience may be better, but based on our visit, I’m unlikely to return in the future."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURveTRPR01REAE",
            "text": "Excellent afternoon spent at this place. Its happy hour is great very reasonable prices in its latin savage ( jungle decorated) place. Very creative and delicious drinks with aguardiente, tequila, and Mezcal. The food is very tasty and last but not least Daniela's attentive service. She was bartending and serving and always felt how she cared for us and the savage experience."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twc1dUQnNNemRIVWxwNWMwdDVlbGxzYmtjNWNsRRAB",
            "text": "Salvaje Social Club NYC is a vibrant, upscale spot that blends bold fusion flavors with a high-energy, nightlife-inspired atmosphere. — I love this place and 100% recommend for celebration! Thank you so much Isabel!!"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQalZqWTI3NGJ1TTVnRRAB",
            "text": "Went to salvaje to celebrate a friend’s bday. And I was very pleased with the service and the food. After 10-11pm the restaurant turns into a nightclub DJ and all, the crowd is very fun!!. The drinks are amazing and the presentation 10 out of 10. Friendly staff."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvdU0zVTNBRRAB",
            "text": "Wow amazing food we had soup, empanadas and the Elote!!! Soooo good. Their passion fruit drink is also amazing! Super great ambiance and service."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRdk9Hb0x3EAE",
            "text": "This is one of the best cocktail experiences in NYC! From the moment you walk in, the ambiance is perfection—intimate, stylish, and inviting. The bartenders are true artists, crafting impeccably balanced drinks with unique flavors and top-tier ingredients. Every sip was an experience, from the beautifully presented classics to their inventive signature cocktails. If you’re a cocktail lover, this place is an absolute must-visit. Can’t wait to come back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOclNFWXpTMnh6WW5aMU0wOXRiRmRvUW01WUxYYxAB",
            "text": "I had an excellent experience at this restaurant. The food was delicious, the atmosphere was very pleasant and the place was clean and cozy. But what really made the difference was the attention of Michael, one of the workers. Since I arrived, he was very friendly, attentive and professional. He made sure everything was perfect during my visit. Excellent service, 100% recommended!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURReWJpY1BnEAE",
            "text": "I had the best time here! Daniela is an amazing bartender, and the food is absolutely fantastic. Great place to go to for a happy hour or to dance the night away. Cannot recommend this place enough!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOZ2Myc1FREAE",
            "text": "A must try if you come to Queens!!! I loved the experience here, the food is amazing fresh and the presentation is innovative. We loved our bartender Yari she was very attentive and amicable! Most importantly she had recommendations for cocktails and food! The Executive chef Alex and manager Julian were also exceptional."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMazVQaFpnEAE",
            "text": "Salvaje Social Club is a good place for a good time, drinks and music. The vibe was great and the drinks were strong, not watered down. The bartenders were attentive and polite. They also have hookah for $40-cash only or you can Zelle the hookah guy too. Only company I have is that it was really hot in there so be ready to sweat a bit 🥵 I definitely will go back for a brunch to try to the food."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205cWJHMU5TMmM1VWtsbldqaFhVVlpXWW1obWIyYxAB",
            "text": "Absolutely love this place! The food is amazing, and the service takes it to the next level. Our server, Sergio, was so nice and gave us the best recommendations! And the cherry on top was the cozy and fun atmosphere!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkNXNmX0hnEAE",
            "text": "Came here with my girls. Great vibe and drinks. Luis Miguel the bartender at Salvaje is exceptional. His drink recommendations were spot-on, I had the Seeds of passion, bomb drink! He was very attentive. The service was prompt, and his friendly demeanor added to the overall enjoyable experience. Highly recommend! Good vibes!"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaekpPOXlRRRAB",
            "text": "Todo perfecto. El ambiente oscuro y privado.\nLa música salsa que me encanta.\nAndrés, el camarero super cercano y atento.\n\nNosotras tomamos unas sangrías que no estaban ni muy dulce ni muy amargas.\nAdemás de una picada con la que nos quedamos muy satisfechas. Éramos 3\n\nSin duda alguna volveremos y lo recomiendo."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQaFktRmN3EAE",
            "text": "Awesome place to enjoy great music, food, atmosphere, and overall 👌 vibes.  The DJ was fantastic, and the drinks were great.\nHighly recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyaUtlSjJBRRAB",
            "text": "Came to Salvaje for their happy hour and we didn’t realize Colombia was playing Costa Rica but they still welcomed us and sat us near the bar. We received such amazing service from Julian who was always attentive with our food and drink orders. The atmosphere and energy were on point especially when watching the game. We ordered the shrimp and chicharrón ceviche twice because and they were AMAZING! Would definitely come back!"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aeFIxRkZjSEU1ZGxkc09WSlZVVzVTVEUxWGJIYxAB",
            "text": "CERO ESTRELLAS si pudiera ponerle menos, lo haría.\nFuimos con toda la intención de pasarla bien y desde que llegamos el bartender nos trató como si estuviéramos estorbando. No nos dio ni el menú, ni una sonrisa, ni ganas de atendernos. Fue una actitud horrible, como si nos estuviera haciendo un favor. Y sí, se sintió la discriminación. A otras mesas sí las atendía bien, a nosotros literal nos ignoraba y cuando por fin nos habló, fue con una mala gana que uno se queda como: ¿y este man qué le pasa?\n\nLa verdad no pienso volver ni recomendar este lugar. Uno sale a pasarla rico, no a aguantarle la amargura a nadie. Y mucho menos a que lo traten como basura. PÉSIMO servicio. 👎🏼"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WUmJTMU9ibE5yVEZoSllucG5VV2xOWjIweFUzYxAB",
            "text": "Came here because I saw the place on instragram months ago, our server Catalina was so nice and attentive. The food, the drinks, and the hookah were great. Would definitely be coming back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taeVJHeHhOWE5STjA5SlZqTm9WWGcxWDNRNE1FRRAB",
            "text": "We went last week, the atmosphere was very good, we were a group of 3 and the guy Sergio recommended \"picada tarzan\" (Tarzan snack). It was very good and perfect for several people. Excellent service from Sergio, thank you very much. We will return."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5MlQwbG1iSEJEVGpSR1dVRTVNbTFZTWtaalVIYxAB",
            "text": "My boyfriend and I went to this bar for a drink. The cocktails were a great surprise. I'd like to thank Sergio, who gave us excellent service 10/10."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkanBiZWdnRRAB",
            "text": "I like this place a lot, the ambience is mostly what you come in for, but check your bill! They add the service charge to the bill and then the terminal asks for MORE as you’re signing. In my experience, service charge if it’s above a certain number of people, I was just with 1 other friend. I think their menu says gratuity is included, so just keep that in mind.\n\nAlso, don’t order the tacos, it’s 16$ with such small portion of lettuce, guacamole and meat. The tortillas are hard and it’s disappointing for it to be so expensive. The meal was so simple for it to be so bad and expensive. The shrimp tostones are delicious though! When they opened, they used to give you 3 tostones. and now they decreased it to 2. I think it the food might decrease in quality as this place gets more popular unfortunately. Hopefully not! The drinks are great! Join the WhatsApp chat and you’ll get special deals!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20wdFJIbzRZM0pJWWpaVGRrMVdhbTFSYVZSV2VsRRAB",
            "text": "Love this place. Michael was amazing and his service was amazing. Will definitely be back. Thank you Michael for everything !"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205UlVXdG1URzExTlMxU05YVjRWSEJXYlc1SkxXYxAB",
            "text": "This is the best spot to go out in Queens. Salvaje has a unique drink and food menu and always plays great music. The vibe is always fun and all their staff is excellent. 10/10 best spot to go out to in Queens."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21JMk5GQkhRMVpLTlROcVYzaFpXRkZvVlhaUGMxRRAB",
            "text": "Pésima atención. Parece que los empleados se creen dueños del lugar y no tienen ni idea de lo que es un buen servicio al cliente. Uno viene a pasar un buen rato y lo único que recibe es mala cara, desinterés y cero profesionalismo. Definitivamente no lo recomiendo. Si van a atender con esa actitud, mejor cierren el bar."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURReVlDZHdBRRAB",
            "text": "LUIS IS MY GO TO BARTENDER!!!\nHe is the absolute best you wanna come in get the best service the best drinks the best above all!! Ask for Luis Miguel"
        },
        {
            "date": "11달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzcmRfUVhREAE",
            "text": "La comida tiene mucho sabor y los tragos muy especiales. El Dj te pone todo tipo de música! El espacio muy lindo. Te sientes en una jungla. Mi mesera fue Carolina 🫶🏼 Gracias ☺️"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOX3RLTUt3EAE",
            "text": "Me lleve una muy grata sorpresa con este sitio, fui con mi esposo, no habíamos hecho reservación pero nos encontraron una mesa. La comida estuvo deliciosa, el servicio espectacular, los cocteles están increíbles. Súper recomendado!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJak1YZVB3EAE",
            "text": "Came for brunch, it was busy but great music, drinks were good and the bartender & waiter were friendly."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURONXVlUkZBEAE",
            "text": "Just went here for a date night and I loved it! The food was amazing and came pretty quick. We ordered the “Melton’s Rice” and the “Picada Tarzan”. The rice was delicious and everything on the “Picada Tarzan” was too. We also got the “Seeds of passion” cocktail which iand a sangria ( my boyfriend said it was too sweet). The service was always great, the waiter was super nice and attentive."
        }
    ],
    "reviews_count": 82
}