{
    "name": "969 NYC Coffee",
    "place_id": "ChIJpVgwCalfwokREU6kmsyAqG8",
    "grid": "QN3",
    "address": "37-61 80th St, Jackson Heights, NY 11372, USA",
    "rating": 4.6,
    "user_ratings_total": 491,
    "phone_number": "(646) 203-7304",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WM1QxZE5ORU5PZG1reWRYZ3pSVk5tZUcxWGFuYxAB",
            "text": "The owner (?) older Japanese man does not seem to like that he is running a restaurant/store. This place requires cash for any purchase under $15 but I had the most odd experience with him.\n\nI asked him what the difference between their matcha latte vs. tea is and he refused to answer -- he expected me to know. When I said I wanted the tea and the shrimp tempura onigiri he told me that I needed to pay in cash, I did not have any so I went searching for an ATM but could not get the cash. So I came back and ordered a bunch of additional things including some crab/shrimp chips with lots of chemical additives (I find out later) and matcha pudding (which is decent), but he does not give me the onigiri and when I mention that he insists that I did not order it and he won't ring it up because they just do not ring up multiple orders separately.\n\nHe also was just rude -- he would say things under his breath, really quickly and when I asked what he said he said that I am slow and I am not \"there.\" Very odd. My friend who also went with me had a similar experience. The guy just does not want to work there. He was like to me -- have you been to other parts of the world? They're not like people in New York. ??? Okay, thank you. Idk just very odd and unpleasant treatment!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xObmJsSlBUa0Z4TFhCTFlXTnhVemhqU21wb1pFRRAB",
            "text": "very sweet people! and the sushi sandwiches are amazing"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xveGRXRkNYekpKUm5GSGJHaGxSVUUyVkdGNVNsRRAB",
            "text": "The food was good. I got the chicken ongiri sandwich, Moshi white peach soda and a latte. The sandwich was good and the white peach soda was one of the best sodas that I've ever had. I also got a latte which was good. The service was ok. I came for the Ramen noodle soup, but I came too early. (I think he said 11am is when they start serving it). The ongiri sandwich flavors were chicken, beef, eel, calamari, salmon and shrimp. The picture outside the store also show an okra one but I didn't see it in the store. There is outside seating."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOTVpURnZVbFJxTVhkb2JHTmpXbWxLVUhkdk5FRRAB",
            "text": "So fresh, so delicious, honestly at hidden gem! Glad I stumbled upon. Order ahead to avoid waiting, as everything sells out quick."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKcVZHUXpWMGRJTFVkeldsZzBlR1YwTldSdmFYYxAB",
            "text": "If i recommend 1 serve. I recommend shrimp I really love it cheap and healthy in $8"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwb09GbFdSVTFrTUVwd1h6RlpZVVpZVG5wVlluYxAB",
            "text": "Amazing spot with delicious rice and seaweed sandos. The coffee is really good and the owner is one of the kindest people ever.\nSit outside and ask for the spicy sauce, enjoy the experience"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWTVdXUTFhMUpvWlZGd1RIRnROVTl1ZDJSTUxYYxAB",
            "text": "I was only traveling to NYC, but I still made sure to grab Oda-san’s sandwich on my way to the airport. I almost risked missing my plane, but I felt compelled to do it. That probably tells you enough about the aura and the food quality of this tiny coffee shop.\n\nWith that being said, I totally understand the negative reviews about Oda-san’s attitude—that’s basically how I first started talking to him. I told him he should treat me nicer, because I hadn’t done anything wrong and didn’t deserve to be yelled at. But in the end, I realized that’s just his style, with no ill intent at all. Think of him as a rigid but kind-hearted, straightforward sensei with a poker face—or a grumpy master you’d see in an anime. Don’t take it personally.\n\nI don’t think you are monitoring the reviews 大田さん, but ーー　グミをくれてありがとう！また来年！"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5aVgzUnNjVXRWYmtrMlRtVXdRVmh5WlhsQ1dtYxAB",
            "text": "This incident happened when I was in high school, so it was a while ago, but I came in the morning before a volunteering gig to get something for lunch. When I walked in, there wasn't a menu, so I asked for one. The owner was very rude to me, calling me entitled and essentially an American-born Chinese. He told me to just figure out what I want and show him, so I searched up the name of the place and just gave him a picture of something akin to katsu onigiri. Then he went on a rant while I waited for my food. I'm not local to Elmhurst, so I didn't really say anything back. There was one other person in the store at the time, and the owner was friendly to him, so my experience may be isolated one. The food was fine."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25od01HVkpNRm96U2w5VE1ETkpXbGhMVVhkdlFVRRAB",
            "text": "sweet owner"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsd01qZGxaMkZSVlRaVVRqbDFNMDlXVFcxT1VYYxAB",
            "text": "This place is nice and has Japanese food here."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1eWMzSmtXVTlMYWpseGRqUm9XSFpzVkdKVldFRRAB",
            "text": "Got the fish onigirazu and mango vegetable onigirazu. So tasty!! Owner was a super chill dude. If you plan to go late afternoon, I recommend calling first since some sandwiches tend to sell out."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4ZlJ5MUpla1ZQWjNSQmFVTnlPV0pvWW1SdFVIYxAB",
            "text": "the owner is super rude in general and tried to scam me by charging me for an iced latte when I ordered an iced coffee.…"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21VNVkwWTVSMlpXTWxsTWQzQkRVRTVzVkRKVFZWRRAB",
            "text": "When I simply asked if the salmon was grilled today he said to shop somewhere else. I’m not sure why he got immediately triggered."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSS2R6ZGthbTFxV0VSMFQwRllOamhFUkVaWlRVRRAB",
            "text": "I had the chicken rice sandwich – really good. There wasn’t a lot of rice, which I loved because it let the other ingredients shine. The chicken was very crunchy and paired well with the avocado, cabbage, lettuce, carrots, and cheese. I also added their house sauce on top – so good.\n\nI would recommend getting here early since they run out of items fast, and there’s usually a wait. I believe the owner is working alone, so he’s handling everything himself, which is a lot. If you don’t mind waiting upwards of 30 minutes, definitely give it a chance – the food is great.\n\nI’d give it an 8.5."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214SmFtTkRiV3BrUjBkR05HcHBiV2d0YzJSUWRtYxAB",
            "text": "I’ve been here several times, and the food has always been good. But I think the owner has an interesting personality. This was the first time I came during the lunch rush, so maybe he acts differently when he’s busy? There was a large group waiting there— I think because the owner was still making rice. But the group mentioned I could still order anything ready-made at the counter, so  I decided to do that.\n\nThe owner called up another customer before me, and as he was ringing it up, he told me to « sit down if you need so much time to think ». I was like « oh! I’m ready to order though ☺️».  And he looked at the customer he was ringing up, scoffed/laughed, like « oh nooow she’s ready » and said « I don’t get why people take so long to order.. just read it for a few minutes and decide » and the customer laughed??? And I was like « I’ve been ready, but I was waiting for you to finish ringing him up…???? » but the owner just kept joking around with the customer about it..\n\nI get that he may have a quirky sense of humor, but it would’ve been less embarrassing if he had teased me directly instead of right in front of me to someone else. It was so bizarre and unnecessary."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIdG9uSS13RRAB",
            "text": "great food, the owner is super polite. great prices"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSM05IQmxZaTFHU2xKQmNYWnhaMnRsUTJWbGVYYxAB",
            "text": "Great tasting matcha latte"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toMFZuUjBVR2MwUTFwc1ZYQk1lSFZQY0VsRVJGRRAB",
            "text": "Don’t come here if you have a food allergy because he’ll just tell you that he doesn’t know because he buys his ingredients from outside...\n\nHow do you not know what the sandwiches have or do not have if you’re the one buying the ingredients and making them??? How hard is it to say yes or no?\n\nI don’t think he likes it when you ask simple questions."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNZbExHeklBEAE",
            "text": "Great place for quick bites. If they don't have what you're looking for and you're not in a rush, the owner can make it on the spot (service can take a while depending on how busy Oda is). Haven't been disappointed in any of their onigiri offerings, and my wife and I have tried a majority of them. Definitely a grab and go place though since seating is limited."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ReWNXRk1TVE01YjBoUVFUQlhkV1V3TTAxTE5GRRAB",
            "text": "Best onigiri I've ever had!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWRlZpMVJWalF0UW1KQ2JWUkpia1pKVmkxdFNsRRAB",
            "text": "In the vibrant heart of Jackson Heights, 969 NYC Coffee is a delightful spot that truly stands out. Their unique and incredibly satisfying onigiri sandwiches are a must-try! Whether you're a local or just passing through, this cafe promises a memorable experience for your taste buds. I personally loved the chicken cutlet rice sandwich and the matcha avocado shake."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvc3NlZkxnEAE",
            "text": "Food is wonderful, the wait not so much. You can taste the love in the food but I wouldn’t go if I was starving and hangry, the wait is long. They have a good selection of options though, on a day I have time I would definitely return."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VQX3Mzb2V2d01QQ1BBEAE",
            "text": "Owner had the most demeaning and disgusting attitude. I called to ask if they still had the fried oyster sandwich in stock, as I heard online that they sell out quick. Owner proceeds to call me stupid and say I talk too much. I’ve been once before and the restaurant was extremely dirty inside and they added carrots which I asked him not to add as I am allergic. Just skip all together."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMZUxtYjNUZzVLeFVnEAE",
            "text": "The one and only authentic experience in Jackson Heights!   Thanks Oda!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZd29Qc0tnEAE",
            "text": "Good food but it was affordable for quick bite snack but the shop keep increasing money biweekly .. the onigiri was 2-2.50 $ when i first went but it keep increasing its price up to 4$ + .. and quantity is same or less"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURveWFUUnhBRRAB",
            "text": "Came in towards the end of the say and thought I was going to get scraps. The owner said he only had soft shell crab remaining for his onigirasu, and I'm glad I had it because it was delicious. Nice, crunchy and flavorful soft shell crab. Well seasoned rice. The owner is very sweet. Will be coming back soon."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJbzYzWm9RRRAB",
            "text": "I come here every time I happen to pass by and the food is great. Tea is really, really good, too. I find it very relaxing to sit outside or inside. I am never disappointed. I have come in a couple times and there was no food yet, like I might have come in too early, so watch out for that. I keep early hours so this is hardly the only place I have run into this problem. In fact I just ran into it at a bakery just today.  There is another reviewer saying there's no food menu. Umm, that's because they sell onigiri, sandwiches, candy, and ramen, all of which is clearly visible at the front counter. I don't think there is a menu because it's all right there. There is a sign saying they have ramen, the end. Everything else is on display. I don't understand the confusion with this place, that is not the first time I've heard of a customer just not get what was going on. Another time I watched some lady came in and she assumed a waiter was going to come out and serve her. It's bizarre. It's a cafe with sandwiches at the front, and possibly ramen if you order it, that's it. I don't think it's fair to have people who have literal comprehension problems to rate this place. But the place is very cute so maybe people think it's more complicated than that?"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJa3ZMZE5REAE",
            "text": "tldr the food is really good. since it’s just the one guy it takes quite a bit of time which is fine, but he doesn’t have a menu and when busy won’t really ask for what you want so you might end up having to pay for something you didn’t exactly order, and if you question him he will hold your sandwich that you waited so long for hostage 😂 he also charged me $2 more than the first time, and since there’s no menu I couldn’t really say anything lol i have a slight aversion to avocados, the first time i ordered the onigiri sandwich there wasn’t any on it, this time around there was ( and since he didn’t really take my order besides asking which protein I wanted - and with no menu) it was too late to do anything once I realized. I decided to just deal with it but definitely not ideal"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRaDgzTUN3EAE",
            "text": "In my honest opinion, it's OK.\n\nThe Instagram algorithm tipped me onto this place since it's nearby one of the Blink gyms I frequent, so I figured, why not?\n\nThe place is small, felt packed with a number of people here, so the place does get good business. I left unsure of what I wanted to order because there was no menu for food, only coffee and tea, which I had no appetite for at the time. They didn't even have Iced Tea, just a few drinks kinda close to it. I had an idea for a sandwich but didn't know what they had because once again, the place had no food menu, so I just went with the Chicken Teriyaki onigiri. The onigiri itself is good but felt too light, it did not really fill me up at all, maybe I could've ordered something bigger but the place was already packed with customers and I didn't want to wait on more food so I just settled with it and an apple and grape fusion soda with no sugar. The drink...wasn't terrible, but I wouldn't want it again anytime soon.\n\nThis place may be a hit with others but, it just wasn't it for me. Nothing bad about that, not everything is gonna be a home run and it's not even a knock on Japanese food as a while because I'm a fan of their style of food. It ISN'T for me for lack of better words. I wish this place the best of business, not sure if I'd return here but they'll be fine without me."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRdnF1OHFBRRAB",
            "text": "The food was beyond what I expected and the chef is the sweetest."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnenFIdHRRRRAB",
            "text": "Nice guy! Great affordable food, loved it 🔅…"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnc3QzXzV3RRAB",
            "text": "Ordered the Chicken Katsu, Fried Fish, and Shrimp Onigirazus (sandwiches) and as a Japanese (Queens native) I 100% co-sign. The balance of ingredients and rice to filling ratio is perfect. All the veggies still have a fresh crunch. The owner was super friendly and helpful. I would suggest ordering ahead to skip the wait, which chef prefers. This place is such a gem in the neighborhood. Reminds me of the many Japanese spots that used to litter Queens when I was a kid."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnMHZMWDdBRRAB",
            "text": "Hands down, amazing food. Ordered the pork ramen, and a cappuccino. My mom ordered a honey lemon ginger tea, also very delicious. And the teriyaki rice ball. Would definitely recommend more people check this place out. Variety of healthy food. The pork was extremely flavorful and lots of veggies like lettuce, bamboo shoots, scallions, and half egg. Pasta was excellent too."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBazhpYXp3RRAB",
            "text": "This cafe is a true gem! The coffee is good, but the sandwiches are outstanding: simple, delicious, and skillfully made. The salmon sandwich is my favorite."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfOG8yM3RnRRAB",
            "text": "Best oat milk latte!! Great food as well and sweetest owner. One of my favorite places to go"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2emZyZVVBEAE",
            "text": "The place is lovely. The owner is super nice! I love that the seaweed rice sandwich and Onikiri was fresh made. You must also try the Matcha Latte, it is the best in town!!!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2NjhtdlFnEAE",
            "text": "So friendly & fast. LOVE the Lemon Ginger Tea!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2MHAtTDJRRRAB",
            "text": "Took a risk on trying the fried oyster onigiri sandwich, and it was one of the best things I have ever eaten. Still thinking about it years later!!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2cVBXam93RRAB",
            "text": "Small spot with tasty Onigiri. I walk there when I want to get a quick bite to eat."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQMzgySlF3EAE",
            "text": "Everything is great here, the owner is very friendly and the shrimp sandwich is unbeliveably tasty. It is better to telephone ahead of time you are looking to come in and pick up a sandwich."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4aThqT1lBEAE",
            "text": "Love this place so much. There are a lot of great   Japanese snacks here. They have drinks, sweet, and some pretty good onigri and coffee. I wanted to get one of the famous sandwiches, but by the time I came they were already out. Instead, I got a chicken teriyaki onigri. The onigri was good, and came at a good price too. The heart shaped are very cute"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQdnRQc3hBRRAB",
            "text": "Very delicious onigiri! So far I had tried the fried pork and the shrimp one and it’s so delicious!!!! Would definitely go visit again."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQdnBQaWFnEAE",
            "text": "If you like rice balls and japanese sandwiches, the onigiri and onigirazu are so good! My kids love the chicken teriyaki and salmon and I am a fan of the spicy chicken.  The owner is great, friendly and accommodating. He always insist on making rice balls for the kids fresh if they are out at the counter. There is a small assortment of Japanese treats, from lychee gummies to mochi ice cream.  This is my go to place to go with my son and daughter when we are in a time crunch. The rice balls are reasonably priced and I feel good knowing they are eating real food instead of fast food."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzMTltZk1nEAE",
            "text": "A personal fave neighborhood spot for onigiri and other lighter fare. Good for healthy, quick and filling lunch. Also, IMO, may have the best cortado coffee in the area."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYaFpuQWFnEAE",
            "text": "Great sandwhiches and Japanese snacks!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYMklDeFZREAE",
            "text": "Hidden mom & pop spot that makes really good sushi rice sandwiches. A bit pricey for the amount of food but 100% worth it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYMi1xZldnEAE",
            "text": "All I can say is that the sandwiches are fantastic and yes I'll wait 30 minutes for one since they are that good. The owner is very nice and great service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNudWVPa2F3EAE",
            "text": "love this place!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIbmRYUkxREAE",
            "text": "Hopefully, the manager can hire someone steady to help out.  He's the only one there, so when a group comes in to make a big order, service can stop for like 20 minutes or more."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIbU9qWkJREAE",
            "text": "Only got coffee and green tea (both awesome) but the ownership and vibe of this place is instantly iconic\nThe owner is a comedian, and the place is very cute!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6dzdhMlF3EAE",
            "text": "So good! Sushi sandwich with panko fish! The rice was even slightly warm when I had that sandwich!\n\nAbout the place. Cozy and friendly atmosphere, like at beloved home. They have cute patio. I enjoyed this place a lot. I already planned when I’ll come back.\n\nGentleman at the counter was obliging, friendly and witty.\n\nThank you good luck"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKX1B6MjZ3RRAB",
            "text": "The owner was very nice and the service was quick. The prices were reasonable for NYC.\n\nPersonally I didn’t love the taste of any of the things I had. The matcha latte was a bit grainy for me.\n\nThe fillings in the onigiri were a bit too small with the rice tasting a bit too hard/old.\n\nThe chicken cutlet had a weird taste.\n\nThe shrimp sandwich was much better and tasted fresh. But very flavorless.\n\nThe Shrimp and rice was the best dish. Was almost identical to like an Indian shrimp curry."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOenJubGlRRRAB",
            "text": "Nice neighborhood feel: very friendly and welcoming staff who know some of the customers by first name. The onigiri taste extremely fresh and high quality. I loved the beef sandwich, the spicy chicken onigiri as well as the soft shell crab. Spicy sauce is a must. Love this place"
        },
        {
            "date": "3년 전",
            "language": "ja",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtdk9HTFFREAE",
            "text": "ビーフスキヤキおにぎらず $8\n具沢山でボリュームたっぷり、味もとても美味しくて、これで$8 かなり良心的価格だと感じました。\n\nお店の雰囲気的に、オーナーさんは日本人ではなさそうな…？でも味は完全に日本、とても美味しいのでおすすめです。"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNndnVHWDN3RRAB",
            "text": "The owner, Oda-san, is super nice and the food is delicious and authentically Japanese. Everything is also at a fair price. The tonkotsu ramen is delicious and reminds me of the ramen I ate in Japan. He also serves heart shaped onigiri and…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEMWJ6bDhRRRAB",
            "text": "My husband picked up three sandwiches to go: we had the chicken cutlet, soft shell crab and beef sandwich. They were all so delicious. We also had the avocado matcha shake which was very tasty. Prices are incredible. It gets very busy, and it is worth the wait. 😊"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURob3AzQ2hBRRAB",
            "text": "Love coming here on my way to work. The owner is super kind and there’s always good food there. I tried the soft shell crab and it was super good. Definitely will be back. There is a 15$ card minimum just so you know! So definitely paying cash will be your best bet if you want to save on money."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHd0pmT1N3EAE",
            "text": "Luckily I was able to make it before the owner took the last order at 5:30pm on Sunday. The Spicy Shrimp Sandwich was very tasty. It came with avocado, carrots and lettuce. The shrimp was battered and fried. The portion of the rice was perfect, not overwhelming at all. The owner seems a very nice and kind person, donating all the tips from customers."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURpa2J1d2Z3EAE",
            "text": "I am a big fan of onigiri, but I never knew that I could get it right in jackson heights! I will definitely be stopping by again. This is a great, authentic Japanese cafe with very affordable prices and some unique menu items, such as their…"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXeXV6OWZBEAE",
            "text": "Amazing Japanese food! Real authentic Japanese experience! The owner is super friendly, very accommodating and loves to smile. Every dish is made with love. Def one of my favorites!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURVdHREOTNBRRAB",
            "text": "Small places that make a difference and change our customs forever, that's what I felt when I first entered 969 NYC coffee.  You want to try something you have never tried, but you surely know (like sushi) you must enter here and order the…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGcUotY3BBRRAB",
            "text": "A restaurant I found on the way to the library. In New York, I experienced a restaurant that felt like a Japanese street restaurant. Japanese restaurants in New York are expensive. However, this place offers full flavor at a low price like a Japanese university cafeteria. Although the space is small, I would recommend it. It is a healthy and sufficient meal at an affordable price."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCc3EyNktnEAE",
            "text": "This restaurant is truly one of kind and it is a missed opportunity to visit Jackson Heights without stopping by this cafe! The owner is very kind and prepares quite a few vegetarian friendly onigiris—even though they are not formally listed on the menu. My favorite is the onigiri with cucumber, okra, seaweed, lettuce and mango. It is a great combination of sweet, savory, and salty! Please be patient if you have a special request because the owner is typically the only person working and he prepares everything fresh, so it is definitely worth the wait!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBMVB6alRBEAE",
            "text": "I discovered this hidden gem on Instagram and was surprised this shop is located in Queens. I’ve came here a lot and  have tried the matcha latte, ramen, beef sukiyaki, chicken sandwich, pork sandwich, salmon onigiri,almost everything on…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGNDdMS0pnEAE",
            "text": "969 NYC Coffee is an adorable Japanese cafe that serves authentic onigirazu, onigiris and other items. The owner is very attentive and treats his customers well. He made sure my matcha latte was perfect and to my liking. I was worried about the Corn corquette not being vegetarian but he assured me that everything was vegetarian. The corn croquette onigirazu is really good and savory."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1MThUTjJRRRAB",
            "text": "Really yummy sushi sandwiches/rice buns however you like to call them. I visited the shop in the morning around 9 am and got the oyster one which is so flavorful, fresh, crunchy and yummy. The owner is very kind and friendly. I ate half and got very full. So the whole plastic box includes two servings.\n\nConsidering the flavor, ingredients and the price it is a very good find.\n\nIt is a small and clean shop with both indoor (around 5 seats with the wall table and stools) and outdoor sitting (about 3-4 tables). They serve beverages like coffee and mocha. The morning starts with rice buns/sushi rice “sandwiches” while ramen starts at 11 am. I will come back and try the ranmen. I recommend this nice place to whoever loves good food."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKMzV6UldnEAE",
            "text": "Great snack. Sharing a chicken cutlet seaweed sandwich is fun, it smells good inside like a sushi on rice seaweed salad smell."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnd09DbTB3RRAB",
            "text": "The owner is so friendly and really cares for his customers and the quality of his products. I've tried the chicken and beef sandwiches and immediately came back for more. The iced coffee was great as well. I will most definitely be coming back soon."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwbDV6c1FREAE",
            "text": "Owner is so friendly and sweet! Onigirazu is full of flavor and is well put together. Definitely coming back. I would call ahead and order so they are able to make it fresh."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKcjlMdDV3RRAB",
            "text": "One of the best iced matcha lattes and jasmine tea I’ve ever had! It’s obvious that they were prepared the right way.\nRice sandwiches are really good, specially the beef one."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRbGJfeDVRRRAB",
            "text": "Sweet little neighborhood Anamoly in Jackson heights right off of Roosevelt ave   We really enjoyed chatting the the chef/owner and tried a few things including the adorable heart shaped onigiri basically a sushi roll in a slightly different format and with less nori (seaweed wrapper).  We like the spicy crab filing and since most of the assorted flavors  are ready to pickup for 2.50 each we will be trying various flavors next time.\nHe showed me the tonkatsu \"sandwich\" and when he opened the box the delicious smell promoted me to buy one to eat later.  We were on a Jackson heights \"food safari\" searching for street tacos and had already had various snack items.  It was tasty and even better when we doused a bit more sauce (soy vey teriyaki) on it.  My one comment so far is that I'd like the rice to have more seasoning or have some ginger  wasabi or such on the side to add more punch."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWcDluXzJRRRAB",
            "text": "Unbelievable sandwiches for $8, enough to fill you up with a full stomach and mind. Best matcha latte i ever had. Yuzu drink is only $3, latte is $4. They do prefer cash as sometimes the card machine isn’t working."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXd0xxenBBRRAB",
            "text": "Hospitable and cozy with Japanese chips and snacks available. Coffee is super good and the onigiri is beautiful but needed a bit more of the filling. The entire place smelled like fried rice, otherwise would've given 5/5"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURheWNLU3VBRRAB",
            "text": "The owner is such a delight, serving up one of a kind and authentic Japanese delights! Had a delicious vegetarian sandwich. Highly recommended!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCazRIWjd3RRAB",
            "text": "My son & I love this cute place! We normally get onigiri & milk tea cans! There are a lot of different Japanese options to choose from, and drink selections too. The onigiri has always tasted delicious and fresh! I love how they are made in the shape of a heart, and come in different flavors! We love the spicy crab, salmon and teriyaki onigiri. This is my go to spot for them. The owner is also so nice, patient, and helpful! He has free covid tests available for anyone who wants one. I definitely recommend this spot; it's a hidden gem of Jackson Heights!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4bThhWUx3EAE",
            "text": "The reviews are true. Tried the pork and beef sandwiches and they were both amazing. Very tasty sandwiches and good service. Def will be back. Thank you!"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBMlBES0tREAE",
            "text": "Owner is great! Good coffee, tasty ramen, and a super casual atmosphere make this place a hidden gem and the slight distance from the 7 train make this place quieter than most Roosevelt Ave. eateries. Definitely coming back."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPNTllVEN3EAE",
            "text": "A true Jackson Heights gem run by the friendliest owner. He gets a little overwhelmed on the weekends, but if you happen to visit during off-peak hours, he'll be more than happy to treat you to a delightful array of off-the-menu specials.…"
        }
    ],
    "reviews_count": 78
}