{
    "name": "Jackson Hole",
    "place_id": "ChIJPx2YHHJfwokRI4X9I7mD-Zw",
    "grid": "QN3",
    "address": "69-35 Astoria Blvd N, East Elmhurst, NY 11370, USA",
    "rating": 4.5,
    "user_ratings_total": 4512,
    "phone_number": "(718) 204-7070",
    "reviews": [
        {
            "date": "11시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214NGJVWm5Ra2t4WDFoQ2NVVTBiVmhZWTBKMFIxRRAB",
            "text": "The only thing they are missing here is having any music from Ronnie, James Dio, that screams the 80s."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Ka1lUSlZaWGxqU1hBeVJGbEhXbFY1VUdJM1ZGRRAB",
            "text": "I had two cups of coffee and the Jackson Hole milkshake with chocolate ice cream. It was fire. Goodfellas was and is a timeless classic."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tScFJsSjNXV1IwUTJNeFNsTjJiMlp0YW5wVVoyYxAB",
            "text": "One of the very few classic diners left in NY. An awesome experience is guaranteed!!!"
        },
        {
            "date": "수정일: 6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCaUo2aWRBEAE",
            "text": "I just love the place and have for years. It's a nostalgic atmosphere with very good diner food. Their breakfast all day is even better on Sundays. Burgers are big and often with friends, one deluxe and one burger only is plenty unless you want your own fries.  It is cash only, so be prepared."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4TmJtZGpOalZXZVZScVFWUTBlakpmUTFGck5FRRAB",
            "text": "The Best burgers around"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSeVgwMXlORzlaZDNWS2NVZHFVa2hwVlhwQ1VtYxAB",
            "text": "Busy NYC diner. Super charming. Great staff. Solid diner food. I come by anytime I have an excuse to be in the area."
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWeUoySXJnRRAB",
            "text": "The food is unbeliveable awsome, and the service is very good and the atmosphere inside is nice with the music"
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyMVk2Q0h3EAE",
            "text": "Good food and service. We were a little bummed that they don't accept credit cards, and charge for soft drink refills."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KVVQwaFRaREU0TUZOdk1sTmxaVk5wVlhBMGVVRRAB",
            "text": "Good food. Good prices.\nSpecially if you’re getting off the plane and looking for a good meal. This is the place.\nThey offer a wide variety of comfort food and they have good service, the place takes you to good old times and everything is clean and organized."
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNZbjctZGRREAE",
            "text": "Place has gone downhill.  Went many time these past few years and I rated it 5 stars. Now, 6 years after I rated it 5 stars I've changed it to 2 stars. It was bad the last 2 times I went and tonight was the worst. All our burgers were too well done, we ordered medium. SWEET POTATOE Fries were burnt. ONION RINGS were totally burnt and with old oil burnt bits on them.  I could go on but it won't matter. Don't forget...cash only. And you can't understand the bill. It looked like a doctor's prescription."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGR01ucFZiRXBZTTFKYU1uZHdMWEZFYVhsMFNsRRAB",
            "text": "Great food and an awesome vintage atmosphere!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25BMU5tUnVRMmxzTTNWS1VWZFlValpJTjJJNVkyYxAB",
            "text": "Outstanding"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214blZUTmZjM2xMV1hoclVGVTFVSFpmVGpkM2RsRRAB",
            "text": "Service was horrible and so was the food. The almond delight smoothie was hot and watery and their milkshakes are also warm. It took them 30 min for us to put in our order and by the time the food came out our drinks were done. Their burgers were horrible. I ordered a western burger which had sautéed onions stacked that the buns were so soggy the burger broke apart in pieces. Fries were cold as well. Probably the worse burger I ever had in my life. I will never return. I should have known because I ordered from Uber eats once and I thought it was disgusting but said to myself let me give them another try because things go wrong a lot with uber eats. But nope it was not uber eats. It’s the diner!"
        },
        {
            "date": "3주 전",
            "language": "pt",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oblNIY3hNVXBRUVhwMWFVZFpaemxWTFVjd1lrRRAB",
            "text": "Gostei bastante, o atendimento é ótimo, comida boa (eu não gostei do frango empanado), ambiente agradável e nostálgico. Mas, o que mais eu gosto é do café e do suco de laranja inigualável !!!\nEu não poderia deixar de comentar sobre a playlist impecável !! 🎶🎼🎵\nJá é a minha segunda visita ao local em 10 dias, e voltarei mais vezes com certeza.\nAh, uma dica importante: PAGAMENTO EM DINHEIRO, MAS NÃO SE PREOCUPE EXISTE UM CAIXA ELETRÔNICO EXCLUSIVO PARA OS CLIENTES."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1VGRETjViakJmVVVkYWJqbHdVRTVwUkZBeVlVRRAB",
            "text": "Burger was very good, waitress was nice, and juke box was cool! But…. make sure you get everything you ordered, if not make sure you check the prices to ensure you didn’t get charged for any add-on items you did not receive."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214Zk5HRnNObXR0WVZSVmRpMUhjVzU2YkZWVlkwRRAB",
            "text": "My all time favorite diner in New York. Not the easiest to get to via public transit but worth it for me. It reminds me of going to diners with my family growing up and the staff is always very friendly. I like to get a booth and bring a quarter for the juke box which actually works and has oldies, goodies and newies. For food you got your basics. Im a fan of the tuna melt. But really i come here to journal and have some tea :)"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xUlUyeEhOWE4xZW5sbWFUZzFkbGhKYTJOT2NrRRAB",
            "text": "I rated this place a 3 in food because the first visit I had the omelette which was pretty good, but this 2nd visit the nachos were not the best. The service I received felt very rushed , so I rated that a 2. When I asked for a copy of my receipt I  had to wait for a photo copy to be made. What place doesn’t have a customer copy for the receipt ? They don’t accept any payment by card, so I had to go to their ATM, their cash register looks like the one they had in the show happy days which aired back in 1974. It’s  2025 and technology has evolved  so much where multiple options should be available for Payment. I rated the atmosphere a 1, because the place could really use a make over.  Bottom line the place gives very outdated, or maybe that’s the vibe."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kb2MyRkRkVGR2TVZWT1VVYzFUbUZOWjFSdFJWRRAB",
            "text": "For some reason the burgers are now smaller"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkNWRGOURObEJMU0VKdU1tODNXak5PYjA5WGRuYxAB",
            "text": "Terrible place what happened!! The device was horrible the food was terrible and no one cared warning stay away !!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205SkxYZDZabFk0UVVJM1oya3hTME41V1c1WVFWRRAB",
            "text": "Had the most disgusting burger, all food was cold and French fries saggy and grease.\nAlso horrible service."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnekpTRE53EAE",
            "text": "Eat there a lot.  Great mixture of customers. Breakfast,  lunch, or dinner all day long.  The French toast with fruit was the bomb.   Their rice pudding is the best."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psemVHWlBSMVI0TUVsaWNsaEtOemxwWjFGUGJGRRAB",
            "text": "I was in the mood for chicken wings, so I decided to come here. I was very disappointed that the chicken wings were very fatty. .really bad!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psUU9FMDRTMDVWUjE5M2FFUmtYelYxYkZwcVozYxAB",
            "text": "Service was great. Friendly staff. Food was a bit overly sweet and oily, but to be expected from a diner. I loved the atmosphere. Very Americana. It felt like walking into the past."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tRMGNFbEZNWFJZTFhaTmNXVjJObGxpUjFSWVQyYxAB",
            "text": "Disgusting. Burger was bland, no seasoning, and taste like a kid smashed the ground beef creating a bizarrely thick patty. Potato skins were awful. Who puts red onions on them? Uber Eats won’t discount or reimburse for this. Nasty."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsNWMwaHhXVXhrY1ZSQ1duaFpWMHBzU1VSTGJtYxAB",
            "text": "Very nice place has the old times vibe. Very highly recommend"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxQk4yWmtaRloyZG5SSWRUUkZRVmxFVTNwTVdVRRAB",
            "text": "Great big burger, hot tasty fries, pickled cucumbers with great lemonade in the heart of Queens"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKU1NrbFhRV2RuWlZWZlZYTmpNbXh1TFcxVmJXYxAB",
            "text": "I have always loved going to the Jackson hole in Manhattan,  this location did not meet expectations,  the service was slow, we had to ask for napkins 4 times.they got our orders wrong,  they forgot stuff and they took forever to take our orders then to check us out for us to find out in the end they take cash only?? Will not be back to this location."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ONlkxRnlWMmhYT0ZVdFFWTnhSbkJKVW5WSlUzYxAB",
            "text": "I meeeeaaan....what can I say about this absolutely legendary landmark....?  If you're a film nerd like me, come check this place out.  Not only is it neat to see a place where a scene in Goodfellas was filmed, but the staff was so welcoming, courteous, and friendly, the service was fast, and the food was delicious!  Thank you!!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tNeVJsTjVTbTFvTWpNeE56azNaalkzU1ZGc1RFRRAB",
            "text": "Great food but our waitress had the personalitie of a wet rag. Not unattentive. We had a male waiter come and take care of us at the end. Lots of parking! Near LGA airport 🛫 right off the Pkwy."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNZdmNHYWFBEAE",
            "text": "This place is, particularly this location is the best diner in the city. Great brunch specials. Love the healthy croissant! Other favorites include the Benedict specials, they also have really great healthy options for breakfast. Not boring Diner ones. They have the diner Classics but they are not bland and boring. They're fresh the way diners used to be."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WcFgyMUZTM3BuYjE5NlVGOTJjbHBwV2pKNmJFRRAB",
            "text": "Love this Place und milk Shakes are great 🙏💛"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQwLWRDTGpRRRAB",
            "text": "Great food and friendly service"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aWk9GTjZabkYzUzJrNU5WQlVSVTEwWTAxRVFVRRAB",
            "text": "I have been here a few times before and the food/service was good. This time around, the service was horrible and I was underwhelmed with the food to the say the least. Especially the flimsy bacon. Our server Mercedes, was very rude. I ordered French fries as I always do, however when my plate came, I was served home fries. I politely mentioned it to her. She took the plate and brought it to the kitchen and told the cook who was a few feet away from where we were seated and said in Spanish “ no me lo pidio” which translates to “ he didn’t ask for it”. Of course she assumed that we didn’t speak Spanish either. When Mercedes came back with my order, because I heard what she said in Spanish, I responded “ actually, I did ask for them.”  She said very rudely “no you didn’t because I would have wrote it down. But you got them now, so…” She gave me a nasty smirk and walked away. She then went on to talk about the situation  with her co workers right behind us.  When we\nrequested to speak to the manager , he was barely of any help. He tried to justify her actions by simply saying “ it was a misunderstanding.”  He barely showed any empathy to us and as someone who is a manger and works in customer service I was deeply disturbed by how he handled the situation. I will not be returning and I will let my friends know who go to this diner to stop supporting this business as well."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tFMVpsUlBjM05WVGxCT2RIbFNRVzFIVjE5VFozYxAB",
            "text": "If you're looking for true american experience, that's the place. Jackson Hole offers true vintage diner nostalgia alongside with delicious cuisine and very friendly staff."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxWGVsSkJURUU0TkUxRGJteEJNMVptYjBaSU9WRRAB",
            "text": "Burgers 🍔 are outstanding."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205cGNtVkRiV1Z3VVRSRU4yTjFkM1ZLY0dORVlrRRAB",
            "text": "The bread was stale, the burger was over cooked and was not seasoned with salt and pepper. Burger was served without a pickle or onion. I would never go back or recommend this place."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SQlVESXlkMUZGZGtVMU5scHJXbm8xV0RKcmJsRRAB",
            "text": "Still going strong!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pNMWRqZE9lak4zTjNWNU5YcG9iMVpIYkRCbFVWRRAB",
            "text": "The food (we had omelets, home fries, muffins, coffee) was excellent and the retro vibe is fun. 50s and 60s music, no commercials. Service is friendly, on point. And the restrooms are clean! Prices reasonable too (for NYC). A favorite."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WWlVYaHpabWhoVWxsVlRWcDNTR3QwTTNOb05WRRAB",
            "text": "Deservedly iconic burger joint. The food is much better than it would ever need to be for a place so obviously dripping with charm to last as long as it has (like half a century!), but it really is quite good. Childhood memories of this place have imparted upon me a lifelong preference for big, bursting, structurally unsound burgers, while more recent visits confirm that it gets by on more than just nostalgia. Come in person and bring quarters."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KQ01IUklYelJmUVdwd1IzcGlNbk53YjJwYVUzYxAB",
            "text": "Super good wow!! Loved the chicken and waffles. Can’t wait to keep trying the menu items. Last time I had a burger… asked for it medium but was overcooked. I’d suggest asking for it on a lesser term than desired."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OQmIwTmxhV2RvZFZwNVlqbE1NSEl3TFRBNVYwRRAB",
            "text": "We highly recommend this establishment, particularly for their pancakes. The customer service is excellent."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zM2FtaGpaRlpvVjA5RGEzQjFNbE0zTVVoV1kzYxAB",
            "text": "Fui por recomendación de las hamburguesas y definitivamente todo estuvo excelente, gracias Ana por tu atención, la comida rápida, buen servicio definitivamente volvería"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jMVVsZEtWMTh4ZDNGdGJUZElVbG8xTUZSRlQxRRAB",
            "text": "A fun spot to stop and eat, usually busy and more fun to eat inside with the jukeboxes and decor. A great variety of food as well. Recommend the orange juice."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kNlkwYzJSalE0UWs0NU5XSkJVRnB2TVZkMWJuYxAB",
            "text": "It's gets crowded and the space is tight but the food is good, plentiful and it's very family friendly."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taTVRWWnlkVkl5ZDFOTGNGbGhjMnhrT1VGbGVHYxAB",
            "text": "Dope period"
        },
        {
            "date": "8년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBNDVUdGNnEAE",
            "text": "Good👍👍👍👍👍…"
        },
        {
            "date": "3달 전",
            "language": "pl",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCWmIyMUZkVU0xTFdKNmRVUlhjRGhzUzBWUVVsRRAB",
            "text": "Bycie w tej restauracji to swoisty „Back to the Future”. Tego właśnie szukałem będąc poraz pierwszy w USA. I właśnie w Nowym Yorku w pięknym Queens zaleźliśmy tę prawdziwą perełkę. Klimat cudownych lat przełomu 50-tych i 60-tych. Wszytko pieczołowicie dopieszczone, każdy szczegół, każdy detal. Totalny American dream jaki zawsze widziano w filmach i amerykańskiej kulturze. To miejsce powinno być na liście Must See jeśli zwiedzasz NYC, a nie tylko Manhattan. Dla fanów takich kultowych miejsc jest to miejsce w którym\nnie tylko można dobrze zjeść i wypić pyszne\npiwo czy shake. To miejsce które zapamięta się do końca życia. Pozdrawiam gorąco szefa lokalu, który pokazał mi cały lokal, mówił o jego historii, które było planem filmu Goodfellas/Chłopcy z ferajny oraz gościło wielu polityków, polityków i celebrytów.\nPiękne miejsce.\nUwielbiam Was! I jak to mówią w USA: „Good bless” this place."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2swNVIxaEVNVEpIUTFkclRXZFBSMHB0WkhkbVlWRRAB",
            "text": "Visiting New York and came across this place. If you want a very large and good burger and fry, this is a must stop. My picture doesn’t do its size any justice. Fries were typical steak fries. I wanted to try one of their milkshakes, but was just too full after the burger to get one. Place was busy but service was fabulous. We give a high recommendation for this place."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKMlJDMVJNMm95ZGt0bk5XcFVURGh1ZW1WUGFtYxAB",
            "text": "We had a great breakfast here. Our eggs were cooked perfectly. Everything came out hot. Good coffee. Our waiter was excellent, as well as the rest of the staff. Great location with parking. Believe the diner scene was filmed here. Looking forward to our next visit."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tVMlNuWllVamR3ZDJWc1pEZ3pTMWhDTVRKUmMwRRAB",
            "text": "This place has been here for years. I used to come here when I was little. It's a great dinner with amazing music, personal jukebox, friendly staff. There are a lot of new staff learning the ropes I love see this place grow. The food was very good, well seasoned and served hot and fresh. Their sauces are homemade (blue cheese, ranch and marinara sauce). The place got pretty crowded."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wdVh6ZHJObll3ZDNKT1R6VklaM0ZyZVU5ak9YYxAB",
            "text": "Enormous servings. Not sure how they call it a 7oz burger. It's huge and delicious.  Great pickles for the table and a short wait to get your meal. The only problem is the traffic in the area. If it's out of the way ,it's going to be a hour and half add to your trip. Make sure you are not in a rush if your stopping."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWWVVEQXpZakJqYTFkaVVHUjVTVXRVVEUxNVQyYxAB",
            "text": "Been here a few times and food is pretty good. It’s always packed in here and the space is small so would not recommend more than 4 people (2 is best given the booths are tight too). Service is a bit slow but it’s got an old school charm… jukeboxes, diner counter seating, old school rock and roll music, old hot rods models, Coca-Cola and Betty Boop, and other vintage artifacts.\n\nFun quirks so we keep coming back! Indoor and outdoor seating is nice.\n\nFood: Consistently a 4/5. Standard options and enough diversity for anyone. Not the most exotic, nothing crazy fancy, and not huge portion sizes but solid and consistent every time. We stick with the breakfast options and they’re great. Would skip on the smoothies and egg creams.\n\nService: 2/5 most days. Predictably they usually get some part of our order wrong and it takes a while for the food to come out. They have a lot of workers but the space is so small so everyone’s jumping on top of each other. For how packed it gets it makes sense the service pace suffers a bit.\n\nBut if you’re not trying to get in and out, and you don’t usually do complicated orders with ‘add this, remove that’ then this is no problem at all. It’s an old school diner and this part keeps the charm alive."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VPalJ3cFdnZ2ZyWE9REAE",
            "text": "I haven’t been to this place in over 10 years. The guy who took my order was still there when I first went years ago. It brought back so many memories. But it seems nothing had changed. The decor was the same with its vintage decor which is so cool. I ordered a New York Burger that comes with American cheese, lettuce, tomatoes and mayo, but what is a burger without bacon, so I added that. I thought the burgers were bigger years ago, but the burger was still  juicy and tasty!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xM1UxVnlUSFEwTUZsbGQwMWtjSEJ1YTFSa01VRRAB",
            "text": "Talk about a blast from the past! I hadn't been to Jackson Hole since the mid-80s, and it's incredible how the decor has remained untouched, both inside and out. Even better, the burgers are still out of this world. I was in serious need of a cheeseburger and milkshake fix before heading back to New Jersey, and this was the perfect stop. My craving was completely satisfied. Thank you, Jackson Hole, for staying true to yourselves!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xUlQxOVFPVTlxYTNrMk1uTXpjMUI0WlVwQk9IYxAB",
            "text": "~Comfort Food, Good Ol Day~\nI love to come here for comfort food- good for the soul. Home fries are chunky and delicious. Tuna salad is fresh and flavorful. Italian omelette and Mexican dish are well prepared. Love how they use old school heavy plates to serve food. 1950's retro vibes-shiny chrome trim, formica countertops, vinyl booths, jukebox."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQTFR0YVBQMk9qaU9nEAE",
            "text": "Haven't been here in years and this is still the best burger around.  I had the Soul Burger medium well it was huge, but juicy and delicious.\nIt's cash only and the parking is limited, but it's worth it 😋👌"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBX2NxYkJBEAE",
            "text": "Burgers were really good. So we're the milkshakes. The space is cramped but the ambiance makes it worth it. Like stepping back into time. We loved it. Waiter was also nice and attentive and didn't have to wait to long for a 2 person table."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOdjZ1cXl6dDZMeXp3RRAB",
            "text": "I have been visiting this place every weekend with my family or friends, and I genuinely recommend it. This diner is exceptional, the service is outstanding, and the aesthetics truly speak for themselves."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaclp6SnJWM0J0TVdaYU0ySjJRazlrVEVKdFQxRRAB",
            "text": "Jackson hole has been our family restaurant for over 30 yrs . That diner feel and the food is unmatched."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBcnIzZXhRRRAB",
            "text": "I have been going to Jackson Hole Astoria on and off for the past 13 years and i keep loving the vibe and the food from the pancakes to the burgers. The freshly squeezed Orange Juice is something i order all the time and i am a big Betty Boop fan. Waffle fries are so so good!\n\nCash only!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPdTNoNno3eFpEcHFBRRAB",
            "text": "I enjoyed the food here, came 2 days in a row.. One day for breakfast the next day for lunch.. The burger has way to much meat, but thats me being picky.. The chicken and waffles is good.. Also, this place is super loud at ALL times.. Couldnt hear myself think.. But, yea I enjoyed my time there.. Maybe Ill be back.. Maybe I wont.."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQbWRLTmh3RRAB",
            "text": "This place is AMAZING!\n\nThe service was impeccable. I never ran out of coffee as someone was always there to freshen it up.\n\nMy Royal Eggs Benedict was perfect in size, temperature, and flavour. The grilled potatoes were devine.\n\nMy daughter's burger was massive in comparison to most places, and they served it with STEAK FRIES. She was in heaven. The chocolate milkshake was real ice cream and topped with actual whipped cream.\n\nThe decor takes you back to the 1950s. It was perfection."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRdV9la0lREAE",
            "text": "I love this spot. Is cozy, super cool looking ( 50’s vibes ) and great service. We ordered the New york burger and it was huge and super tasty, but that Orange Creamsicle Milkshake was the highlight. Totally recommend."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twRWNuWTFhbEJHY0RNNVpGRnFSMjVTTWtkVlpuYxAB",
            "text": "this was a great stop on the way to lga with my family. food was delicious and the serving sizes generous. definitely recommend the shakes, the pickles, and the chicken sandwiches"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKX1R6YWJMN29xUEpnEAE",
            "text": "It’s like going back in time!! I wish there were more restaurants like this. The hamburgers and the french fries were tremendous real meat, real delicious and real huge.  All and you have to try the chili the chili is so good.  😊"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3bDhYV3l3RRAB",
            "text": "Warning!!! Come hungry.\nThe portions are caveman big.\nOld school retro style diner, the food is as fresh as it gets. They’ve hired a small army to run this place as efficiently as possible.\nThere’s usually a line to get in , and an even longer line of prefer going out the door.\nGreat and friendly staff, many delicious options to choose from.  You won’t be disappointed."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqdTRIeXVnRRAB",
            "text": "I wasn’t too thrilled when they said we’d have breakfast at a diner. Well, my mind has changed. Jackson Hole in Astoria has the best customer service ever! I was delighted with the knowledge of our server. He pleased each one of us! My experience here erases the bad impression that I had of diners! I’m so happy to have come with the group and their food is delicious 😋"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLQ1gtc2JyOTlyUDN3RRAB",
            "text": "I have been to a lot of restaurants in my life. However, this is the best burger joint not only in New York but America! Thank you Jackson Hole for a wonderful experience as always!"
        },
        {
            "date": "1년 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqdVAtVERBEAE",
            "text": "Cena del 02/01/2024.\nAvevo già mangiato da Jackson Hole nel 2015 nella sede di Bayside (ora chiusa), e da allora ho sempre sognato di tornare qui per mangiare di nuovo il loro straordinario hamburger. Per me quello di Jackson Hole è il più buono del mondo:  grande, saporito, succulento, lo adoro!! Da provare assolutamente anche il chili con sopra una grattata di cheddar, una delizia. E poi l'ambiente: questo è il vero diner americano!! Se venite negli USA è qui che dovete assolutamente mangiare almeno una volta. Siete grandi!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ab2EzSktlREprUkUxZmJHaHhiRFZ3ZWtGQ1ZXYxAB",
            "text": "Honestly the very best salads, eggs and dollar pancakes and a wonderful pick-me-up atmosphere!  Nothing to lose: try it!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkcjhudVJBEAE",
            "text": "Decided to finally try this diner after driving by it for over 10 years, best decision ever! I absolutely loved everything about this establishment, the service was outstanding, the food was delicious and super fresh, and the overall vibe of the place was just super chilled and so retro! Loved it! I definitely felt like I was taking place in one of those old 80s movies, I will definitely be returning. By the way, the homemade pickles were so good!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMbTVlRm5BRRAB",
            "text": "Outstanding place to eat, been passing by this place for yrs, and Everytime I would say I got to go into this place, they are always packed, well wifey n I finally did just that, and it was a great experience. Inside is like going back to the 60s and 70s , they have mini juke boxes at every table so you can play music 😎😎😎.\nThe menus have a lot of food items, great selection of drinks, milkshakes etc.\nIt is very clean inside, and they also have dining outside as well if that's what you prefer. The waitresses are all very attentive and helpful, they actually work as a crew, so you are never wanting or waiting for anything.\nThe food is cooked perfectly and very tasty, and that had to be the best milkshake I have ever had, I thoroughly enjoyed every aspect of our visit, and will definitely be going back, if your visiting or you live here, I highly recommend that you stop by and grab a bite to eat."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqaE1fNHRBRRAB",
            "text": "It was my first time. Love the old timey decor. The oldies music was awesome. I went with my friend to eat dinner after planting trees for earth day. She had a strawberry milkshake and an Italian omelette. I had a hot chocolate float that I've never seen anywhere before, so good. I want to take my son's here."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3LXJ1MUhREAE",
            "text": "This diner is super cute! The brioche breakfast sandwich was delicious! The orange tastes like it was fresh squeezed. Love the place, the staff, the food! Definitely coming back next time in New York!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6bXRyZ2RREAE",
            "text": "After driving by for so many years my brother and I decided to stop and have breakfast/brunch. Food was good, I enjoyed the waffles with fruit, the pancakes, especially the freshly squeezed orange juice. Will return to try the other items in the menu.  Service was good, someone was always around when needed"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6dzZ5eG5BRRAB",
            "text": "Meet friends who live in Queens before flying back to Florida.  Looked for a place for brunch near LGA.\n\nGreat choice for brunch. I tried the Italian Omelet with sausage, mushrooms, fried onions, marinara sauce and mozzarella.  Served with home fries and toast. Great choice.\n\nMy wife is a big fan of Fried Chicken & Waffles , waffle served with 4 pieces of fried chicken and homemade honey maple barbecue sauce. Served with butter and syrup.\nShe loved it.\n\nDefinitely returning when in the area."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmM2FEWmx3RRAB",
            "text": "Don't let the unconventional location (a container next to the highway) fool you - the food at Jackson Hole is top-notch! We had an excellent experience and would highly recommend it. Plus, it's conveniently located near LaGuardia Airport. Don't miss out on this unexpected delight."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQMVBIWV93RRAB",
            "text": "Jackson Hole in Astoria is a traditional-style diner that feels straight out of Pulp Fiction. The retro decor is beautiful, and the food lives up to the setting.\n\nThe burgers are huge and flavorful, and the sweet potato fries are outstanding. The staff are friendly and provide great service.\n\nA must-visit spot for anyone who loves classic diner vibes and exceptional food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5NnJHd3lRRRAB",
            "text": "Always a great experience here. Three different burgers, and the vegetarian quesadillas for dinner. Whatever you want on a burger or a grilled chicken breast, they've got it! So many options to choose from, you will never leave hungry. We will be back to try out the omelet options. Great service, chill place, thanks for another great dinner. 👍🏻"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3MUtQSFJREAE",
            "text": "Went here for dinner, cute ambiance and nice server, but the frites were cold and clearly sitting out for too long, and the burger patty was tasteless."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNocllQRDRnRRAB",
            "text": "So much fooood!!!!! This was the first time for my two youngest kids (in their 20s). Prepare to feast on an abundance of mouthwatering dishes at this food haven! Even though my two youngest kids, in their 20s, were forewarned about the generous portions, they devoured the meals like two famished individuals. The shakes, in particular, won their hearts, along with the flavorful home fries. Service was top-notch, with kind, attentive, and efficient staff members. However, the popularity of this place means it can get quite busy, so I encourage everyone to practice kindness and patience amidst the hustle and bustle."
        }
    ],
    "reviews_count": 81
}