{
    "name": "Addictive Wine and Tapas",
    "place_id": "ChIJTfMamaNfwokReCB_ScV0xNA",
    "grid": "QN3",
    "address": "32-64 87th St, Queens, NY 11369, USA",
    "rating": 4.7,
    "user_ratings_total": 432,
    "phone_number": "(718) 899-8666",
    "reviews": [
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRbXJDbVBBEAE",
            "text": "[Sadly the restaurant portion of this establishment has been permanently closed.  which is a real shame since the restaurant side of this establishment was really special]\n\nMy wife and I honeymooned in Spain and always love to come back here for that feeling of being back in alhambra, enjoying great wine and delicious tapas.\n\nAlso it's connected to a wine store too so the wine you get on the restaurant side is always excellent. In fact everybody here is so knowledgeable about wine and so friendly to talk to you'll come away with a greater appreciation of it if you don't already have it.\n\nHighly recommend for a romantic evening with somebody special."
        },
        {
            "date": "8달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURncmU3eXVRRRAB",
            "text": "Super recomendado para disfrutar de un buen vino,la comida es deliciosa y la atención ni se diga."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfMzRibGdnRRAB",
            "text": "Sat. 1/24/25 first visit. Emmanuel the Chef and Francisco were very friendly attentive and welcoming. I loved the rustic look of the restaurant it was super cozy,  but a bit small. With either this being said, the Food, Service, Decoration. Ambience, Music was excellent! I do plan  to visit the Manhattan location on W 46 between 5&6 because I heard wonderful comments. . I will return and recommend this restaurant. Thank you Francisco for the love and passion you have for your customers, wine, and services. Mattie and Lee"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzeDVHT2FREAE",
            "text": "Such a hidden gem in Queens! There is a wonderful selection of wines and delicious menu of tapas. The decor is cute and we felt so cozy, comfortable, and welcomed. You can tell the owners put a lot of thought and love into every detail of this place. Highly recommended especially if you are looking for a chill night with friends. Would also make a nice date spot."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYMVBHc3JBRRAB",
            "text": "Tiene mucha viaria dad de vinos y tasting también"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3NjRyVlN3EAE",
            "text": "Fantastic find in Jackson Heights, NY.  The manager, Alex, was the best - incredibly personable, knowledgeable and hands on.  We thoroughly enjoyed the menu selection, both tapas and wine.  Very generous servings, delicious and relaxed atmosphere.  And only a mile from LGA. We will definitely return!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyMy1xU2dnRRAB",
            "text": "Excellent cute tapas spot in Jackson Heights. Fabulous service. Fantastic tapas options. Went there for a birthday and they were so gracious with a sweet treat for the birthday person. They have happy hour which I hope to enjoy at some point as well. Highly recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6MGRHMmpnRRAB",
            "text": "A small hole in the wall that really caught me off guard!  Order the chicken and cheese."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqMll1M29nRRAB",
            "text": "My first visit & I loved it. Cute, small place with excellent food. The gf & I shared patatas bravas, avocado salad, & tuna, & I had a flight of 3 white wines. Plus crema catalana for dessert. We will go back & try everything! Francisco is so welcoming. Very special place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqd0kzTXlnRRAB",
            "text": "What a beautiful restaurant and winery in a residential, safe, and walkable neighborhood in Jackson Heights. We found easy parking across the street. The winery was intimate and tastefully decorated with a huge selection of different wines - rose, whites, reds - from different places in the world. What a rare gem! We had a great tasting and left with a delicious of bottle of rose.\n\nWe then had delicious tapas, wine, dessert, and Spanish soda in the restaurant next door. Patrick and Francisco were beyond friendly and treated us like family. The tapas were so artfully plated and individually so special. Everything so perfectly seasoned - not too heavy, not too salty - perfect with wine pairings. We wish we had bigger stomachs to try everything! We also just loved seeing how so many people were regulars here, this is a testament to how excellent the service is here and the consistent quality. There is also an outdoor patio that felt very cozy, and I can’t to check it out next time. We will definitely be back to try the rest of the menu. They also have a Manhattan location that we want to check out. Such a cool, cozy, intimate vibe from a neighborhood jewel. We had the greatest time here, and you bet that we will back!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5aV9hWGtBRRAB",
            "text": "Es mi lugar favorito!! La experiencia es espectacular, todos son súper amables te hacen sentir en casa, la atención es impecable, tienen muy buenas sugerencias sobre los vinos que además son excelentes. los aperitivos y la comida muy bien seleccionada, diferentes sabores que son un deleite al paladar,  es un lugar que además de ser muy acogedor y lindo se siente mucha paz y tranquilidad 100% recomendado felicitaciones!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKX2ZLTXB3RRAB",
            "text": "We went here on our first date. The atmosphere is really cute....wood material and wine casks, warm and romantic and homey. Service personable and really friendly. I am on a keto diet and my friend doesn't eat fish so we had avocado salad, meatballs, and shared a filet mignon. We had sangria and Malbec. Everything was perfect. I have been to a LOT of wine bars in NYC over the years on a LOT of first dates and this was the best. It was just so chill and friendly and the food was amazing.  Together with drinks, tax and tip we spent about 92. So for NYC it's very reasonable given the quality. Highly recommend this place. Will definitely be back! p.s. Also they have a sister restaurant (same name) in Midtown Manhattan."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKdFlXeXVBRRAB",
            "text": "It was our first time,we enjoyed it very much.We will return."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKbFozeE1REAE",
            "text": "Too expensive for a tapas bar, no tablecloth, paper napkin, glass of wine way too expensive"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4MzhQU21RRRAB",
            "text": "great place to eat"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4d3NuQ2R3EAE",
            "text": "Lo visite con una persona especial y excelente 👌 servicio, precios justos y lugar muy elegante , los vinos 🍷 de lo mejor y las tablas de quesos y carnés super exquisitos,  muy bien decorados. Muchas gracias."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4eF9xcDR3RRAB",
            "text": "La mejor comida que he provado en mucho tiempo 👌…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSLW8yTU5BEAE",
            "text": "Fantstic all the way around...best filet mignon I've ever tasted!!"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoOV9HWjZnRRAB",
            "text": "Súper nice"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNocDhtcHNBRRAB",
            "text": "Wow! This spot gave me a delicious and authentic experience. The waiters were so sweet and had so much knowledge-they answered every single question I had. I suggest getting the meat plate and the sauv blanc . What a combo! I’m coming back with my girlfriends😋"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoNHFQX2dRRRAB",
            "text": "I love this place. Great wine selection. Knowledgeable, friendly,  and professional staff. And great tapas. Love the ambiance. The owners are wonderful, talented, and kind."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCMDU2Y2xRRRAB",
            "text": "Real Tapas !!!\nYou can feel the fresh olives.\nGood options of wines,"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCMDlpT2NREAE",
            "text": "Excellent customer service and delicious food. I ordered the mushrooms ceviche and the salmon with vegetables. Everything was fresh and flavorful. The owner was friendly and inviting and the decor was modern and stylish. For dessert I tried the tiramisu and the figs and cheese which I enjoyed. Would definitely go there again!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCamViNHFRRRAB",
            "text": "Cool staff, good service and ambient. Loved it and will come back!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCamZESGpnRRAB",
            "text": "Francisco your hospitality was 10 star ! Tapas are all amazing. Wine pairing was simplified with Francisco expertise.  I will definitely be back with a group ❤️"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCamZDMFRnEAE",
            "text": "Good food. great atmosphere, amazing service. Great wine selection for pairing..\nWill definitely come back"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCbnBDeHNnRRAB",
            "text": "This is a jewel restaurant in the northern blvd! Its a gorgeous and cozy wine bar.  The food is excellent and the service is absolutely fantastic 👏 👌 😀 🙌 👍 😊…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCNUpfMjN3RRAB",
            "text": "A very tasteful, relaxing wine bar with great food pairing options. Full of ambiance and always friendly staff."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtNm9HTVBnEAE",
            "text": "Great ambiance. The decors are done in taste. Food is great also, but on the high side."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlbVpITzhnRRAB",
            "text": "Delicious tapas, good wine and excellent service 😋…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlcE5DTDl3RRAB",
            "text": "I went here because of the rave reviews. These photos show what the cheese and meat platter has no cheese. The calamari was sparse with jar sauce. Big wine selection.  Craft beer are all bottled no taps. Our waiter left the restaurant to get coffee and didn't return to take our entrée orders."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlbnU2dGNREAE",
            "text": "Just went for a celebration with 14 friend. The tapas and wine selection is so good. We had one of each and were not disappointed. So excited to go back again soon."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlekxxQ1dREAE",
            "text": "I love this place for food and superb service. I have read that parking was terrible but since we went on a weekday and early evening,  we didn't have a hard time.  We enjoyed all the tapas we ordered but the highlight of our dinner was the service.  It was a busy weekday and service was impeccable. I can only have drinks with little alcohol.  After few tries of ordering drinks which unfortunately they don't have,  the bartender was kind enough to open a whole bottle of moscato for me just for me to have a glass of it.  The moscato was so good.  I really appreciate the kind gestures of both the server  and bartender .  They don't have too,  but they went above and beyond to make our dinner a wonderful experience.  For sure,  we will be back.."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlbE11OGtnRRAB",
            "text": "My wife and I had our 10 year anniversary dinner here.  Food was amazing. Our server Matt made it an great experience.  We will definitely be coming back! Travis and Pauline,  Sunnyside."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlcElqdmh3RRAB",
            "text": "We went there on a Saturday and went back the next day for a Flamenco performance they had. We absolutely fell in love with this place. Staff is very attentive and friendly. Great aura. Great attitude. Really good food. Very private and personal setting."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlZ0tIRmN3EAE",
            "text": "Delicious food, wine and atmosphere!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1bF9LNDV3RRAB",
            "text": "Wonderful place, delicious food...."
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPdGQtTXdBRRAB",
            "text": "Buen lugar para compartir con amigos y familia. Valor alto"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPaHVfVHdnRRAB",
            "text": "Wanted to step out for tapas and found this gem. Great wine, had 9 or 10 hot  tapas and all were outstanding.  Atmosphere was great. Service exceptional.  In my opinion a can't miss."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPZ3ZhYkZ3EAE",
            "text": "Great service, good food, great wine. Appreciate the sections of outdoor seating with ventilation and heating."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPN1lfampnRRAB",
            "text": "Amazing service and order to visit"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPcnAzVW5BRRAB",
            "text": "Awesome place in Jackson Heights. Good food and wine! Highly recommended"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPOHN1d0NnEAE",
            "text": "Fabulous place!! Great food, great service, a wonderful experience!! I highly recommend this restaurant in Queens!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMydnBQWVB3EAE",
            "text": "Great atmosphere and service, tapas were even better. Highly recommend for a slow pace date or even for a glass of wine alone!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXZzVpYVR3EAE",
            "text": "One of my favorite places ever. The perfect date night spot. The perfect conversation spot. The perfect reconnect with an old friend spot. The perfect spot. It's so cute inside and the service is always wonderful."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXMGZhbEtREAE",
            "text": "The interior design is excellent, which is no surprise given that the owner is an interior designer. We had the meat and cheese board. We also had a variety of tapas. The tartar de atun and the pimientos al piquillo were tasty. We also had the semi-sweet Georgian wine. Very nice."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXdHNlUkFREAE",
            "text": "We loved their takeout menu and specials for holidays (Thanksgiving, Christmas, etc). The quality of the food was great and tasteful. However, recently I ordered some cheese and Jamon Iberico plates via online apps and the quality really…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXMnVxSVBnEAE",
            "text": "Love this place. I had the meat and cheese board with a bottle of red wine and it was so delicious. I'm definitely going to be a regular"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtNV9fRGd3RRAB",
            "text": "Great service, food and decor will definitely go back 🍷🍷…"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhN2JpT2FnEAE",
            "text": "The environment is excellent, reminds me of Portugal and Spain based on its interior ambiance. The food was somewhat salty, and made it difficult to enjoy. The service was ok as the staff was busy chatting with each other or were busy on…"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxd2RXWnF3RRAB",
            "text": "I came to dinner with my boyfriend and we really enjoyed the ambiance, the staff was super attentive as well! The food was all very tasty, we ordered multiple items on the menu and had the tasting flight, it was all amazing! I highly recommend visiting!!"
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURRMy1tWXhnRRAB",
            "text": "Great place! Fabulous ambiance, great food and super friendly staff! The only thing I could suggest is to have some coffee for after the meal. I will definitely be back."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhNV9fYm1RRRAB",
            "text": "Delicious tapas dinner and a great, well-curated wine list. The food was outstanding. Atmosphere is lovely as well, though my one small suggestion would be to turn down the music a little."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLdHZiT1JnEAE",
            "text": "Came here with a friend. We enjoyed their outdoor set up! It is so beautiful! Their indoor decor is very nice as well. The indoor is full of wine bottles. The indoor ambiance with the music made me feel like I was in Spain. We had their…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVci1mSVF3EAE",
            "text": "Came here for a special night for me and my wife and was highly impressed with the entire experience, from the demeanor and professionalism of the host and servers, to the dark and intimate ambiance and quiet, Spanish-tinged music, to the menu itself.  Tapas were smallish but exquisitely designed, prepared in full view behind the bar in the main room.  I was hesitant at forst, but that wore off quickly because of the ease of interaction with our server. Everything, from wine choosing to tapas selections to dessert, was first-rate.  This a true gem in Jackson Heights.  Absolutely recommended.  We plan to revisit.\n\nOne caveat: do not go expecting to drink sangrias, because this is a true wine-centered experience, although there is a selection of beers available as well.  Apart from that, go and enjoy.  A perfect date spot. Looking forward to meeting the owners on our next visit!"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBMG92Z093EAE",
            "text": "Relaxing and lovely atmosphere, friendly and attentive service, plus a wonderful selection of wines. Enjoyed the best creme brulee and a delicious chardonnay."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQwaE1DQ3dnRRAB",
            "text": "Food, service and decor are outstanding. Attention to detail is on point."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQwemM3bTRRRRAB",
            "text": "Loved the place, it was kinda quiet but felt super cozy, service was attentive with a genuine smile from the time we opened the door all throughout the meal, music was on point, food was delish, wanted to order one of each Hahaha but wifey…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDaC1HX2RBEAE",
            "text": "Always a great place to go to. Delicious food and wine and great service! This picture is of the white wine flight, all tasted great and good portions too!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJMHV2bzZRRRAB",
            "text": "This is one of the best places to enjoy a glass of wine and you have to see the unique menu of this place you will love it... I'll be right back for more 😍🍷🥂🍾🍸🍹...…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ4bmVMUGF3EAE",
            "text": "Great and cozy restaurant (even if seating is currently outdoors). Great selection of hot and cold tapas, salad and wine. A must try in the neighborhood."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2eDZDeFRBEAE",
            "text": "Great evening of fabulous conversation, food and wine. The wine, service and food were fabulous. Highly recommend a visit if you are anywhere close to the area!!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDNDQyZHJRRRAB",
            "text": "Love our time here. Tspas are good and wine is even better! They did a great job with their outdoor dining area and servuce is great."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZOTdya0dnEAE",
            "text": "Highly recommend. Very cute ambience and great staff that were attentive and the food was great."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNTb09QeWxBRRAB",
            "text": "A hidden gem in the middle of Jackson Heights. Friendly staff, and the owner is a sommelier, which can help pair the perfect wine with what you choose to eat."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3X3BxZjdRRRAB",
            "text": "Loved the ambiance & decor! When first sat, I was surprised by the unique setup.  From the one of a kind ringed napkin roll ups to the elegant Bordeaux glasses, you can tell they did not cheap out on a single thing! The owner and servers…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3NUt5Q2pnRRAB",
            "text": "Ever since this place opened it has been a favorite of mine. It has brought back classiness and elegance to my neighborhood. Thank you Francisco for such a great addition! Tapas are so delicious and the wine list is to perfection. The…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURvMTR5V0tREAE",
            "text": "I love this place. Here you can drink high quality wine and eat delicious tapas. The decorations is great, which allows you to relax. I have been at this place several occasions in the evening. Wine by the bottle is better than by the…"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRcS1tYm1nRRAB",
            "text": "This is one of the best wine places in Queens. It's a jewel! The staff and the owners Francisco and Patrick are super friendly, always attentive, very wine savvy and the wine selection is exquisite. Even though it is rather small, it is…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBei1hamhBRRAB",
            "text": "Great food and Great Value.  I was surprised at the cost for what we had.  Two glasses of Champaign, Two glasses of wine and 4 Tapas for $99. The quality was also great.  Service was the only thing preventing 5 stars.  It wasn't bad but not…"
        },
        {
            "date": "4년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2dlpfQW53RRAB",
            "text": "Siempre es un placer visitar este lugar Francisco y Patrick los mejores las tapas exquisitas y los vinos magníficos muchas gracias por la atención"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNDbV8yaHdnRRAB",
            "text": "A nice place to enjoy some wine. I loved everything on their cheese and meat board. The staff is friendly and our waiter was very knowledgeable about different wines. Will go back but will stick to ordering wine and the cheese and meat board. Wasn’t a big fan of our calamar tapa."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNDcThLNnp3RRAB",
            "text": "A cute local spot! They take reservations, awesome customer service and personable staff, great wine recommendations and conveniently located. I've ordered a bottle of wine and the meat and cheese board (delicious!) both times I've been here .\n\nOnly knock one star off because both of these times I was unimpressed with the hot seafood tapas we ordered - (Pulpo and then calamari) I tried to like them but they were room temp and lacking in that \"wow factor\""
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJMmFQa0RnEAE",
            "text": "This place is a gem. The atmosphere is warm and inviting. The staff is incredible their tapas are very yummy. The whole team does an excellent job of making the experience incredible. Francisco is also one of the nicest most inviting people ever. If you get a chance stop by across the street. I honestly wish I went more often!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwb3NUTUh3EAE",
            "text": "This place is AMAZING!! Love the tapas, the ambiance, and the service was excellent! The owner provided us with great information about the tapas as well as their wine selection. I suffer from migraine headaches so I was recommended the best type of wine to drink for my condition. I was very pleased with the choice!!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzZ09LSkF3EAE",
            "text": "Intimate and very well designed. The place has an awesome vibe with a great wine selection. All of the tapas are great and you can sit here all night ordering more and more. The ambiance and decor is top notch, feels like being in a high end wine cellar."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5NS1hLWl3RRAB",
            "text": "The food and service was outstanding! 10 out of 10 will go again"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvanNub1BBEAE",
            "text": "Quiet atmosphere romantic place and very nice  good price and authentic Spanish tapas"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpNGNTSnlBRRAB",
            "text": "Love this place so much! Went there recently to dine outside with my partner for our anniversary. They still had the best service, food, and wines, plus they recently installed heating lamps to keep us toasty. I continue to recommend this place to any and everyone!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURzckxhVEhREAE",
            "text": "\"Wonderful\" sums it up in one word!! Food was yummy, wine was yummy, staff was fantastic! The sommilear was eager to help and his recommendations were perfection. Highly recommend this place for a romantic night out with the wine lover/s in your life."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURRaE52WE1REAE",
            "text": "What a beautiful space Patrick and Francisco have created. Hands down the classiest restaurant in Jackson Heights. Francisco runs the place with visible passion and care. Great ambiance, well-crafted wine list, interesting tapas menu, no…"
        }
    ],
    "reviews_count": 81
}