{
    "name": "Kumo Cafe",
    "place_id": "ChIJEWfat-dfwokR8Uvd0UcSd9A",
    "grid": "QN3",
    "address": "40-07 82nd St, Elmhurst, NY 11373, USA",
    "rating": 4.7,
    "user_ratings_total": 116,
    "phone_number": "(929) 767-3936",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pablVtbHJkVkl4Y3pWMGFHZGZiMUJEU1hKSGQyYxAB",
            "text": "I recently discovered this hidden gem in my neighborhood, and it’s quickly become my go-to study spot whenever I need to lock in. As you can see, I’ve even been doing my college apps here! The drinks and food are amazing—and the prices are refreshingly reasonable. They even have a drink card for regulars, which I love. Plus, it never gets too crowded, making it the perfect cozy and peaceful place to focus. Definitely recommend checking it out! ☕✨"
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5WVRHSmxXRWhTYldKaWNrbDZlbXRJZEU5QlRuYxAB",
            "text": "I had the Spinach Grilled Cheese Sandwich at Kumo Cafe, and wow ，it was absolutely amazing! The flavor was so unique and delicious, unlike anything I’ve tasted anywhere else. It’s the kind of sandwich that makes you stop mid-bite and say, “This is really good!”\n\nI highly recommend Kumo Cafe to anyone who loves great food and cozy vibes. I’ll definitely be coming back for more!"
        },
        {
            "date": "1주 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214SVJrUnlWMnREWTNoM1RtWldaREJSWVZwcGFFRRAB",
            "text": "Muy mala experiencia no se recomienda el lugar fuimos por unas crepas y la verdad que estaban como crudas con un olor desagradable. Demasiado a huevo🙂🙂"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSb2VqRkNMV2QxWHpJNE5tbFVkRk5ZYVVaclRHYxAB",
            "text": "Loved this spot! The ice cream was delicious, everything looked sparkling clean, and the whole place feels so warm and peaceful—perfect for cute talks and chill moments 🍦"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOcVluSlpRVVJvUlRBNVIyRjZSRGRIYVMxUE0zYxAB",
            "text": "Kumo cafe is literally my favorite place for bubble tea and breakfast. The decoration is nice, the staff are so kind and friendly. I ordered breakfast plate 3 with match strawberry popping boba latte. The garlic toasts are so delicious as well. My friends  ordered the smoked salmon openfaced sandwich and strawberry banana waffle which are so good. The place is so quiet and my favorite place to study and chill in jackson heights."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xb1ZIZHBSV0l6WTFSb2RXRmtkMmxZTjIxSldHYxAB",
            "text": "Super friendly staff ! This place is amazing\n\nIt's a hidden Gem !\n\nBest bubble teas sandwiches and ofc ice cream"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xRE1XaFBRM0I0YzFsR2NrMHllR1ZqYldKcWJVRRAB",
            "text": "My friend and I stopped by Kumo Cafe to kill some time and grab a bite before leaving NYC, and I’m honestly sad I couldn’t try more of their menu! They have an amazing selection of coffees, desserts, breakfast food, boba, and more. I ordered the Nutella almond pancakes and they were absolutely delicious, and the sesame latte was incredible. I also grabbed one of their mocktails to go and it was super refreshing! The staff was so friendly and welcoming, the cafe was spotless, and there’s plenty of seating—such a cozy spot to relax. Pricing is very reasonable, especially for New York. Highly recommend checking this place out!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WaGFFOXNNV3hWVkZSUGFVaGZjM3BmUmw5TVNIYxAB",
            "text": "I had such a great experience at Kumo Cafe in Elmhurst! I tried their strawberry cream cheese honeybread, and it was absolutely delicious – soft, fluffy, and perfectly balanced with sweetness. I also ordered the mango peach smoothie, which was refreshing, fruity, and not overly sweet – a perfect match with the honeybread.\n\nThe cafe has a cozy vibe, and it’s a nice spot to relax with friends or just enjoy a treat. The staff were friendly and welcoming, which made the visit even better. Definitely a place I’ll be coming back to whenever I’m in the neighborhood!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CalgydExVRVZtWm5ob2JEWmFZMlEyTFRGUVUzYxAB",
            "text": "Super nice and considerate staff and the Nutella Mocha was amazing 🤩\nThey also have a rewards card which makes it even better!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kTWJFdDBkakl5UmpreFExazVVWGhwVkhOd2QxRRAB",
            "text": "Mojito are really good"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SMk9EbFlRMEZHTFRkM2N6bHlYelEwT1hSUGJWRRAB",
            "text": "Staff is really nice. Boba and other drinks are so good! Nice presentation and they bring food out to you. Awesome place definitely recommend"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxSWVHazJjamR4VUdsRlpVVm5kRUYwYzB0UGNGRRAB",
            "text": "I absolutely love Kumo Cafe! It's inviting, incredibly clean, the staff is very friendly, and the food is fresh and delicious! Their bacon, egg and cheese on a bagel is the best in the area and far superior to Dunkin and others. But, they have so much to offer, including hot/iced coffee, sandwiches, ice cream, and more! Do yourself a favor and try Kumo Cafe!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WTVZqWnFOVTlMVjNSQ2VubERjRlozY0ZscGIxRRAB",
            "text": "Kumo cafe is a really good place to have dessert or brunch. I ordered mango snow ice which has ice cream and crunchy cookies on the top, also I ordered bubbles on the side, so tasty and enjoyed staying here with my friend. Definitely recommend and I will come back soon."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxeUxXRXpWVEkzZFVJd2MyaHRUSFJtWldwdmVGRRAB",
            "text": "It was so delicious and the owners are really nice! The inside also looks adorable. A great place to stop and have a refreshing bubble tea or ice cream. They also have food and other delicious things. Definitely give it a try"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkV09GSnZSM0pGUXpkeGNURjBabDgwV1hGdVYyYxAB",
            "text": "Me encanto! Todo delicioso y los detalles, presentacion, hermosoo!  Se ve que aman lo que hacen"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jeVNuRlZibmhwVkZnNGNGUldjMjFaVjAxZlUwRRAB",
            "text": "Amazing café!!! I love the atmosphere and the drinks&food was delicious. They have a cute staff that speaks Spanish and he is absolutely caring,so it’s very convenient for people that don’t speak English!I ordered the milk tea wrongly by Myself and he exchanged me with the right one,that is really very kind of him.Great staff with Great customer service!!Btw the grilled cheese is so good.I highly recommend you guys try it here!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCYVUzUlJNMGh3TFZWTGExQlRVRE0wTlVzMk1XYxAB",
            "text": "Amazing coffee shop!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GTE5qaE5jV1JIUWt4dGMzTkhaa3RuVm5sQmJtYxAB",
            "text": "Great asian cafe in the Jackson Heights area. Amazing quality drinks with alot of options. We had the ube brown sugar milk bubble tea, it was fantastic! Staff was friendly and super accommodating as well. This place also has a good amount of seating. Would highly reccomend this cafe to anybody who loves boba or asian styled cafe treats. This place is great :)"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oR1ZXSkJSbE5HTWxKdldqbHFRM0EzVG5oWVpYYxAB",
            "text": "Everything about this place is wonderful. I love this place 🫶 definitely going to favorites.The snow ice and pitaya peach slush are the best to gos for the summer🫶💖"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOU1RwN1BxbDVmZlNBEAE",
            "text": "Probably the best here, wide selection of coffee and breakfast with a huge menu. The macaroons are delicious i recommend the bacon egg and cheese on a croissant"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLQzV3dlRlNExQejlRRRAB",
            "text": "I’ve been obsessed with this place recently. They have so many options for food and drinks and I love the chill ambiance of this place! Prices are super reasonable as well. 10/10! Highly recommend, especially if you’re looking for something nutritious as they also have healthy options!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMN21qdUdyd1AyMFl3EAE",
            "text": "The snow ice mango is amazing !!!!! Delicious! Flavors are on point ! I had mine with orange sorbetto ! Wao ! I want to come back already !"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPSFh0ZF9QNGVTM19BRRAB",
            "text": "Had a white peach slushie it was very good I typically have slushies that if you suck out all the juice and all the stuff to the big pile of ice but this one went down very well very well blended and very nice staff"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPSDBfTXlwME5Qbm1RRRAB",
            "text": "Great food! I got the meatball sub and my girlfriend got the open faced sandwhich with avacado, egg and smoked salmon. Paid 44 for both with a frappe and an iced coffee. That's with the tip. It was worth it the portions were big, everything was fresh and delicious. The frappe was as good if not better than Starbucks."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJSHk2Ykd5NHFtVFNnEAE",
            "text": "I got a Lotus Cookie Latte and it was a 10/10 !\nThey had ice cream, refreshers and bakery sweets such as cake slices and macarons."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJZVQyb0N2NU43MFdnEAE",
            "text": "Love this place! The food at Kumo Cafe is very delicious!! Everything I’ve tried so far has been a hit. Definitely coming back!!!!🤩"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMeWMxZGlzNnVDRVJnEAE",
            "text": "I ordered a customize bagel, it's delicious with their special sauce, the refresher was great as well！！ Highly recommended, there are a lot of food options now! Definitely come back for something else!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJM0x5WXpJNmFHU2xnRRAB",
            "text": "Echoing the experiences of another reviewer here, I was previously a huge fan of Sugarcube the cafe that was previously here.\n\nI was bit underwhelmed when I tried Kumo, especially as a frequent customer of the older store, Sugarcube. The drink that I ordered -- the Brown Sugar Milk Tea was a bit expensive and way too sugary compared to Sugarcube's. I think I also paid for like 2 dollars more than what I was used to.\n\nI understand that this is a small business, but for boba in the 7.59 or so dollar range for a large (8+ if you want milk alternative) I'd expect quality similar to Heytea. If you look at Kung Fu Tea's and Sugarcube's pricing you can definitely see it's definitely cheaper.\n\nAll I'm saying is that I felt like I was getting charged more so for the vibes and nice interior rather than for quality. I will admit that the service was friendly though, so that was a plus. I did feel a bit uncomfortable to see the infamous tip screen -- especially after I just paid for my 8 dollar boba.\n\nI was also concerned seeing powder flavors on the shelf. I do understand that they use real fruit as well in some of their drinks, but that's just something I observed.\n\nAnyways, while I wanted to genuinely support a new store, especially as an Asian American, I'm a little disappointed in what got replaced. I really hope that you guys price accordingly and focus on the quality of the food more rather than just the aesthetics.\n-------------------------------\nEDIT: Edited the review to sound less harsh. I still encourage customers to check out the store for themselves."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZOU5DNDRBRRAB",
            "text": "It was quiet when I went there, but the owner was very nice and the shaved ice was yummy as well. I got the thai iced tea shaved ice and it came with a lot of toppings. I would like to try the boba toast next time."
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZcUtUSWxBRRAB",
            "text": "Super linda la chica, muy buena atención"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvcjdfLXN3RRAB",
            "text": "Very special SNOW ICE !!! Never had something like this before, totally surprised me! Will try more flavors next time. Great service and great environment."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvdDR5amlBRRAB",
            "text": "The coffee is amazing and service is also great. The seating could use a little work but all the cute artwork makes up for it."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJejd6bnZBRRAB",
            "text": "The bacon, eggs, cheese and avocado sandwich was great! Also tried their red velvet latte which was sweet and good!"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3ZzlULTNBRRAB",
            "text": "The Honey Bread is so good. The Service is amazing and the staff is kind and patient!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3bzZmQ3JBRRAB",
            "text": "Mango Bingsu was amazing. I’ve only tried it one other time and it was a lot sweeter than this version. It seemed healthier, but at the same time, sweet enough and filling.\n\nThe service was amazing. A very nice woman served us. They also gave us a free gift because they recently opened.\n\nThey have no sign on the front window, so we had trouble finding it. Otherwise, everything was great."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3dHI3VDlRRRAB",
            "text": "everything is great. love it"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3aU5ES3pBRRAB",
            "text": "Everything is good here. Love their macarons, bubble tea, and ice cream. Very friendly service."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3OFlIczl3RRAB",
            "text": "Just found this new store on my way to work and ordered a breakfast sandwich and a vanilla latte which surprised awesome!! The coffee was very tasty 😋 and the smoked salmon avocado sandwich was very fresh. The environment in the store is also very good, but unfortunately I don't have extra time today. I will definitely come back to try other products."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHMWUybElREAE",
            "text": "TLDR: SugarCube has been replaced by an entirely different business focused on being an artsy café rather than a bubble tea shop\n\nI had previously enjoyed SugarCube at this location and was looking forward to seeing their renovations when I visited this week. The space looks nice with its updated design and new name, but I was surprised to discover the tea menu has been significantly reduced. What was once pages of diverse bubble tea options is now just a small section with a handful of tea offerings.\nThe focus has shifted to a café concept featuring breakfast foods and coffee. When I asked about SugarCube drinks, I learned this is actually a completely different business with no connection to SugarCube. It's worth noting that although this is an entirely new business, they appear to be benefiting from SugarCube's previous ratings and reputation.\nI decided to try their bubble tea anyway. Unfortunately, I found the drinks to be quite syrup-heavy, even when ordered less sweet. The mint and lime additions left my drink turning bitter after sitting for just 15 minutes. You would have to chug your drink to avoid this. Overall, the establishment seems to prioritize presentation over the tea quality I was accustomed to with SugarCube.\nTo be clear, this is no longer a bubble tea shop but rather an artsy café that happens to serve some bubble tea. It should be judged on its own merits for what it's trying to be – a stylish breakfast spot with Instagram-worthy presentations. I'm writing this primarily for fellow SugarCube fans who, like several customers I saw during my visit, might come expecting their favorite bubble tea shop only to find something completely different."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3eXRDYWVBEAE",
            "text": "Really good vibe and good services. Surprisely they even have pasta! Highly recommend their waffles and coffee, such a good place for brunch or dessert!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3bEpPX1RREAE",
            "text": "The bingsu was delicious, and staff was so sweet. Will definitely be back!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRbk5pa3h3RRAB",
            "text": "this is literally my favorite boba spot,\nim not a huge fan of boba drinks bc of the tea so i love getting their fruity bubble milks!! especially the mango bubble milk its soo good and they’re also very nice, clean, and decently priced"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmdnE3ODhRRRAB",
            "text": "I love this place. But where have you guys been??? i been waiting 100years…..it’s closed everyDAY I go. PLEASE OPEN UP😢😢😢. I need boba, I need my boba, I need my boba… pls……"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2NjUzMm1BRRAB",
            "text": "Amazing tea, fast service. Wonderful atmosphere and great employees."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQeUtfeV93RRAB",
            "text": "avoid the refrigerated items at all costs, had an extremely stale taste. Manager was extremely rude."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzbWJiejZBRRAB",
            "text": "This was honestly inedible. It was so gross, I couldn’t finish it—and I’ve never not been able to finish dessert before. Surprised the reviews are this good.\n\nEDIT: Well, you’re obviously mistaken because I threw away the cakes as soon as possible after all THREE of us agreed they tasted expired, like they’d been left uncovered in a fridge for a week. The top of the cake was wet? You should be ashamed to sell this as “food.” The mango slush was fine, but the disgusting cakes, which we paid over $15 for, completely ruined the experience.\n\nI have no reason to lie about my experience, and it’s bizarre to suggest otherwise. I’m truly shocked at how bad the food was and just wanted to warn people. Maybe get the slush, but do not get the food.\n\nAlso, it’s super telling that you’re unable to take responsibility for your disgusting cake. Next time, instead of staring at me in the store, you could come up and ask like a normal person how your store can do better. Do better."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzLXNUdmRnEAE",
            "text": "Totally yummy and the prices are amazing"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuaW9LdHJRRRAB",
            "text": "Me and my boyfriend recommend getting the taro ice cream from here since it's very delicious and now he wants to come here for the ice cream."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiN29DZGRREAE",
            "text": "Soft serve made with hydrogenated vegetable cream. Texture & taste were off. Avoid for the sake of your health."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMOXV2ZTV3RRAB",
            "text": "Great little bubble tea shop near Jackson Heights. Even with a King Fu Tea a few doors down, this spot is really cool. They have a nice design with a little bit of seating space. It's mainly meant to be a takeout spot. Still, it looks quite nice overall with cute decor and nice signs. They offer a wide variety of desserts and sweet treats beyond just bubble tea. We ordered Thai Milk Teas, Mango Milk Tea, and Winter Melon Milk Tea. They were all delicious! They also gave a nice cardboard carrying case which came in very clutch! Definitely a spot worth checking out!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqMXEzdW9BRRAB",
            "text": "I went with a friend and we got the cakes, macarons, and icecream sandwich. I also got the ube icecream and birthday cake a few days ago. The desserts are really good and not too sweet."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtd1luX1hREAE",
            "text": "Really cute, locally owned bubble tea store in a convenient location. I'd rather go here than KFT. I like their fruit and slush drinks, especially the mango ones, because they use real fruit. All the drinks I've tried here are tasty, only complaint is that they could use higher quality boba."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNteU1tQ2h3RRAB",
            "text": "Pretty solid new boba spot with other dessert options like Millicrepe cake (not lady m), will have to report back once trying the cake. They so use fresh fruit for their fruit series and slushes, worth a try for sure!\n\n2023 update: had their homemade ice cream, pretty solid as well. They do free samples!!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURleC03amVREAE",
            "text": "Was just walking by and wanted a drink before I got home. It wasn't too busy for a Sunday afternoon. I ordered a drink with cheese foam and when my drink came out there must have been some confusion because apparently, I didn't. I said it was okay and maybe I didn't order clearly but they insisted they'd fix it for me :) The drink itself was great and I definitely drank it way too fast because of that haha.\n\nDrink: 7/10\nService: 8/10\nVibes: 5/10\nValue: 6/10"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSaGZiV053EAE",
            "text": "Their matcha milk tea actually tastes like MATCHA!! Unlike sweetened milk with a hint of matcha, like many other coffee shops. (A review by a Japanese).  Plus the girl at the cashier is always sweet and nice."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtLU5qeDFnRRAB",
            "text": "First visit I tried the grapefruit jasmine green tea (fresh grapefruit!) and the rainbow mille crepe. Delicious! So happy this place has opened"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtMGNYT3FRRRAB",
            "text": "Great service; they always make sure the make your drink right. They are also very generous with their toppings. I come here way too often. Def prefer this spot over the other bubble tea shops in the area!!!! 10/10 would recommend."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPaG8tUHlRRRAB",
            "text": "The best bubble tea place in Jackson Heights. Their fruit teas are especially excellent, made with loads of real fruit. My favourite is the pineapple-passionfruit green tea one. Skip the chains nearby and show these guys some support. Long live SugarCube!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNteFBYd3ZnRRAB",
            "text": "Hubby and I popped in to try their boba since its a new addition to the neighborhood. I got the Oolong Tea with cheese foam. EXCELLENT. easily my new favorite go-to. 10/10 would recommend. Inside was clean and new. They also served ice cream, cake, and macaroons. Will update once ive tried them as well."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMyaHVqZTRRRRAB",
            "text": "Great service, loved their mango green tea. Fruit was very fresh and drink was very refreshing."
        }
    ],
    "reviews_count": 60
}