{
    "name": "Valdes House",
    "place_id": "ChIJR4Ws3DdfwokRQg7e9L8rTRo",
    "grid": "QN3",
    "address": "91-09 31st Ave, Flushing, NY 11369, USA",
    "rating": 3.8,
    "user_ratings_total": 39,
    "phone_number": "(347) 808-0133",
    "reviews": [
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOUU9FZHBaalV5VlRCTVdrSnNNekY1WjBoZmFFRRAB",
            "text": "Muy bueno"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKTldHWkdjMHRWYmxaaVFucHJVVU5NUlZKV1gzYxAB",
            "text": "A mi no me gusto el servicio pesimo y lo k mas cobran ellos incluyen ya un tips por cada muchacha se supone  q eltips  es por la attention"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvd2NMZU5nEAE",
            "text": "The best bar"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyNU1MTkV3EAE",
            "text": "Horrible place to eat at!!! a plate of calamari is 16 dollars and they serve you only six pieces of thin calamari on a bed of wet salad and tostones, ordered wings and they weren’t wings they were just pieces of chicken also just six on a bed of fries last thing I ordered were salchipapas only 6 pieces of hot dog and everything else was just French Fries. When I asked for water they wanted to charge me for a 3 dollar water bottle. They did not want to give just a regular cup of water with ice! The food is very expensive and they give you basically bites. The only thing I like was that they have a backside it was nicely done and they have tvs out in the back."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNydHN2WmxBRRAB",
            "text": "Excelente lugar y servivio"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5bkplOHJRRRAB",
            "text": "It's very expensive."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNscGJiTm5BRRAB",
            "text": "I order to pick up the same from this place a soup , now they have the scam to charge you tips plus taxes on it for a pick up order, basically a soup costs you $23 insane.  I guess they lost one more loyal customer"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNseFpPVFZBEAE",
            "text": "Un lugar para ir apoyar alentar a tu equipo favorito especialmente el de la liga de quito"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGemRpRlR3EAE",
            "text": "Estuvo bueno ver mi equipo coronarse por quinta vez 🖐🏾👑❤️‍🔥🇪🇨🏆🏆🏆🏆🏆. El ambiente estuvo expectacular y la buena vibra del ambiente ni que decir. Muy buena la decoración muy agradable las meseras y staff. Y sobretodo la gente ponemos el ambiente. Gracias por hacerme pasar tan bonito y celebrar otro logro aquí en Queens y con la Muerte Blanca Ecuador. Sigan así a disposición de la clientela y la comunidad Ecuatoriana y futbolera de NY🗽🇺🇸"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURadmRDaktREAE",
            "text": "good place to spend a pleasant time with good food."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwdWMzWlB3EAE",
            "text": "Great drinks!"
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlcFBiWUxnEAE",
            "text": "Estaba cerrado cuando llegué. Muy mal."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQycWNTMmNREAE",
            "text": "Good place having fun who loves to drink I do recommend this place ok is very enjoyable come over the food is excellent and girls ok are very very nice and cute ok"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXbnNyeGRREAE",
            "text": "Potential for better ."
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtNEppVmFBEAE",
            "text": "Buen ambiente"
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtcmRXT3BRRRAB",
            "text": "Muy vino, buena comida Ecuatoriana"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURHdFp2RDR3RRAB",
            "text": "Total scam!!!! Worst food ever not authentic. The margaritas was trash. They charge $10 for beer with lime and salt but the charge $5 for only beer. So it cost $5 to add salt and lime. Total scam."
        },
        {
            "date": "4년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2aFBqb2ZREAE",
            "text": "Por el puntaje de este lugar tenía mejores expectativas de este lugar , con la comida que ordene.motepillo,humitas,Morocho, pero deserción así de mi parte ., la humita 🫔 estaba dulce y el resto los dejó a su criterio"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2bU1PaldnEAE",
            "text": "Total rip off. First off , when I walked in \" the owner \" Luis  valdes ( who is one of the people who left 5 stars in these reviews ) was drinking and didn't acknowledge I had came in for about 5 minutes. After that my wife and I drank a…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2bUlPV0lnEAE",
            "text": "Went here trying to support a new local business,  and honestly at first not to bad music wise. However being from the area my whole life,  you will feel robbed by the time you leave. Luckily I bartneded 6 years of of n life and didn't cause a scene just told the owner he was basically robbing people.  My wife and I always look for good music and us being colombian we liked their music. We spent a good time there drank only beer. For those who are Latin will know most women drink their beer as a \"michelada\". Depending where you are from it may come with hot sauce or just Limon and salt.  Point is, when we got our bill my 6 beers were 30dollars (normal) my wife's 5 beers were 50(10 bucks a beer) . I asked to speak to the manager and he decided not to come out only tell the server , \"tell him that's what we charge.\" I was chagered 5 bucks for a cup with Limon and salt in other words. When he finally came put and I told him this plus added salt in a store is less then 4 bucks he replied \"I am a business and if salt cost 1 cent , I can still charge 5 bucks \" . Granted that my be ture but nowhere I ever been , have someone try to charge me for a cup of salt and Limon rim. Total rip off !"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2ODVtZ2d3RRAB",
            "text": "Absolutely disgusting. Don’t even waste your time. I went in there trying to support a new business but I left disappointed. I should of cook at home instead of coming here to leave hungry, minus -$70 to end up going to a different restaurant."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2bEp2WFVBEAE",
            "text": "Great! Ecuadorean food. Very Welcoming and Friendly attention. Service is great! Food is amazing, budget friendly as well. I always come in and out with a very pleasant experience."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxbE5mcFZnEAE",
            "text": "My 1st time there and invited by my fellow Ecuadorian friend Cesar Alvarez and last night was SALSA night with DJ Andy Rodriguez who's ALWAYS on point!!!\n\nMy friends and I had a blast!  The chaulafan and empanadas was AMAZING!!!  5 Stars and salsa music is every Thursday starting at 6pm is what Cesar told me..."
        },
        {
            "date": "4년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLcnRlRExREAE",
            "text": "La. Atención. Es. Excelente.    La.   La. Comida. Es. Muy. Bueno."
        },
        {
            "date": "4년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5bmY2ejNnRRAB",
            "text": "Exelente servicio personal muy atento,comida deliciosa y mucha variedad de bebidas que no te puedes decidir cual tomar,lo recomiendo y definitivamente volvere."
        },
        {
            "date": "4년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5N1BPVFNnEAE",
            "text": "Muy agradable este sitio mejor dicho muy limpio y la tencion super"
        }
    ],
    "reviews_count": 26
}