{
    "name": "D'antigua Restaurant Bar",
    "place_id": "ChIJ75mU_6NfwokRRmijMqQ2u38",
    "grid": "QN3",
    "address": "84-16 Northern Blvd, Jackson Heights, NY 11372, USA",
    "rating": 4.4,
    "user_ratings_total": 933,
    "phone_number": "(718) 779-0128",
    "reviews": [
        {
            "date": "6일 전",
            "language": "es",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWTk9XWTFRblF4TVRkTGFIYzBiMDlMT1c5QmFIYxAB",
            "text": "la comida es muy buena, lo malo es que nos querian sacar rapido por que tenian un evento privado, y nos toco casi irnos rapido, pero la comida muy buena.\n\nThe food is very good, the bad thing is that they wanted to take us out quickly because they had a private event, and we almost had to leave quickly, but the food was very good."
        },
        {
            "date": "1주 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tseWFFRk5NRloyVlhOaVkyNUZZMmR2V0dGclNYYxAB",
            "text": "TENGA MUCHO CUIDADO COMIENDO EN ESTE RESTAURANTE .\nHoy Pedí a través de Grubhub y el plato llegó con un montón de pelos blancos eran  tantos que no lo creía pensaba que era parte del sazón. Al contactarlos para explicarles mi inquietud , la respuesta no aclaró las prácticas de higiene, no se disculpó me discute que es maiz pero el lomo saltado no contiene maiz . Esto puso en riesgo la salud de mi familia y dejó a todos muy enojados y frustrados. No volveré a pedir  y consideraré reportar formalmente ante Grubhub y ante las autoridades sanitarias si es necesario."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJeFkyMWplVkpwU1VadmFGWktXRkJwYjA5Q1NuYxAB",
            "text": "The DJ didn't play very musical sets."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWWmFqWjFialZSU21nNFprcHJSVXBmVkUwMVUwRRAB",
            "text": "You can feel the care in every detail."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sTVNVdzVORGxMV0dwNFpqQkVVVEJ2Y25KaGVFRRAB",
            "text": "Great place to eat ,open bar and listen to artists sing on stage Ecuador Restaurant"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KdlkyVTFZVTlXYkdaRlRsUm5RbXRpZERFdGRIYxAB",
            "text": "Good Hispanic cuisine!  Everyone was great hosting. Live music and food was awesome!"
        },
        {
            "date": "4주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCd05VOUlRa2g1ZERVNU5tRmFORFJzWjNaYVQyYxAB",
            "text": "Uno de los mejores lugares que he visitado, la comida muy buena, el servicio y el menu tambien muchas opciones y muy ricas, recomendado"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFMVdHcFJNMkpvYmpCTGVWVlNSRVU0TFdST1JWRRAB",
            "text": "Great food and music"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xb09GOUJiVzFoWm5WaFUxWkhlbWgwVERsbWJsRRAB",
            "text": "Me encanta la paz de este lugar, es muy ameno todo"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213d2ExTlRkREphVDFaQ1ZEaEpRVjh4VjE5cVUxRRAB",
            "text": "El ambiente es bueno el personal amable .\nLa comida nada sorprendente\nY la cuenta muy caras de 10 puntos le daria 4"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CVlpEaDRaRVpxVUZoRFpHRlRaMHc1TWpSSFZYYxAB",
            "text": "Nice place"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WT2RFNWpkamx3VlUxWFJVTjVSbFUyYTJ0RmFuYxAB",
            "text": "Excelente lugar me gusta la música muy variada su personal siempre atento"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSbVVYbHlSV0ZzYWtrdGVscDJNMVpUTWpOVVkyYxAB",
            "text": "Buena comida y buen servicio"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGWWJHTXdURU15UjBoamMxTlhZME15VjBKamFFRRAB",
            "text": "great margaritas, great price, great food, great customer servicio al cliente. :) Gracias"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQZmM4SnZKbnZfVHFBRRAB",
            "text": "Exelente"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMZWlxYWI4dF9HaTVnRRAB",
            "text": "Excelente lugar para disfrutar con amigos y familia"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKMzQtTFNlZzRtcnRBRRAB",
            "text": "The food was tasty and the service was worderful"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3czlfRVVREAE",
            "text": "D’Antigua is the perfect place for a fun night out! My friends LOVEE coming here for weekend drinks and dancing. The food is delicious (highly recommend the ceviche), drinks are great, and the music keeps the energy high. If you love Latin vibes and dancing, this is the spot. Can’t wait to go back!😍"
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3NnR1REJREAE",
            "text": "De lo mejor de lo mejor. Y lo bueno que no hay escándalo entre clientes. Perfecto lugar"
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3N0ppd19RRRAB",
            "text": "La comida muy rica, el ambiente muy agradable, pero lastimosamente me tocó un mesero muy distraído, fui con mi pareja a tomar una botella de vino y teníamos que pararnos a pedir o pagar en la barra, y el sitio no estaba lleno aún, fue la…"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3LUwzTUh3EAE",
            "text": "The atmosphere, the music, the drinks and the prices are very good..!!!!"
        },
        {
            "date": "수정일: 8달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREaHBXUm5BRRAB",
            "text": "Excelente atención ...Excelente ambiente"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnamVQV2Z3EAE",
            "text": "Excellent place"
        },
        {
            "date": "9달 전",
            "language": "es",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfblppcFpnEAE",
            "text": "Pésimo el manager grosera su manera de atender en cuanto se le hace un reclamo sobre la música que pone el  Dj .. cuando se paga una cuenta bastante alta   y se lle pide un vallenato y me responde que otra mesa paga una cuenta igual y pide regueton...y nos tienen más de 1 hora con regueton\nDeja mucho de desear su  actitud como manager .. el mesero juan  Pablo  muy buena atención y apenado por lo ocurrido .\nPero sin ganas de volver....\nAparte ojalá tengan en cuenta la queja de todo el mundo por los Dj y busquen solución.\nPor que ley3 do comentarios anteriores no soy la primera"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfeUltd05REAE",
            "text": "Amazing, I love D antigua. I celebrate my birthday here in October. The experience was amazing.... the service  wow the best experience ever ...! I always come for drinks... highly recommend 👌"
        },
        {
            "date": "10달 전",
            "language": "es",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmcTVUc1d3EAE",
            "text": "Muy decepcionada, el evento del 31 diciembre 2024 un completo desorden, por el precio que se pagó, la comida muy regular, la atención pésima, el dj ni se diga, todo muy regular. No volvería y menos para estos eventos 🙁"
        },
        {
            "date": "10달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmenVtOXVnRRAB",
            "text": "Excelente lugar!!! Volveré! ☺️"
        },
        {
            "date": "10달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2b01PclNnEAE",
            "text": "Muy tranqui ,bonito bueno y barato"
        },
        {
            "date": "수정일: 11달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQdHB2SENnEAE",
            "text": "Es una porqueria de lugar y Los meseros de la barra no respetan y tratan mal alos  alos clientes aparte que dan super Caras las bebidas es un pesimo lugar no saben tratar alos clientes,  te cobran extra tener cuidado en eate tipo de lugares"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQOHBTenZ3RRAB",
            "text": "Good service"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQb1ByNzV3RRAB",
            "text": "A good place to hang out with friends."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuMV9tUVpnEAE",
            "text": "Me encantó la.pizza ; si buscas pizzas 🍕 de buen sabor te lo recomiendo..no te arrepentiras\n☺️☺️…"
        },
        {
            "date": "수정일: 1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4aHZPTXRBRRAB",
            "text": "Muy excelente lugar. Planeando en volver. A mí pareja y compañeros les facino. Recomendable 100%"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIMWMyWnFnRRAB",
            "text": "It's a great local bar/restaurant 👍"
        },
        {
            "date": "수정일: 1년 전",
            "language": "es",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJaXJIam13RRAB",
            "text": "El lugar tiene un ambiente muy bueno y la atención es excelente pero el día de ayer sábado 24 de agosto el DJ estuvo pésimo, ponía 10 segundos de una canción y cambiaba de canción y de ritmo, no conozco al otro Dj pero mi opinión personal  es que él mezcla mucho mejor y mantiene a la gente en la pista."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiNllIVlVBEAE",
            "text": "Good food, but disappointed that a tip was automatically added to my takeout order. Tips should be optional, especially for to-go orders."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURibHF1QnlRRRAB",
            "text": "Jairo was great!!! 👍 thank you we love the extra space and the stage with the couch! Had some tres leche and the dj was great too ☺️"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyay1LRmpRRRAB",
            "text": "Es un sitio tranquilo y agradable."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNydzV5Qm13RRAB",
            "text": "10/10 I’ve been a customer for years and the food is great, the ambiance is fun and service is great. It did get very pricey but definitely a great time"
        },
        {
            "date": "수정일: 1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURreFp6QTFBRRAB",
            "text": "Excelente lugar para comer, bailar y disfrutar el momento todo el staff el mejor de la northern blvd por lejos, se siente el buen ambiente."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPdk1TTllBEAE",
            "text": "Excellent and beautiful place to visit and share with friends, live music, dancing time and karaoke. Nice service and good enviroment. One of the best place for visit in Queens, NY."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUdnVQS1lnEAE",
            "text": "Fui por primera vez a este lugar,y me llevé una decepción,cuando llegué dije ok está bonito el lugar,porque eso no se le quita muy bonito,pero no me gustó el servicio,el mesero no estaba atento a nada,mi esposo terminaba su bebida y el mesero no estaba atento,tocaba llamarle para pedirle otra bebida y nos hacía esperar un buen rato para traerla y el lugar ni siquiera estaba lleno q no era porque el estaba ocupado,en una ocasión mi esposo pidió otra bebida y esta jamás llegó todo pedírsela a otro mesero,mi esposo no quiso terminar toda su comida ahí porque estaba molesto por el pésimo servicio,así q decidimos pedir para llevar lo q le quedaba y d paso la cuenta! Cuenta q cuando llegó era demasiado cara para lo poco q pedimos!!! D verdad q no volveré más aquí pues fue una mala experiencia para mi esposo y para mi q solo queríamos tener una velada y distraernos un poco pero lastimosamente escogimos mal"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUcEplVzFBRRAB",
            "text": "Todo de antigua  es nice ,  nos gusta y por eso regresamos , el dj lenny Rojas   Genial y la atención de parte de Jairo Iván . La mejor ."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1bTY3RG13RRAB",
            "text": "The restaurant me and my family dined in had a great atmosphere. The staff were very kind and people were being respectful towards each other. However. When we went in, there weren’t a lot of people, and we had to wait almost half an hour for a meal, and their lemonades were a bit sour. All in all, we had a great time, we were treated with respect and the food was indeed delicious."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQwN29yR2pnRRAB",
            "text": "I absolutely love this place. It's clean spacious, modern and friendly helpful staff. The ambiance is amazing. They offer Karaoke and happy hour from 5-8. The food is good and the drinks are mixed well. Definitely recommend!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5cjQyTkh3EAE",
            "text": "Atendi el show Improbando el 9 de Marzo y me siento totalmente insatisfecha con este evento por diferentes motivos.\n1. Su publicada prometía 7 comediantes, solo llegaron 6 personas. Donde afirmaron que el comediante más importante y famoso Antonio Sanint no pudo asistir.\n2. La información del comediante que faltaba la dieron cuando el show empezó, no informaron a la entreda ni dieron opcion de devolver el dinero en caso que no estuvieramos satisfechos.\n3. Cuando llegamos,  nos ofrecieron una mesa, y nos advirtieron que teníamos que comer y consumir una botella de licor, con la promesa de que estaríamos más cómodos y mejor lugares. Accedimos a esto y compramos lo requerido que fue una botella de whisky y una \"Picadera\" de carne, pagando aproximadamente $322\n4. La mesa que nos dieron está ubicada al lado del computador, donde los meseros entran las órdenes y una puerta que al parecer va a la cocina, por lo tanto, todo el tiempo pasaban los meseros. Aun que esto es incómodo y nos interrumpía el show, pero era entendible. Esta situación se puso peor cuando la fotógrafa se para al  lado de la computadora a grabar el show y bloqueadon totalmente nuestra visibilidad, le pedimos amablemente que nos dejera ver y nos dijo que estaba haciendo su trabajo. cuando ella finalmente se movio, luego se pararon los meseros y hasta el manger a ver el show y todos nos bloquearon la visibilidad, el mesero que nos atendio era el unico que se disculpaba todo el tiempo pero no hacia para que la gente se moviera."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUROajVTc2NBEAE",
            "text": "Sangria was 10$\nA pitcher was 45$\nThey gave us a round of shots on the house."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKb0xLWElBEAE",
            "text": "Segunda vez que visito este lugar, la comida es muy buena, el ambiente está OK. El servicio lo podrian mejorar. Tuvimos que esperar como 40 minutos para que nos trajeran la comida, y hay un mesero que fue el primero que nos atendió, un poco grosero. Habiendo miles de lugares donde uno puede ir, a veces uno elige el lugar basado en su servicio pero éste sin duda lo tienen que mejorar."
        },
        {
            "date": "7년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3NnV1bG1RRRAB",
            "text": "Ambiente bueno , tranquilo, buena comida , buena entrada, tragos , música , los trabajadores son amables . Me gusta mucho , lo recomendó mucho 😉…"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5NF83d2dnRRAB",
            "text": "D'ANTIGUA SIEMPRE ES EL LUGAR CORRECTO, LA MUSICA EXCELENTE, LOS MEJORES SHOWS, Y LA COMIDA DELICIOSA, RECOMENDADISIMO, CUANDO VALLAN, PREGUNTEN POR JAIRO! RECIVIRAS UN EXCELENTE Y SERVICIO VIP"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwc2J2VEh3EAE",
            "text": "Jose gracias por tu servicio. Ya desde hace más 9 años me has atendido y siempre eres muy atento y siempre te aseguras de que todo este bien con el ambiente y la comida. Gracias y espero que nunca te vayas."
        },
        {
            "date": "7년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRZ3JlU3B3RRAB",
            "text": "Un excelente lugar para compartir con amigos y familiares... un lugar mágico! KARAOKE BUENA COMIDA Y EXCELENTES CÓCTELES."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpM0lPNDdRRRAB",
            "text": "Ive been coming here for years.. Amazing music, food and drinks! Great ambience. Always fun here! Even with covid restrictions now."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPN3FiU1dnEAE",
            "text": "The drink and the food are delicious! Food comes in large portions. Great music too. Good environment. Id recommend."
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXLU9xOFFREAE",
            "text": "Me encanto🤩 bonito lugar ,buena música, cómida sabrosa  y buenos tragos muy divertidos"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLLS0tQlVREAE",
            "text": "The staff is very friendly, good music and clean place.\nDelicious food 🤗\nI recommend fish tacos, the flight of frozen margarita and the churros.…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKaGQzMVhREAE",
            "text": "Pretty good place, food was good and it really filled me up also the drinks were amazing"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURld1lIVVp3EAE",
            "text": "Excellent bartender (Mexican) excellent service\nCold beer 🍺 wine Not so good stay away from wine\nfried calamari  ok fresh\nExcellent bar menu for happy hours…"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGNWVqcWxBRRAB",
            "text": "Me encanta el lugar ,los fines de semana se pone muy bueno el ambiente. 👏🏻👏🏻👏🏻💯"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPdlltRlFBEAE",
            "text": "Cozy and nice ambiance but I feel the food was way over priced."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0eXRpY1hBEAE",
            "text": "La atención fue excelente,  la comida, las bebidas y el servicio en general fue extraordinario,  el lugar es muy bonito y las personas que nos atendieron fueron muy atentos.\nJairo quien fue la persona que nos atendió estuvo muy pendiente de nuestra mesa, con las necesidades de nosotros y con nuestra comodidad, también nos ayudó a decorar la mesa para la cumpleañera y nos ayudó con el pastel.\n100%  recomendado el lugar, sin duda alguna volvería a reservar ahí"
        },
        {
            "date": "4년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2bGJtUnBRRRAB",
            "text": "Muy buen lugar para comer y escuchar musica, el mesero fue tan profecional que nos dejo aterradas, todo le salio perfecto."
        },
        {
            "date": "7년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnd3NHYXFnRRAB",
            "text": "Me encanta por la atención de sus dueños y empleados. Comida y musica excelentes. El show de Fulanito muy bueno, gracias al DJ Leche. Pase un buen rato. Lo volveria a repetir."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqdHV1WDNBRRAB",
            "text": "Hola!\nQue bonito cuando todo se une para lograr un momento agradable, muchas gracias a todo el personal especialmente a Jairo por estar pendiente de cada detalle.\nCelebramos un cumpleaños y todo salio perfecto.\nMuchas gracias a todos."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKM3FhM0tREAE",
            "text": "Unfortunately I don't have some pictures but I will say the place is nice got some food amwith some friends and we didn't even know it turnt into a lounge after. The food was decent. We had tacos, which were dry but good. We went from having  conversations to yelling at each other because the music was so loud. Don't get me wrong, I love some loud music, but in this type of environment, you still want to be able to talk normally."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwNlpyN0FREAE",
            "text": "we went this saturday night with friends, the party was blast dj that night was awesome! great mix of latin music, drinks were strong just the way I like it. our server Enrique was fantastic.. we will come back for sure!"
        },
        {
            "date": "수정일: 7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNndk9mQlRBEAE",
            "text": "Great customer service. The arepas are delicious and the salsa music is awesome!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsaV9PVy1RRRAB",
            "text": "Jose nuestro server nos atendió increíble! Nos recomendó cositas del menú y la verdad todo estaba muy deliciosos. Pedimos arepas y los churros al final. Manejamos más de 1 hora desde NJ y valió completamente la pena. Gracias Jose por tu amabilidad y buen servicio!!! Volveremos."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5cE1tdmxRRRAB",
            "text": "Asistimos con mi hermana a un evento de \"Improbando\" El sabado 9 de marzo. Realmente El sitio y la organizacion del evento dejan mucho que decir. Pesimo, las boletas decian que El evento era de 6 a 9 pm, llegamos a las 6:15 estaba llovisnando durisimo y Ellos aun organizando las Sillas, tuvimos que esperar casi 30 minutos para poder ingresar. Luego nos dicen que si queremos mesa debemos estar dispuestas a comprar botella de licor Durante Toda la noche, de manera que nisiquiera pudimos comer, pero Sorpresivamente la Gente que estaba en las mesas NUNCA compraron botella. El evento finaliza antes de las 8:30 pm, claro, dieron tiempo para fotos con los artistas, de no SER por eso nos sacan antes del establecimiento, literal fueron irrespetuosos, y no tienen El mas minimo sentido de decencia o respeto."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLeE96TlBREAE",
            "text": "Everytime is a great time. DJ mixed it up with different genres and music videos. Service is fantastic. Drinks are on point and food is absolutely delicious. Love the new seating arrangement for social distancing. You guys do a great job!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1MWJhN2V3EAE",
            "text": "Bartender was nice however, we went for happy hour, made it very clear when asking for the happy hour menu & ordering drinks but when we receive the bill all the drinks were regular price. When we spoke about it the bartender told us yes, tequila is on the happy hour menu but not margaritas! How does that make sense? We should have been told that when we asked & ordered. Would not return"
        }
    ],
    "reviews_count": 71
}