{
    "name": "Pio Pio 5 To Go",
    "place_id": "ChIJ4cuX_qNfwokRemVnmkMnJyw",
    "grid": "QN3",
    "address": "84-21 Northern Blvd, East Elmhurst, NY 11370, USA",
    "rating": 4.1,
    "user_ratings_total": 1595,
    "phone_number": "(718) 426-1010",
    "reviews": [
        {
            "date": "3주 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25VMFVFcGhka3BuTTI1RldEZzBTRm95VmtWNlJuYxAB",
            "text": "Woww q mala la comida! Increible hoy oct 10 a las 9 pm una jalea con todo el pulpo quemado, los tostones quemados, parece q la comida la fritaron en aceite viejo! Muy triste pagar por un matador y una jalea 132.83 y muy mala la comida😡😡😡"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tVMmMwSmtRM041TkhWdGREbHNNRUpNTVdJMVNWRRAB",
            "text": "I end up at hospital after there lunch spcial"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tFNWJrSlNjSHAzTkZBMGEzVmhiRGc0WVhoT1IyYxAB",
            "text": "Ordered the Lomo Saltado and it was about six small pieces of meat. What a rip off. And it was $35 bucks!! Never again."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWWGVHbHdTMEZUZW1sWFRGQnVPVXByWXpGVVNIYxAB",
            "text": "Great informal restaurant, little hesitant to go to the big restaurant across the street, because wasn't dressed well. This place was perfect. Had lunch today, male server was great and super humble and approachable. He really made me laugh and feel comfortable eating there. Ate at September 13 noon time. Didn't get the server name. But he was managing 6 tables super efficient and professional. Food was great and fresh. Would definitely recommend for the food and quick bite"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWNVp6bFNkR3g2VW5KT2RGWlRVbk14UldSM1NHYxAB",
            "text": "The to go spot hits like the flagship restaurant.  Never leave any airport with out getting some yuka fries n chicken to eat."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toamIxOTVRV3AyY3psSlJVdHpZa2xFVGtkbE0xRRAB",
            "text": "La comida es super rica y muy buena la atención"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKdloxTk5XVVZDZUhkeVlVUXphMTg1YWxRdFMyYxAB",
            "text": "This is Amazing. Great service 👏 Waiters are very attentive and helpful . And the food was well prepared and excellent 👌"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sWmNVZE9MVXhuZHpGR2JYQlFXbGs1VjFkb2RHYxAB",
            "text": "This chicken is the best, definitely try to green sauce, and the salchipapas are stand out."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oMWNGTk9Na015YjJJeFUwZGZaM0Y2VFRSb00wRRAB",
            "text": "The food doesn't taste as good as it use too. The chicken is overly salty. Please ease up on the salt."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsaWIyNXRObTFoWmsxR1FqQkpWRTB6TkZwclFXYxAB",
            "text": "Ser más cortez con los clientes"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oQ04ybFVlbVp3VTI1dmJuUnJhekp1YVVWWlYxRRAB",
            "text": "Entre ah este restaurante porque se me antojó comer este plato de pollo pero me llevo la sorpresa dela cajera muy mal atención no mérese ser cajera en ningún restaurante no recomído este restaurante ah nadie mal servicio"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s4MmJFZDBhRXRXU0ZoTE5UZFJhRk5uWkhGa2VrRRAB",
            "text": "Terrible service. Rude staff."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkWWVFMUdSMnRIU25wMlNrUk1NVkYyWlZFMVprRRAB",
            "text": "Ok lets be clear this is the the TAKE OUT 👌 spot not the full dining experience that is directly across the street ,that is not taking away from the fact that this place's food is so damn addictive it really is the flavor you have been missing. The chicken is soft and tender and juicy that the Flavor just melts in your mouth with every chew  you take. They do have seating and a staff to wait on your table if you choose to stay and have lunch or dinner but its small area but who cares about that when all you came to do is eat this fabulous arrangement of great flavor. please don't take my word for it please please go try and prove me wrong. I drive from Brooklyn to eat this food that 2 hours in traffic if not planned out properly. ENJOY AND PLEASE THANK ME LATER."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25BNFREQkJSWEJ3YUVZeFEzUjJNbWhQVEdOME5rRRAB",
            "text": "Mozzarella pio salad is not like it used to be.  In the past it would come with basil; now just a bed of iceberg lettuce. Basically paid $16+ for a few slices of cheese & tomato."
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSdFVteEVSREI2YXpNeVRWbzBTMFZyTFRKSWVsRRAB",
            "text": "ASQUEROSIDAD DE COMIDA EL CEVICHE DE PESCADO EN MAL ESTADO FERMENTADO Y MAL OLOR ,LAS SALCHICHAS VERDES ,LLAMÉ PARA PONER LA QUEJA Y MARIA SE LAVÓ LAS MANOS Y PODER RESOLVER ESTO ME DIJO QUE LLAMARAN A LA OFICINA NO SIRVE EL LUGAR"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poSlJHZGFNVFo0T1VJM09WQnBORnBZWjIwd2QzYxAB",
            "text": "The hostess/cashier the blonde lady very rude. Shows no care and respect, horrible customer service."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214MVNHaGFUVTVhVWxWdFRqaHRWbmxCVVZOV1MyYxAB",
            "text": "I placed an order which included a rotisserie chicken, rice, beans, and an avocado salad which  arrived with visible mold. I called the location and asked why something in that condition was even sent out? The mold was clearly noticeable and concerning. However, I didn’t receive a response instead, I got a new salad. As for the rest of the order, the chicken was bland and dry. Frankly, I find it difficult to justify $75 for such a small and underwhelming order."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VOYnpwcnUyMXNIRVR3EAE",
            "text": "damn ya'll watered down the famous green sauce. what a move."
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VMU1k1N21nMGJUZFdnEAE",
            "text": "Las presas del pollo parecen de paloma. Pésima atención de la señorita que atiende en la caja. No recomiendo este lugar"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VMeU0xZXFTal9LTllREAE",
            "text": "Very bad service, tables full of grease, and the waiter had a very bad attitude, disrespectful and unprofessional. While we were ordering, he received a call on FaceTime and makes us to wait while he talk to somebody on , some of the cutlery was made of plastic and others of metal."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLYmZfYTY3dDYtUnhnRRAB",
            "text": "Food is great and the services are good."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZMFphdkZ3EAE",
            "text": "Most of my order was correct but only thing with issue was I requested all dark meat for the chicken and paid the extra money for dark meat but they gave me half dark and half white meat. I called the restaurant and explained to Maria and she was very understanding and gracious and said I can bring the food back and get the correct chicken. But I didn't want to make a trip back because I had to circle around 3 times to find parking and nothing was available (I left my car running double parked by a hydrant and ran up.the block to pickup my order). I asked if she can just give me a credit for my next order and she was kind and said that's not a problem and took my number and made a note in guess."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJbmFuQkFREAE",
            "text": "Fully obsessed with the green sauce! Really good chicken."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3X0szQXBBRRAB",
            "text": "Great\nGood"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRcHIzZFB3EAE",
            "text": "The best chick on the  hood best favor something to alway remember on thw way of good time with friends and family love the food and my service freinds  also"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnNEoyOF9RRRAB",
            "text": "Please get the Quarter chicken with rice and beans, treat your self to a salchi papa on the side. Perfect comfort food. Only hiccup I have is that in order to enjoy the salchi papa like a gentlemen, I have to fix my self up a nice creamy pink sauce with ketchup and mayo. The mayo packets that are used here need to come with instructions, because it’s nearly impossible to open when my fingers are greased up by the first French fry grab Bring a pair of scissors and avoid your self 5 minutes of frustration when whipping up that Pink sauce."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnaVBfX0hBEAE",
            "text": "Best Peruvian food you can find…"
        },
        {
            "date": "8달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBNzZHaExnEAE",
            "text": "Todo muy esquisito y en especial la atención de la cajera super profesional. ❤️"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURLMWREZ2VnEAE",
            "text": "Great service"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfeXZ1VjJnRRAB",
            "text": "Chicken is to small and no taste the seem flavor anymore and overpriced I don't recommended and the the big restaurant it looks like flea market ."
        },
        {
            "date": "9달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfX0tIZHhRRRAB",
            "text": "El 10 de enero, alrededor de las 6 p.m., decidimos cenar en Pio Pio To Go, ya que el lugar estaba vacío. Fue nuestra primera y última vez. La experiencia fue pésima. El mesero prácticamente lanzó los menús y, al preguntar qué queríamos, hablaba tan rápido y sin mirarnos que no se le entendía. Le pedí una \"colombiana\", y muy ofendido me dijo que no la tenían. Luego mencionó las opciones, pero sin pausas, por lo que tuve que preguntar varias veces, además de traducirle a mi esposo.\n\nLa comida, aunque rica, no compensó el mal servicio. A los 30 minutos, el mesero se acercó, no para saber si estábamos bien, sino para hablar de su vida personal. Me contó que había dado todo por una mujer durante seis meses y que lo habían dejado. Le respondí, \"¿y eso a mí qué?\", ya que estaba con mi esposo e hija, y mi esposo no habla español. Cuando él se dio cuenta de mi incomodidad, se alejó rápidamente y no volvió. Fue una falta de respeto total.\n\nOn January 10th, around 6 p.m., we decided to have dinner at Pio Pio To Go since the place was empty. It was our first and last time. The experience was terrible. The waiter practically threw the menus at us, and when he asked what we wanted, he spoke so fast and without looking at us that we couldn’t understand him. I ordered a \"colombiana,\" and he rudely told me they didn’t have that. Then he listed the drinks without pauses, so I had to ask several times, also translating for my husband.\n\nThe food, although good, didn’t make up for the poor service. About 30 minutes later, the waiter approached, not to check if we were okay, but to talk about his personal life. He told me he had given everything for a woman for six months and that she had left him. I replied, “And what does that have to do with me?” as I was with my husband and daughter, and my husband doesn’t speak Spanish. When he realized my discomfort, he quickly walked away and never returned. It was a complete lack of respect."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmX2RtNF93RRAB",
            "text": "Augusto,  if you are reading this message,  know that you have the most sarcastic, and unprofessional team working at this site. First of all, how are we supposed to know we must first pay and then must tell the cashier whilst you're paying for your order in how many pieces you want your chicken cut? or if you want additional hot sauce?\nPlace a sign that says : PLACE YOUR ORDER WITH THE CASHIER AND PROVIDE INSTRUCTIONS ON HOW YOU LIKE YOUR CHICKEN CUT.\nSecondly, and most disgustingly, the guy in this picture is the nastiest individual of all, he made smart alec remarks when I made a request, like I was an idiot for not knowing your \"ordering rules\". Totally uncalled for.\nI have eaten at your restaurant since you first started, I just had never placed a to go order, and the experience was horrible!\nDon't let individuals who work for you bring your creation down."
        },
        {
            "date": "9달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmamNTMG5BRRAB",
            "text": "Buena comida"
        },
        {
            "date": "10달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmcEpHdTR3RRAB",
            "text": "$74 por Combo Matador ? , OVERPRICED, en otro lado consigues lo mismo por $32 . No lo compre de otro lado porque estaba cerrado , pero nunca más este lugar OVERPRICED"
        },
        {
            "date": "11달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzdjl1WElREAE",
            "text": "Muy buen ambiente y la comida está buena"
        },
        {
            "date": "11달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzNi1tYnNBRRAB",
            "text": "Todo muy bien excepto el postre creo que es costoso para su poco sabe\nEl tres leches no es un bizcocho solamente es más que eso !!.. 🍰"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuNWIta1F3EAE",
            "text": "The fries and chicken are a must. As a Peruvian myself this chicken tastes like an authentic Peruvian chicken should taste. Highly recommended"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuM1lHcFVBEAE",
            "text": "I don’t really eat from the location because prefer the steak and basil pasta from the Manhattan location but I wanted a meal for at least 3 people and this meal did have its con’s unfortunately. $60 for the matador combo is a bit over priced when the tostones suckeddddddd, avocado was turning brown, and the fries were soggy as hell! The chicken I felt like had way too many brown pieces and not even white meat in it. Thankfully the hot dog pieces were good and the beans and rice were good. I did also like the dressing that was given for the salad. The cashier that was there on a Thursday night was pretty cold as well. No hello or smile! Other than that I don’t think I’ll be coming back here for a pickup or dine in lol."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNueXZYWUtnEAE",
            "text": "Muy buena comida"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURILS0tMHpnRRAB",
            "text": "Excellent food. Mama Juanita's chicken and Aji Verde are so good!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIdW83Mmt3RRAB",
            "text": "The most disgusting food..bad service..la Jalea plate horrible was over cooked and tasted like too chewy..very disappointed 😞…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIeFlfbW53RRAB",
            "text": "Excellent food but getting expensive"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3emZyX3pRRRAB",
            "text": "The music is too loud unable to talk to each other.  Waiters cannot even hear the order being taken from the loudness."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3dGZmWHlnRRAB",
            "text": "El ceviche no es nada agradable mesero me exige tip cuando dan un pésimo servicio"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiMGFTSGlBRRAB",
            "text": "Too pricey though..."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiN3B1Rk5nEAE",
            "text": "The food doesn’t match the price. If they’re going to be expensive they at least give us more portion for what we’re paying."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiOTV5azB3RRAB",
            "text": "Mal servicio pido una orden  para recoger y me dicen 15 minutos yo les digo llego en 30 minutos y cuando llego  x mi orden no está listo . Todos en el celular y en ese momento se ponen a preparar la orden y con el señor de la cocina q no presta el servicio al cliente por estar en el celular con su mala actitud cual es es sentido de pedir una orden por teléfono si no lo van a hacer. La atención da Pichi q decir pésima"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiX29XYlNnEAE",
            "text": "La comida ha subido exajeradamente, un pollo asado solo sin nada esta costado $ 29.12"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiOHBmd0p3EAE",
            "text": "Green sauce is CRACK!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiM0lhLTd3RRAB",
            "text": "Last night on Tuesday July 23rd around 8pm my mother and I went to dinner and I hope we never get the same waiter again because service was terrible. We have never felt so uncomfortable in a restaurant in our lives. We didn’t even want to ask him for water because we thought he would be rude again. He was rude, spoke over us, and kept forgetting utensils, our drinks.. napkins. After eating quietly when we asked for the check, he decided to tip himself $10 … meal was $40. He didn’t want to give us our change back, how dare he. Very disappointed and upset the fact that he ruined my only time with my mom. I hope the manager speaks to him."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN5MU4yb2ZnEAE",
            "text": "We placed our order via Ubereat with assigned time. The order went smoothly and we received it on time. However, it was a little overpriced because of its portion.\n\nWe had their Whole Juanita’s Chicken, Ensalada De Avocado and Mixto. The food tasted decent, especially the Mixto, it was flavorful & cooked properly. What really disappointed us was the whole chicken. We added extra $4 to have all dark meat but it’s totally not worth $27 for these four thighs."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3aXIzRWlBRRAB",
            "text": "Like all the other reviews said, the chicken is great! Got a 1/4 chicken. They ask if you prefer the breast or wing, I opted for the wing. Ordered the sweet plantains with it and it came with basic salad which I was glad for since I opted out of ordering a salad due to the added $8. The green sauce is spicy but a great addition and the spice disappears with a sip of sangria. The sangria was particularly strong the night I went but was certainly delicious. This location has a simple atmosphere. With music playing in the background. It is really quite on a Tuesday night but lots of people coming in to grab takeout. It might be a bit pricy for the atmosphere but it is clean and the portions are a good size. If you're in the area I would certainly give it a try!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5allXYWVBEAE",
            "text": "Menu items are definitely overpriced for the quality they serve. Chicken was dry and fries soggy. They could have packed it better so that the food wouldn't steam itself. Salad was pretty good though"
        },
        {
            "date": "수정일: 5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNemJQU2V3EAE",
            "text": "Updating my review from six months ago. Haven't been here since and this time it was only because the main Pio Pio which is now taking orders to go didn't have any chicken. Ordered the matador combo along with jalea, this time after soooo…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtdzhXU3NBRRAB",
            "text": "I’ve been going to this place since I was little just order anything you won’t be disappointed and also the green sauce is so good you’ll put it on your salad"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJanBtenN3RRAB",
            "text": "I had breakfast there and it was good . But then I have diner few days later and it was awesome 👏…"
        },
        {
            "date": "4년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHME9iTTF3RRAB",
            "text": "Muy mala experiencia hicimos una orden. Y nos trajeron un pedido trocado llamamos  a preguntar. Que. Pasó con el pedido y no recibimos ninguna solución  en vez de. 2 pollos nos enviaron 3 orden de plátanos maduros y yuca  vieja  anexo el recibo de igual manera lo cobraron."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGc3M3Ynp3RRAB",
            "text": "$32 for Lomo Saltiado!? It's really French Fry Saltiado. 5 pieces of meat is despicable for that price."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURvMDQzTVZREAE",
            "text": "To get the best experience ever get the jalea a order of maduro and green sauce and mix the three in every bite and you find out for yourself how addictive this is."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnNGZ5NEdBEAE",
            "text": "Convenient yet service is bad and slow, its supposed to be a fast service restaurant (pio pio to go). tables were dirty, mixed ceviche tasted like it was over refrigerated, sangria taste like fruit punch. Very dissatisfied I have been coming here for years and I've seen how they have lower quality and increased prices."
        },
        {
            "date": "수정일: 2년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyN0tEdVNBEAE",
            "text": "La comida buena, pero la atención da mucho que desear. Opino que deberían cambiar de manager porque ya van algunas veces que voy y el señor tiene muy mala atención, despota y te queda viendo de pies a cabeza, quizas lo deban capacitar un…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDeEx6ZDZBRRAB",
            "text": "Horrible tasting ceviche.. when I ate the ceviche at the main restaurant across the street it was much better and flavorfull. This crevice taste horrible and it's dry. Big waste of $22"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNDbmUtYXRRRRAB",
            "text": "Good food at reasonable prices.\nSorry no pictures of the Rotisserie Chicken, saffron rice and beans ...but I recommend it ."
        },
        {
            "date": "7년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnNk1ibm93RRAB",
            "text": "Amplio lugar donde extrañamente te atienden mejor cuando está lleno, con unos platos abundantes, de buen sabor y con mucho de su Perú exhibido en ellos."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURobFpuV2F3EAE",
            "text": "Very disappointing that I ordered a matador combo that comes with a whole chicken the order comes with a small rice that feeds 2 people when the whole chicken beans is enough for 4-5 when I asked if they can change the rice to a large the…"
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNla3J5MXhnRRAB",
            "text": "Compre solo una porción de Yuca y me la dieron vieja, no se puede masticar, tuve que botarla. Perdí mi dinero."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURteVltUkdBEAE",
            "text": "coworkers have been ordering from the to go locations at least once a week for years, the food has always been great, we would look forward to having a fulfilling meal, however recently the quality of the food has not been the same, either…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqbXNxWjRRRRAB",
            "text": "So sorry to say 😞\nFirst of all I called to place an order for pick up and nobody was answering the phone.\nMy husband and I decide to drive to the place and you have 2 lady's doing nothing standing in front of the register.\nNumber 2\nThe rice had no flavor whatsoever and the chicken was super dry 😑\n\nNever again will I oder from here\nCustomer service hounderous\nAnd the food not as tasty as I thought it was going to be!\n\nWhat a waste of money and disappointment 😞\nFor the price I payed I shouldn't gotten quality food but instead I feel like a got food from 4 days ago !"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqNXFTUl93RRAB",
            "text": "El pollo tiene sabor bueno pero olor feo, las papas fritas no son crocantes, el ceviche sabe como si estuvieras mordiendo el pescado; en mi opinión no lavan bien sus carnes ya que no debe oler a animal vivo sino aroma de carnes preparadas. El local es muy bonito pero la comida no me resulta agradable"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqdl82elNBEAE",
            "text": "Consistently tasty chicken and it's a staple of the area. Your mileage may vary with other menu items. Service is usually good but you may have a different experience from time to time"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKbk1YaUx3EAE",
            "text": "The woman at the front desk was very rude and unprofessional. Called in my order and she never put it in.  Got to the location and she was just as rude in person.  Since I am African American, I believe this is the reason she acted in this manner.  The food was as usual quite good but her attitude just outshined anything that was good."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwdk42OVFnEAE",
            "text": "I ordered a Jalea platter. The platter was served with low quantity of seafood in it. The side of onion had very low quantity too. Definitely not worth the price for it. There’s a huge difference between the To-go Kitchen and the main restaurant kitchen. I would recommend to eat in the restaurant instead of take out."
        },
        {
            "date": "수정일: 8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBeDRqcE5nEAE",
            "text": "Great place good food and service is moderate"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkOWU3bjlRRRAB",
            "text": "They do have 2-3 tables to sit in. However this is mainly for to go’s. The food is just as good and definitely gets just as busy as their dine in section across the street during holidays/ weekends."
        }
    ],
    "reviews_count": 74
}