{
    "name": "Uncle Peter's",
    "place_id": "ChIJ-RWrUqFfwokRBdK7GCBreRw",
    "grid": "QN3",
    "address": "83-15 Northern Blvd, Jackson Heights, NY 11372, USA",
    "rating": 4.6,
    "user_ratings_total": 810,
    "phone_number": "(718) 651-8600",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oeWVqZGFZMjAxTVVVeGFqUTRkWFZqUkhsaFpFRRAB",
            "text": "My boyfriend and I had a great time at Uncle Peter’s. We visited on Halloween Night so it was decorated right on theme :)\n\nThe winning factor for us was definitely the food. The burger was cooked perfectly, the saltiness of the meat and sweet jam with bacon tasted wonderfully together. The pasta dish my boyfriend order was tasty also that I had to eat some too! ☺️\nThe atmosphere was also perfect. It wasn’t too dim and it wasn’t too bright. We will definitely be coming back for more food!"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSURZbmZ0aBAB",
            "text": "Excelente attention of the waiter and the food was delicious and fresh, the wine really good 👍"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxcWNsOVJZa3QwVm1GMExWRTNOblJDWlhWVlduYxAB",
            "text": "I LOVE Uncle Peters but im so so so sad that they removed so many amazing foods from the Menu. I would always come here for my order of goat cheese fritters & delicious carbonara…"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkMk0xOWFZMEpZUjNScVpYWnRMV3hXYUdKQlRFRRAB",
            "text": "Good tasty food that you can always count on!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGNmJFVlhablpUT0hOeVJtMXRPR0ZpV0UxTVdIYxAB",
            "text": "Picked up from here and the food was fabulous and traveled well. Skirt steak, tagliatelle, arancini, peach prosciutto crostini special all delicious. Will definitely be back to eat in person when I can!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkdVgwWmhVbTFSYVhOQlIyZFVXVkJzY25CSlFWRRAB",
            "text": "Had an issue with UbetEats order and the owner and kitchen resolved it immediately. Great food and great people!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25keVNXeDFaREV3VTJsRlRrVnZhelk0VmxNMlJIYxAB",
            "text": "Great place the food was amazing. I would definitely recommend the clams de españa and the grilled octopus 🐙 with the sweet and tangy sauce 👨🏾‍🍳👨🏾‍🍳👨🏾‍🍳"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaWVpVOVlNMDVYYW01b2VYSkRiVk42WDFsU1NtYxAB",
            "text": "Feel like being in Italy.  Delicious food.  Great service.   Cozy and comfortable to talk.   Will visit this place again and highly recommend this place.     I give 5 star for everything ( only if I recommend to others or will visit again )"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WNFVYZE9TV3RLUmxWd1MyZDBVMGhZT1VOM0xYYxAB",
            "text": "I’ve been a loyal patron of Uncle Peter’s for years—dining there personally, hosting business lunches and dinners, and frequently recommending the restaurant to friends, family, and colleagues. Unfortunately, a recent experience left me deeply disappointed.\n\nAfter a dinner, I accidentally left behind a jacket. I called the next day and was told by a staff member that they had it and would hold onto it until I returned from a trip. I called twice to confirm, and both times was reassured there would be no issue. However, when I returned, the story changed. I was eventually told the jacket had been discarded, and when I asked to speak with a manager, I was treated with rudeness and accused of making false claims.\n\nIt’s not just about the lost item—it’s about the dismissive way the situation was handled after I showed patience and trust. As someone who leads a client-centered team in a professional services environment, I believe in accountability and basic respect—neither of which were extended here.\n\nThere’s nothing more I can do at this point but leave this review, and I do so with genuine disappointment."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWR2VsOXhiRVpHTlZJeGMzUTNiRXBPVGpWMFdsRRAB",
            "text": "Honestly, everything was really good, especially the food. My rigatoni was my favorite. My little brother, who’s an expert on calamari, loved this place’s calamari, so that says something!\n\nThe only thing that disrupted our experience was that we had made a reservation and had to wait a good 15 minutes. That was a little inconvenient since we were all extremely hungry. But they ended up giving us a little mini celebration without us asking, which was very sweet of them.\n\nAlso, I don’t really like the lighting of the restaurant. It’s a little too bright for me, and I guess ( I think that’s a me thing). If you like cozy, intimate restaurants, then maybe not this place.\n\nBut I would totally recommend checking this place out because the food is just so good!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKbVQzcDRiV3RhWjNsWlJucEdXbkp5UkZCRFQyYxAB",
            "text": "To Whom It May Concern,\nTo the owner (little short lady)\nFrom one business owner to the next\n\nI’ve been visiting New York for over 12 years, and since May 28th of this year, I’ve spent a significant amount of time—and money—at this particular establishment. The staff has always been amazing, and I’ve truly enjoyed the atmosphere. However, I had an unfortunate experience that I feel needs to be addressed.\n\nWhile sitting at the bar during a lively and loud moment in the restaurant, I received a FaceTime call from my daughter. She was simply showing me some products I’d ordered for her that had just arrived. Everyone around me, including the man sitting next to me, was also on their phones—talking loudly—yet no one else was approached. Suddenly, a woman came up to me and told me I couldn’t be on FaceTime at the bar. I respectfully asked, “Who are you?” She responded, “I’m the owner.”\n\nThere was no posted signage anywhere stating that FaceTime was prohibited. I wasn’t being disruptive or disrespectful. My call was brief and personal. What stood out most is that this “rule” was enforced only on me, the only African American woman sitting at the bar. Meanwhile, other patrons were openly being loud and using their phones without any issue.\n\nIt didn’t feel like a concern about policy—it felt personal. As a fellow business owner, I know how important it is to address any concerns with professionalism and respect. That was not shown to me in this instance. The owner passed right by another customer who was laughing and speaking loudly in Italian and said nothing. Yet, she singled me out. That speaks volumes.\n\nI’ve spent over $2,000 here during this visit alone. I’ve supported this business consistently, and I deserve the same respect and courtesy as every other guest. If there are policies in place, they should be clearly posted and applied equally to all—not enforced selectively.\n\nI’m considering reporting this experience to the Better Business Bureau because I believe no guest should be made to feel singled out or disrespected—especially in a place where they’ve shown nothing but loyalty.\n\nRespect is a standard that should never be compromised, especially in hospitality.\n\nSincerely,\nA Concerned Patron"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xORlMwTTRNRTV6TFhoUVdVZElWWGd3Vm5sc2QyYxAB",
            "text": "literally the best pasta and bread i’ve ever eaten !!!! service was also excellent !!! amazing experience !!!"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnOUs3cWJnEAE",
            "text": "I've been to Uncle Peter's on several occasions.  I always find the food and service to exceed my expectations.  The lamb, pork chop, drinks, and service are all excellent.  In my opinion, Uncle Peter's has the best food in Jackson Heights.  It has become one of my favorite restaurants in Queens."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLM3J0cUdSdDdIb3ZBRRAB",
            "text": "Food was perfectly cooked and seasoned"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKYll4ZFc3c2VLMjV3RRAB",
            "text": "Amazing service from Patricia & Jaime\nGracias por las risas!! Food was excellent we loved the octopus and the pappardelle 🍷💞🐙"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLdXZyTFRncDhUR0p3EAE",
            "text": "I'm surprised,  this Restaurant is being here for so many years and just now , I was invited to celebrate my belated birthday, and I didn't know before about this place. Really recommended , come and enjoy this cozy and warm environment."
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPaUYwOVhucF8tQ2NREAE",
            "text": "Un lugar encantador para una rica cena!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLcTYxTURIeXNyU0FnEAE",
            "text": "I went to this place to meet up with friends from high school that I haven't seen in 20 years. The service was phenomenal, the food was good, and they made a proper old fashion.  I would visit this place again. Looking at it from the outside you may not think much of it. But it's definitely worth consideration."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPMk93c1h0Zy1pOXB3RRAB",
            "text": "Excellent food and service. My family and I have been there several times and each time have enjoyed ourselves."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMajk3dXlUN0phTW1nRRAB",
            "text": "One of the best spots for Italian food in Queens. They upped the prices by quite a bit for Mother’s Day but still worth it. Nice variety of menu! Their table management does need improvement as I had to wait a bit even with a reservation."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VKX1lrcGJnLUpPOVBBEAE",
            "text": "Services is a little bit too long."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMZTN3cEdfdE5fY2ZREAE",
            "text": "The bread course was a delightful start to the meal.  The peach pork dish was truly delicious, a standout choice.  The pasta was simply divine, exceeding all expectations.  I highly recommend this dining experience.  Every dish was expertly prepared and presented."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZOUxQdXNnRRAB",
            "text": "Best Italian food in Queens, the meatballs are marvelous 😋"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvb2U3eWZnEAE",
            "text": "Graet food and ambience"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJbTdmSXNnRRAB",
            "text": "Loved my drink , dinner and dessert."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3cDY3bTh3RRAB",
            "text": "Hamburger was next level amazing!! Chicken parm and eggplant parm was on point! Pasta was enjoyed by the little man as well!"
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRX1ptR2FBEAE",
            "text": "No estaba muy aseado pero bien atendido y hablan español"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnNnI3NzZ3RRAB",
            "text": "The food here was amazing. The pasta was to die for literally the sauce was just right and the portion was just enough to get me full. But the tiramisu was the cherry on top it was delicious. Would definitely recommend for sure coming 10/10 . My new favorite spot . If you haven't tried it please do ."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnNHZ2eVpREAE",
            "text": "Roberto’s service was phenomenal! 100/10. He has to be one of the most attentive server I have received and I do dine out often. The food was also phenomenal shout out to the chefs! This place is a must! This is your sign to go and enjoy the delicious options they have. Can’t wait to go back and try other things! They also made one of the most precious moments in life for me extra special 💙"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBMHBPeTlRRRAB",
            "text": "This is my first time trying this place and everything is good, I loved the crab cakes, I am sure I will be getting it again when I go back. Service is great and the staff is very friendly. I would highly recommend!"
        },
        {
            "date": "9달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfOHAySjRBRRAB",
            "text": "Muy buena atención y excelente comida"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfaElXX3BBRRAB",
            "text": "Hi I would just like to say the food at Uncle Peter’s is absolutely delicious,starting from the drinks, Appetizers, main course and of course, dessert so delicious, highly recommend this place"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmaEpiNUJnEAE",
            "text": "Great black linguini and appetizers, the atmosphere is very nice."
        },
        {
            "date": "10달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2elBQRUZREAE",
            "text": "La comida es deliciosa, y el servicio es excelente, muy amables, y profesionales"
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaMVllT3h3RRAB",
            "text": "This is a real gem in the heart of Jackson Heights! The food, service, and ambiance are all great!\nI’ve been there about 3-4 times now, and they’ve never disappointed."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2M1B5dUZBEAE",
            "text": "My parents have come here for years. And for all of those years, the great offerings, quality ingredients have remained consistent. The fried calamari is delicious. The crab cakes are great both as an appetizer and in their sandwich w/a fresh remoulade spread. Great lamb chops, pasta dishes."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQeW9IRHZRRRAB",
            "text": "Great food and drinks. Staff was extreme"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQMlkyWV93RRAB",
            "text": "My son recommended this place.  I love this place and went for my second time. 1st time, I took my niece and her friend visiting me from California. 2nd time, I was on a date. Food is very, very good and made to order, so be patient.  I also suggest making a reservation. BUON MANGIARE!!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQMXRxSldBEAE",
            "text": "This is the first time I travel to NYC and spend an amazing time having dinner in this luxury and incredible Italian restaurant! I had the best experience ever trying a variety of different dishes and drinks! Best place ever in Jackson Heights, NY. And of course the atmosphere and the staff were 100/10! Don’t miss this spot if you travel or live in NYC"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzalBiYm5nRRAB",
            "text": "Food is so good. Servers are kind, quick, and attentive. I had the bruschetta, two glasses of rose, lasagna, and the chocolate lava cake. My boyfriend had the papardelle and beef ragu and the tres leches cake. He drank a honeymoon and a oh nanana. Everything was really good and I’ll definitely be back in the future."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzZ0p1dkhnEAE",
            "text": "The oficial website not Uber eat. Was charging $17 for grill  Pork chop with  onions, and mashed potato as per picture . I order 3 plates . So per the phone call an ask the   the person on the phone that it was $17 when I got my bill it was $114 Not including tax and tip. Why are they charging me $38 for something else on the menu ,  than what they have on their menu and website. Uncle Peter Staff members should’ve Mislead the customer. I returned the food and didn’t say sign anything.  to be continued 11/10 fraud"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzZ0wzb29nRRAB",
            "text": "Misleading prices"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzN0pLT2h3RRAB",
            "text": "I Thad visited Uncle Peter’s few times. And always get the same impression.great costumer service,accommodating ,but overall the food is always on point.\nHighly recommended"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYbk1yMjlRRRAB",
            "text": "Terrible customer service. We regularly frequent this restaurant, online it says open until 10pm however when we walked in at 8:56pm they turned my boyfriend and I away because we were 11 minutes late. Apparently they stop seating at 8:45pm. We told them we come in at least 3-4x a month but they didn’t care. The place was packed with ppl seated and they still made us walk out. The sad part is the owner was there and allowed this to happen. Don’t support this establishment, they need some customer service etiquette."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYNWI3LWZ3EAE",
            "text": "My new go to place for Italian food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYMHYyUVFnEAE",
            "text": "Amazing place!! Would definitely recommend, food, service & atmosphere 10/10. Superb!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxMTZXU2hBRRAB",
            "text": "New review:\n\nOur drinks were great! David and Jaime are FANTASTIC! THE FOOD WAS DELICIOUS.\n\nWe shut the place down. Really loved our experience. Need to visit more often.\n😍\n\nPrevious review:\n\nThe food was delicious. The service impeccable! Perfect evening. Shout out to Alma what a gem!!!!\n\nSeriously, worth every penny!!! Can't wait to go back. Yummy food and drinks, great service. What's not to love!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURucXBtRkN3EAE",
            "text": "The food is delicious and our waitress was amazing. Thank you so much for a  great time!!! I would highly recommend this restaurant."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuX0pfTXVBRRAB",
            "text": "Beautiful family restaurant..."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuaTY2bkVnEAE",
            "text": "Please bring back the burger !!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaMmRmcF9RRRAB",
            "text": "The service and food here are outstanding. The clams with sausage and lemon sauce were phenomenal. Both fish dishes my wife and I ordered being the Bronzino and the Stripe bass were perfectly cooked. Will definitely be returning. The servers are quick and make great suggestions."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkNnZybFNBEAE",
            "text": "Went here for date night last week. They’re serving up a mix of Italian, Spanish and Argentinian cuisines and I thought that was super interested and they worked super well together. This place was packed on a Monday, always a good sign for a local restaurant!\n\nWe highly recommend starting with that Seafood Salad and trying out a few of their pasta dishes, especially the Pappardelle & Beef Ragu with beef shank, it’s cooked perfectly."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3bDhQZ3h3RRAB",
            "text": "Food was good, but over priced in my opinion. The meatball appetizer had 4 small meatballs but were good. I had the black linguine, good but over done, wish it was more aldente. The coconut dessert was really good, it came with a tangy mango sorbet. The sorbet overpowered the coconut, would be better if eaten separately. Overall wasn’t fantastic but was good. The Sauvignon blanc was delicious and ice cold. For 2 people, 3 drinks, 1 appetizer, 2 main dishes and 1 dessert it was $130, not terrible just wish the meatballs were bigger and the pasta wasn’t so soft."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEbWNma1BBEAE",
            "text": "Uncle Peter’s was a wonderful dining experience! The service was great. Our entrees included the grilled skirt steak and pesto gnocchi. The steak was cooked to perfection, and the pesto gnocchi was very delicious— a great vegetarian option. The crème brûlée was fantastic, and delicious cocktails as well. Everything was top notch quality and there is nothing better than that ✨ would 100% come back and recommend to others 😍"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXc29UaGVBEAE",
            "text": "I liked the ambiance, the decor is pleasant and the dim light makes it intimate. Good food, large portions, and plenty of tasty bread and butter. The staff was friendly and welcoming, but the food took quite a while to come out. I'd go back and I'd give five stars for better execution on the food, while it was good, it didn't awe me."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKLXFfWXZ3RRAB",
            "text": "Came here Christmas 2022, hadn’t been there in almost 8 years and luckily the food and the service are still top tier. I forgot the name of the drink I ordered but it was delicious it had elderflower tea I believe. The Caesar salad was good but the dressing had too much anchovy for my liking. My pasta was really good and it was a nice portion. My friend had the penne a la vodka with chicken (not pictured) and he said it was really good. A dish that I didn’t get but I did try years ago that I’m happy is still on the menu is the skirt steak with avocado side salad it’s so good. The service was so attentive and since we went around Christmas time, the waiters even had a nice little dance number."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURodXVHdGtRRRAB",
            "text": "I recently visited Uncle Peter's restaurant on Northern Blvd and had an overall okay experience. We ordered the gambas Al ajillo for $12, the grilled octopus for $18, and a special appetizer of chorizo y peppers for $14, which were all really tasty. However, our main course, the surf and turf risotto for $45, was a disappointment. The lobster tail and filet mignon tips were fine, but the steak was extremely dry and for that price, it was not very satisfying. We also shared the chicken Milanese which was also okay.\n\nThe service was okay, and the ambiance was pleasant, but overall, the experience was just okay. I have been to Uncle Peter's a couple of times before, and I remember it being better overall, so maybe it was just a rough night. However, for the price we paid, I was expecting better quality food, especially for the surf and turf risotto."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNhbXFUcUJnEAE",
            "text": "We searched a place with good reviews near the airport and Uncle Peter's did not disappoint. Beautiful space including a pretty patio. Our server was Alma from Montenegro and we had literally just landed from a trip in Croatia and Bosnia so it was fun to speak a little of the language with her. She had some great recommendations for us and I believe she made our cocktails as well which were delicious! I love lychee martinis! We ordered the octopus to start and it was heavenly. Did not taste fishy whatsoever and had a beautiful grilled taste. The brancino was yummy as were the rest of our dishes. Oh, bread and butter were super delicious as well! This will be our new spot when we have long layover near JFK in the future! Good food, good service! Hvala!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXZ0lPR2FBEAE",
            "text": "Came here over the weekend and had a great experience. Inside is nicely decorated, the staff were super friendly and accommodating, and the food was great! Their cocktail menu is pretty large and they have a bunch of special drinks that you…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzbmFIbXpnRRAB",
            "text": "You will feel at home. I've been coming here for years and they only get better. They care about their customers and thier business.\n\nThey invested in the decor and the staff since they stick around. Drink and appetizers come out as quickly as you will drink and eat them. The specials menu you is something to look out for, since it features a bit of culinary creativity.\n\nThe only con is liking a special and not knowing when it will be offered again.\n\nCome and enjoy a true classic. Ricardo was amazing!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMweVA2RE9REAE",
            "text": "Delicious food & great service! I’ve lived in Jackson Heights for 20 years and for some reason I have just discovered this place. A very pleasant surprise indeed! I have already eaten here three times with my family and every time has been an excellent experience."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSbkxtbVlBEAE",
            "text": "Great dinner on a nice n quiet evening. Nice ambiance n background music. Delectable scallops n polenta fries & salmon as an entree. Thoroughly enjoyed Roberto n Mario’s friendly and attentive service. Cheers to you guys🫵👍👌‼️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkMGJiSWZBEAE",
            "text": "Me and my girlfriend got Uncle Peter’s for dinner the other night, and I have to say, I’m impressed.\n\nSometimes Italian food, boxed up to-go, isn’t always great when you get home to eat it, but that’s not the case here. Uncle Peter’s has some really great pasta options, and some stuff that are a little outside the basics you might normally see at an Italian restaurant.\n\nMy favorite was the braised beef pasta. Really flavorful and a nice departure from something more basic like a spaghetti and meatballs dish."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXN2F5QUVnEAE",
            "text": "Nice cozy restaurant. Staff was very friendly , no one was rude and everyone was smiling and happy.\n\nI had the Macarena drink, excellent\nBruschetta, excellent\nThe Lamb Chops , excellent\n\nAn awesome place for a romantic dinner or a tasty meal .\n\nAsk for Mario."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqaXJLRnZ3RRAB",
            "text": "Definitely a landmark in the Queens community.   Classy , outstanding menu , good service ,  welcoming atmosphere. Offers happy hr and always mixing  n shaking with the drinks!  A must if you are in the area."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwcXVPLW1nRRAB",
            "text": "Food was so good, grilled octopus so tender , black linguini Fruttii di mar was so fresh. The grilled lamb chop and Sirloin was cooked to perfection and the whipped mashed potato was so creamy like a cloud.  Definitely coming back again"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5bWFiaUpBEAE",
            "text": "The beef ragu was amazing. I also had the meatballs topped with whipped ricotta as an appetizer and let me tell you it was done to perfection.  10 out of 10 would recommend. The only issue is the location is parking but that issue is prevalent everywhere in NYC nowadays."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSeko2YjBBRRAB",
            "text": "My mom and I ordered take out from here. I really enjoyed the chicken francaise and the tasty mashed potatoes. The chicken dish came with a hand full of noodles as a side. I wish they would have added a bit more of the spaghetti along with the chicken.\n\nI have to say…. The lasagna wasn’t good. Flavor was a bit bland and the interior was a little cold. I hope this is a one off mistake but it turns me off to ordering takeout from here again.\nFor dessert we had the tiramisu. On Uber eats for these four things the bill was $97. So for that price you would think it would be a bit better.\nThis is the reason they get 3 stars."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtd2RlRkpnEAE",
            "text": "Easy to drive past with how bustling Northern boulevard is but definitely a great stop for food. Fully stocked bar and plenty of tables available inside. The service was quick and the food was an emphasis on quality over quantity from the appetizers to the desserts. Forgot to take a photo of the calamari before devouring it but would recommend it."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHa04tcUJnEAE",
            "text": "Ordered takeout from them and was super impressed so had to try dining inside.\n\nThe service and food were ON POINT! And the place was super clean\n\nDefinitely going to become a regular"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKcHRUY01nEAE",
            "text": "Food is tasty, nice atmosphere, pleasant staff but food is definitely too pricy for the small portion served. We were a big group we had a great time but won’t be back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCNFlYN3l3RRAB",
            "text": "The food was very good. It's a small cozy Bistro. The staff was friendly, I removed stars because although they were friendly it was a less than attentive. It took a abnormal amount of time for wine and soda to be brought to the table. They also forgot to place my order, and I was the host. Also, the was some wierdness with bringing more bread to the table even though entree came out five minutes before dessert. They could spruce up on service and/or communication. Overall they treated my daughter well for 16th and everyone was happy with the meal and staff."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5N3FLMGNBEAE",
            "text": "Uncle Peter’s is definitely a local favorite: birthdays and special occasions. Delicious food combinations and well presented dishes. Outstanding service."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxbU82YzVRRRAB",
            "text": "This was a Belated Birthday dinner. I don't know how much was spent.  I shared grilled vegetables appetizer and I had real potatoes mashed, chicken marsala moist and delicious sprinkled with  parmesan cheese I like cheese.\nThe food was Great, so was the staff one of my servers was Mario really nice courteous young man. The   atmosphere and temperature were GREAT!!!!\nNOT  hot  or stuffy. It is also Handicap  accessible♿"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHZ2JibUpnEAE",
            "text": "This is a little piece of heaven in Queens. Everything from the free bread and butter to appetizers and desserts were absolutely amazing! Wish we lived here so we could keep coming! Got the bruschetta, steak, seafood ravioli, and lava cake. Would do it all again and again and again"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNybGNDVTJ3RRAB",
            "text": "Great spot with good food! Went there on our trip to NYC for our anniversary and it did not disappoint."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHbG9ydGJBEAE",
            "text": "This is our first time here and LOVE the food and drinks! I had the Lychee Martini and cheese ravioli in a cream pesto sauce….both were AMAZING!!\nAll the staff were awesome and engaging!! Glad we came here tonight to eat! ❤️❤️❤️❤️"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzODlQWXBBRRAB",
            "text": "Food was delicious 😋 and the staff super courteous and knowledgeable in wine selection. Definitely a place to come and enjoy a wonder meal.…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsb1BET19nRRAB",
            "text": "I love eating here. All servers are amazing, the attention is on point, the food quality delicious. Anyone who asks me for the best italian restaurant I’ve ate at- I send them here and they love it!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoNW9xVEdBEAE",
            "text": "I would have never thought of craving Italian food and thingking of Jackson Heights, but my wife and Ifound a jem!! The food was outstanding and great service from the staff definitely on my favorite restaurants to go back"
        }
    ],
    "reviews_count": 80
}