{
    "name": "Florence Prime Diner",
    "place_id": "ChIJd3MRj5ZfwokRNWWbShPE6do",
    "grid": "QN3",
    "address": "40-13 82nd St, Elmhurst, NY 11373, USA",
    "rating": 4.8,
    "user_ratings_total": 386,
    "phone_number": "(718) 779-0033",
    "reviews": [
        {
            "date": "14시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsaGQwZDFRa2x2VWxkRlowNHRjVGhoZVhOM2VIYxAB",
            "text": "We’ve been there twice now and both times were fantastic.  These were the breakfasts we had, huevos rancheros, chorizo & egg, chilaquiles. All were excellent and the coffee is great too. Staff is wonderful, friendly and extremely good at their jobs. Can’t wait to be in the neighborhood again to go!"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWSFgzZFNXV2xIZEZJNGVteFNSSE4yZHpCVVRHYxAB",
            "text": "Great service, awesome breakfast options!"
        },
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGTk1qVkRlRzQwVDFKSWNHdG1NemhyYW1odFIzYxAB",
            "text": "Amazing experience here! Went for breakfast, the place was clean, staff was friendly, but most importantly the food was on point. Best steak ive had in a while- it was juicy and perfectly seasoned. Fries were perfectly crispy. Will come back!"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xScFNHVnFhMVE1V1hkNloyZGZZak5qV1dwWU9VRRAB",
            "text": "Went for brunch to celebrate my birthday .,, I had Rib Eye Steak and Eggs ., meat was juice and tender .,, but what really got me was the pumpkin cheese cake with almonds .,, a will give them 10 of 10"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZeE5qTnJZbWxGWVZWaVVIUlpaRWxFYzNWamFYYxAB",
            "text": "Disappointed after seeing 4.8 reviews. We went for Sunday brunch and food was average. We had salmon omelet that that was undercooked. Salmon Benedict came out with runny yolks when ordered medium poached. They corrected it. Tiramisu was mushy not much cheese. Coffee was good. Staff was attentive and service was  good. Not worth the trip though. This is a restaurant not a diner."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taVk9HdG1YM0UzT1ZadVpYaHhjalYxTlVkcVRtYxAB",
            "text": "⭐️⭐️⭐️⭐️⭐️ Review by Vanessa Caballero\nDate: Saturday, October 18, 2025\n\nI was born and raised right here in Jackson Heights, and I’ve visited many diners in the area over the years—but Florence Prime Diner truly stands out as one of the very best.\n\nWe visited on Saturday, October 18, to celebrate both my birthday and my daughter’s 11th birthday, and everything about our experience was absolutely wonderful.\n\nThe chicken soup was outstanding—rich, flavorful, and full of fresh vegetables. It tasted exactly like homemade chicken soup, the kind your mom would make when you were little. The broth was perfectly concentrated, and for that delicious soup alone, I give five stars without hesitation.\n\nThe coffee was excellent—fresh, smooth, and never bitter. The staff offered refills generously, which made our breakfast even more enjoyable. I would easily give the coffee a 10 out of 10.\n\nWe also tried the mini waffles with berries, which were light, fluffy, and perfect for sharing. My daughter had the green chilaquiles, and they were exactly as we requested—not spicy, since she doesn’t eat spicy food. They came beautifully served with rice and beans, and she loved every bite.\n\nFor my birthday meal, I ordered the carne asada, cooked exactly the way I asked—tender, juicy, and full of flavor. It was served with two over-medium eggs, potatoes, and a fresh salad. The meat was so soft that it was a pleasure to eat and enjoy every bite.\n\nTo make the celebration even more special, the waiters kindly sang “Happy Birthday” to both my daughter and me, bringing a cheesecake topped with fresh berries. Everything was so fresh, delicious, and made with care.\n\nOur server was incredibly kind, polite, and attentive, always checking in to make sure we had everything we needed. We truly appreciated his warmth and professionalism.\n\nIt was a lovely family moment—especially since my son, who is currently away at college, joined us to celebrate. The atmosphere was cozy and welcoming, making our birthday celebration truly unforgettable.\n\nWe’ve often walked past Florence Prime Diner, but this time we decided to stop in—and I’m so glad we did. From now on, this will be one of our favorite places in Jackson Heights.\n\nTen out of ten for this beautiful diner—thank you, Florence Prime Diner, for making our birthdays so special!\n\n— Vanessa Caballero"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0YWJVMUlTVkE1VTA5T1NIRkNZV2RpVDJONE9XYxAB",
            "text": "I stayed in the queens area for my trip to NYC and this was just the best brunch spot!! Amazing food and service! 100% recommend"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5bVFXMTVkWGxzTFd0UGFVRmlabmMzUVVWR1UzYxAB",
            "text": "My quick trip to town was improved by this restaurant. The food quality speaks volumes. It was a happy coincidence discovering this restaurant. Restaurant team members are genuinely nice. The community welcomes this spot."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWVlRraGplRkE0T0c1SVdsZDZZV0p5Ym14YWJuYxAB",
            "text": "I absolutely love coming to Florence Prime Diner! Everything about this place is exquisite!! From the music that sets the perfect mood while you eat, to the delicious food, and of course, the outstanding service provided by their wonderful team (Kacia, you rock!). It’s truly a perfect blend that makes this spot a must-visit in Jackson Heights."
        },
        {
            "date": "3주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoTmJrNHpRVFIyVDI5eWVFdFFka0pxTVdaRGMzYxAB",
            "text": "Muy buen lugar recomendable los chilaquiles estaban uff y los French toast ni se diga la atención excelente 10/10"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0RFlYUk1lRkJZZUZSM09FeFhRVVZyUVhZMVIzYxAB",
            "text": "Food and service is always great! Highly recommend! Support small businesses <3"
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvbzdpT1dBEAE",
            "text": "This is The perfect place to enjoy with friends or family, in the heart of Jackson Heights but it is  like you were out of the world of Roosevelt ave. Delicious food, cocktails, I love to enjoy a good glass of wine!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tVdGRVVnZhbEZoVURsdFNXWlpPRkZYY25WTlRXYxAB",
            "text": "Little over priced"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GWE1EbEZkRXBCWjBoNWVHb3ROemwwYW5Ob2JIYxAB",
            "text": "This is honestly my favorite restaurant in the neighborhood. Every dish is done better than you’d expect; both the ingredients and the presentation, often the portion sizes too. It’s a good cross between a sit down restaurant and a diner."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKbWFqTlFVRlp2ZVVaSlZHZGhRVzVOV1VsMmQwRRAB",
            "text": "Glad I found this gem and rushed here before my flight back to Ohio. Food and atmosphere is great!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21NNGFIbENkRk15TjBaT1J6ZGhVWEJZUjBKNFpsRRAB",
            "text": "nothing like your regular diner."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xnMVVVOVpSa0ZuVVROek9WWkJWelpoZVdKbVUzYxAB",
            "text": "My favorite place to eat, great food, great  service, always ready to greet you with a smile, and like I food is delicious, prepare fresh, breakfast, lunch or dinner, great cocktails as well, you won't be disappointed"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjNFV5MTRWM0EwVUdoT1YwVlJUMlF3ZWs4eFNYYxAB",
            "text": "Wow!! Can’t believe we found this place by accident. Best huevos rancheros I’ve had in the northeast! Incredible bottomless cafe con leche for only $3.50 is unheard of"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wWllsVlNSMk42V0ZKU1JXcFZkRUoyVlc0MllYYxAB",
            "text": "Food, drinks, and service were great! The steak quesadillas were delicious AND the classic mojito! Service was attentive and hospitable. Would come here again!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWd09HNUZVRUpKVVdGR0xXcDVhMFpSYm5wMFYzYxAB",
            "text": "Good food . Better representation."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GYWJYbENhVWhPVFdWWWMwNUliVnBVVWtGNWVGRRAB",
            "text": "Great huevos rancheros, excellent staff, quick service, spotless place.  Only critique is disco soundtrack, which tho cheerful, is relentless and not conducive to dining"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1S0xXRTJUVFJOVm5aYVMyRmFWa3B5TkhFelRWRRAB",
            "text": "Pleasantly surprised! It’s definitely a hidden gem in Queens. The reviews brought me here! I went for breakfast and OMG I will be back! The food is perfection, the staff is uber friendly and the ambiance is a hip vibe! It’s a nuvo take on an old school diner! I’m going to try them out for lunch real soon! It’s right off the 7 train 82nd St.  stop."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sb1JVaE5kMHBrWXpKS2FrMVFWa0ZhT1RoMk0yYxAB",
            "text": "The food is always great here, in particular the chicken dishes. Highlights are the grilled chicken panini and the buttermilk fried chicken sandwich. The coffee is also really good! A solid lunch spot in the neighborhood."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tacWNubDRiSGxzWW5aellXRTFXV1ZYVW14TlVVRRAB",
            "text": "I had a terrible dining experience at Florence Prime Diner. I sat down at the bar excited to try this new place as I work one block over. The gentleman in the photo took my order for a glass of white wine and 2 tacos. Next thing I know, I’m being served red Merlot wine and only one taco. Then they tried to gaslight me by saying I only ordered one taco. The shrimp taco was one of the worst I’ve ever had. Dry, bland and expensive. I am very surprised at the positive reviews for this place as it was a complete disappointment.\n\nEdit: So look at this, again claiming things that are inaccurate and portraying your business in a way that is completely false. I ordered two tacos and a glass of white wine. This very “difficult” order was straight up messed up twice. It wasn’t that I “tried” the shrimp taco and now was trying to order another taco. Love that you’re trying to misdirect the review. The business is a reflection from top down and one can clearly see how poor this business really is. Shame on you."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjeU5VVTNjMEl6UTNabFRGVnZSSEYzU20wemJWRRAB",
            "text": "The food was executed perfectly. The whole staff took a precious care of us. Everyone of the team did an amazing job. Beautiful experience in the neighborhood. Thank you. it’s been a blast!"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4SmNFczRlRUYwUjBWT05VRmFXVW8yTVVsRWMwRRAB",
            "text": "Simplemente espectacular lo recomiendo."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxb05teHFTVWRKZG1kblJFdHJUWEpQWjJOblNHYxAB",
            "text": "Food was very aesthetic but tasted mediocre. Overpriced for the taste and the portion size. Drinks tasted good though! The place was pretty warm, and it got very uncomfortable toward the end of the meal. Staff was very friendly and efficient. Just a note, there’s an automatic 3% surcharge if paying by card!"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFNFlXWlhUbk5wZVZWeFR5MUdOelJrUjJ0a1IyYxAB",
            "text": "Vine a celebrar el cumple de mi amiga y el lugar es super acogedor y limpio me voy completamente feliz y satisfecha Me ENCANTÓ! La comida es super deliciosa y la atención me parece muy buena.\nGracias por el buen momento."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1VFRXaFVVMnBCTTFOVGJWSlBkMU5OWHpkNlVtYxAB",
            "text": "Great dining experience!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aTGFWZzRjSFpaYVRnNE5XNDNSSEEwZFRWbE1IYxAB",
            "text": "I came here for breakfast with friends. I was impressed with how well it was decorated. Service was super friendly and quick. We all enjoyed everything we had. I can’t wait to go back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxSlVqbE5iMDFXZGtSSFVuQk5iV0ptWXkxdlpHYxAB",
            "text": "Couldn't recommend more! Fantastic diner with amazing food and drinks!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxa2NuZFhiM1Z1YmpkVE5pMUlRMnROUmxaTU1VRRAB",
            "text": "My partner and I had some extra time before heading to the airport and we stop by here for breakfast. What a lovely restaurant! We had the Chilaquiles Verdes with some green hot sauce and WOWWWW! That was good! I also had some cantaloupe juice. 10/10."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlcWJ1OUdBEAE",
            "text": "Have eaten food from all parts of the menu, have never been disappointed.  Food is ridiculously good. This is hands down the best diner type restaurant I have had the pleasure to eat at, and, in my opinion, the best restaurant in Jackson Heights. The Huevos Rancheros rival now closed El Rico Tinto's. Really nice atmosphere. Spacious and clean. The shrimp al pastor burrito is delicious. Kudos to a great addition to Jackson Heights. I have eaten there for weeks in a row now.  It is my Sunday go-to for brunch! And the staff remembers me when I come in."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201R1RITmFTVXRNTWxSTmJsRnRaVmxHTlV4TWQxRRAB",
            "text": "This is a gem 💎 in this neighborhood.  Very good egg Benedict including service,   place is clean,  Great variety for a Sunday brunch and service is fast.   Full bar available too.   Will return"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4cFZsaFdTWGxIUVZsclYzbFFVbVZtZDNkTVFXYxAB",
            "text": "My husband and I came here for brunch. The service was so good. Very attentive without being overbearing. The food was so hot it burnt my mouth but was absolutely delicious. My husband had the steak sandwich and I had an egg platter. Very cute spot. They have a lot of bar options for drinking. We will definitely be back again."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJX3lvLUtKbTd5Nk1nEAE",
            "text": "Food was soo good. And the service was great as well"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOS29qT09TOVozMl93RRAB",
            "text": "So good and excellent service! I got the chicken and waffles and it was amazing!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VQUDRsTldVNU1Hbkx3EAE",
            "text": "Food was honestly amazing. No complaints. Everything was perfect. And amazing for the price. The only reason this place didn’t get 5 stars was because the bar is extremely slow and we received our drinks after receiving our main courses."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNajE5UGp5OGNXMGRREAE",
            "text": "The food was so good I almost personally complimented the chef with a kiss on the mouth"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VKblgzcGltdE5pTEVBEAE",
            "text": "Great spot in Jackson Heights! Good food well priced and the service is great. Portion sizes are a little small but that’s my only knock on them."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2a0pEZlV3EAE",
            "text": "Went here cuz I could have sworn I saw blueberry pancakes on the menu. They don’t have them. Had the huevos rancheros instead and they were good. Another time I was here and had the burger while my friend had some sort of dish with Al pastor maybe, can’t remember exactly and it had a lot of gristle. That time I had to send my burger back as well. Breakfast this time around was a better experience so maybe that’s what they’re great at."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VMelZ6X0x6M3FiR3hnRRAB",
            "text": "Friendly staff and food are not bad\n\nThe potatoes with the omelette is especially good.\n\nPancakes are good, berries are sweet."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMVDB2cUx6cmVPUHRnRRAB",
            "text": "A pleasant surprise. Unassuming, unexpected, and a spot not to miss. Try the chilaquiles and chicken sandwiches - worth it"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKN3A4Wk80eUlPeTBBRRAB",
            "text": "Dónde puedo empezar, la mesera era muy nice y tenía conocimiento del todo el menú. Me gustaría decir que este restaurante es el mejor en la zona!   the food is very thoughtfully preparado and delicious  a hidden gem as my lovely boyfriend calls it! You have to try the mango coconut desseert, cambio mi vida! Gracias ❤️"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKVEJ4dnF4cnF2SmxnRRAB",
            "text": "OMG! I was very astonished by the service and care they offer here. Very welcoming, fast, and caring. And they do have high chairs for my 9 month old baby, which she loved and savored all the food there. We had an amazing time, and the atmosphere was great. I was even very surprised they had a bar also. Prices are very affordable 👌, I'm happy because we didn't even have to ask if our appetizers were ready. Literally, we waited for all our food, including the main dish, no longer than 15 min tops. When we Sked for recomendensions, they were literally very specific, including they gave us to try a delicious dessert. We will come back. My family had a great time"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURsOGJhTDlnRRAB",
            "text": "Staff is welcoming, the food is great."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPeU5xSjdzemRlMHR3RRAB",
            "text": "So yummy!!!!"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNNmlqcF95c2F1TmZBEAE",
            "text": "Me gustó el ambiente relajante y limpio, el desayuno estaba muy bueno, todos muy atentos y serviciales."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZLWJYZXJRRRAB",
            "text": "Exceeded my expectations for food. Will be a regular spot for me"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZdXEzRWxBRRAB",
            "text": "It was our first stop and the service was awesome. Cassie was super sweet and welcoming! And the food hit the spot."
        },
        {
            "date": "2년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4N2I2UC1nRRAB",
            "text": "한식이 아닌 다른 음식을 먹을 기회가 생긴다면 적극 추천하고싶은 맛집"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNINnByLUh3EAE",
            "text": "Came here because it had good reviews, it sure did live up to every expectation.\nWalking into the restaurant, nice atmosphere, bar, seating, counter, seating, and tables available, you get to pick where you sit. Servers were attentive and walking around, just in case you needed more water or to clear your plate.\nMy day, and I got a nice selection of food, and totally enjoyed every bike. Great flavor, not too much spice. We got crabcakes to start, eggs Benedict, he got tacos, I got a Greek omelette, but we shared. Not a lot of diners do fresh squeezed, orange juice, so I was pretty impressed even by that.\nAtmosphere for Brunch was very inviting, their specialty is a seafood pasta which I’ll definitely be going back for. And this place wasn’t too pricy, which is definitely a pro.\nStaff is also multilingual, so if you’re going here with friends, like my date, they can communicate other than in English"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMOF9xc1lnEAE",
            "text": "Go here!  Best breakfast with fresh squeezed juice. Please.  I'm not begging. After over a half-dozen times with\nmy family, and by myself, I am confident that my opinion crosses most of their ambiance, friendliness, and (how can I possibly forget) menu and portion size. Everything, yes, everything, has not only exceeded my expectations but shared by absolutely everyone I've invited.  This is truly a refreshingly wonderful experience of friendly interaction with owners, staff, and food that I rarely experience despite over multiple years in New York City.  Whilst I've experienced plates getting smaller and more expensive, with wait staffs more defensive; well, this one stands out by so much more than a kilometer, mile, or by whatever ... including generous and very delicious portions.  Enjoy!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzLU1HNXVRRRAB",
            "text": "I ordered a chocolate pancake it was 5out of 5. Great portion size and warm maple syrup it was amazing. The skirt steak sandwich the first in their Sandwich menu’s, we asked for medium rare, it was a little bit over cooked however the seasoning of the meat was great, warm and fresh bread that made it taste warm we asked salad as a side for sandwich, it was not my favorite since there was a fruit (not mango)that I couldn’t find what was that and it made the flavors unbalanced. The service was really good and fair price. I see myself come back for the pancake."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnNlpQYWxnRRAB",
            "text": "What a gem! Great atmosphere, incredibly friendly staff, amazing service, and really wonderful food. I mentioned “I won’t eat the bread anyway” and the server offered a lettuce wrap. He also offered this amazing, intricate salad in place of the fries. We even paid for parking with those stupid meters around here that only take coins (what era are we living in?!) and it was totally worth it."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNadzl2Ym1RRRAB",
            "text": "Honestly a great value for great quality food. The sesame salmon was extremely good. I liked the sauce and mushrooms a lot. The octopus salad is a a big portion and the octopus is nice and crispy. I also really enjoyed pozole it was delicious and spicy with the side condiments. The tostada was standard. The chicken sandwich was juicy with great bread and a good amount of avocado. The liter of fresh tamarind juice was great and the service was fast. The location is inconspicuous past Roosevelt you’d almost miss it but once inside is pretty colorful and clean."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNacnJpYmhBRRAB",
            "text": "My boyfriend and I were looking for a new place to brunch in Jackson Heights. After reading all the great reviews, we had to try it for ourselves and we were not disappointed! Ruben and the rest of the wait staff were so attentive and friendly. The food was very delicious. We will definitely be back soon! :)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUdmQ2QUp3EAE",
            "text": "Went here for breakfast this Sunday. The place has a nice vibe, the waitress was very friendly and knowledgeable. The menu was interesting enough to make me want to go back. I ordered the avocado toast with a cappuccino and my partner had chicken and waffles with an espresso. We also got fresh orange juice and watermelon juice? Idk it was frozen, but delicious."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKaU5QbTNBRRAB",
            "text": "In all my dining experiences, this diner stands out as a true gem. It exceeded my expectations in every aspect, making it a remarkable exception. The food was simply unbelievable, leaving me in awe of the culinary mastery showcased. The staff's attentiveness further elevated the dining experience, ensuring that every need was met with care. The relaxing atmosphere added an extra touch of tranquility, making it an ideal place to unwind. I eagerly anticipate my next visit, eager to explore more of their enticing menu offerings."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSNk5QN01BEAE",
            "text": "It was a lovely place for brunch, it is hidden in Jackson Heights. Ordered 4 different plates and all was amazing. Their cappuccino was also delicious!\nServer was also great!!\nDefinitely recommend it & will return."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4dGZPbmR3EAE",
            "text": "Florence Prime Diner is my new favorite diner. The food here is amazing and flavorful. I had the Huevos Rancheros which came with rice and beans, which was great. The Chicken Caesar Wrap was great: flavorful with great proportions of chicken, croutons, and veggies. Service here is amazing as well and the prices are extremely reasonable. 10/10 would recommend!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfcklPZWlnRRAB",
            "text": "Love this place! Menu has staples and unique dishes, all quality. My family loves this place, great friendly service. They have good drink options and great espresso options which is unusual for a diner. Highly recommend the beet salad!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSOXJ2ZUxBEAE",
            "text": "Wonderful, delicious, and great quality restaurant! I always look forward to coming back and trying new things off their menu since everything I’ve had here so far is delicious. I highly recommend the Chicken Quesadilla ESPECIALLY with their House Salad, it’s such a great combinations of unique tastes. I also really enjoyed the Florence Burger which came with delicious regular and sweet potato fries. Can’t wait to come back again!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMbnVmMjR3RRAB",
            "text": "Update:  came back for dinner after my first visit last week for breakfast.  Dinner was even better!  This place is a gem.  Food is fantastic quality.  Vibe is great.  Initial review:  Food was great.  Service was perfect."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2dk8tYWh3RRAB",
            "text": "So happy with my brunch today. The food was delish, the service was quick. All the waiters were very attentive. I will definitely be back!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoNXZ1Tk9nEAE",
            "text": "I just walked in as I was famished. My first visit to this new place. A genuine welcome by Luis with a smile. It felt good. Beautiful ambiance, nice n clean place. Chef Julio was kind enough to make me an off the menu, grilled cheese S’wich with onions and Tom. A hearty portion! Loved it. Tho it wasn’t grilled…😉, but filled me up 😋👌👍😀‼️ Very courteous and attentive service by Luis. Def will be going back to Njoy more menu dishes."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSdmN2dDF3RRAB",
            "text": "Went to FLORENCE PRIME DINER in Elmhurst for a beer since I noticed they had some on tap. Sat down at the bar and asked for a Guinness on tap. Pour was good with the right amount of foam, and it was at the perfect cold temperature.\n\nSeeing people eating around me, I asked the wait staff what their best sellers are. One of them was Seafood Fra Diavolo with Shrimps, Calamari, Mussels, Clams and Salmon in a spicy marinara sauce.\n\nThe pics should tell it all, but realized that I should have taken more pics as I devoured the dish. Least to say, I was pleasantly surprised by the dish.\n\nThe Seafood Fra Diavolo was served on a 12-inch plate with a side of toasted baguette. As you can see in the pics, the plate was full of seafood goodness. Another pic after a few bites and the last pic with the final shrimp to finish the plate.\n\nThe seafood tasted fresh and not fishy. And the sauce, the sauce tasted like it was patiently cooked by an authentic Italian chef, was so tasty and not watery at all with the noodles cooked al dente. The spice was just right, but I did tell them that it should be much spicier for me next time.\n\nOverall, I enjoyed the taste of the dish a lot.  I was stuffed with no room for dessert. Great choice.\n\nWill I recommend Florence Prime Diner???\nOH YEAH!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNCaHB2MnRnRRAB",
            "text": "Fairly new to the neighborhood and I hope it does well! My husband and I have come here probably about 4-5 times already, each time trying something different. Everything tastes awesome. The servers are attentive and the restaurant is always clean and I love the aesthetic. I don't know what they do with calamari and the red sauce but it's sooooo good! Must try!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKcU16ODdRRRAB",
            "text": "A hidden gem in Jackson Heights! The setting is beautiful, and the service is great.  The staff is very friendly and nice. I came here twice and it didn't disappoint.  I do love their breakfast, and their portions are a decent size. I loved their omelet and french toast. Es un ambiente bonita y los travajadores son de buena onda."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuanZ5ZlpREAE",
            "text": "one of the best diners in nyc if not the best. it’s a hidden gym of nyc. fantastic presentation of food, delicious food and quick service! definitely my go to diner and would recommend to friends and family."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqcHBfcWpRRRAB",
            "text": "Great food, however we did have to wait quite a while to get our food, on top of that the waiter kept forgetting our order, drinks, food etc. It was pretty busy however they seem to have lack of organization. Regardless of this I wouldn’t mind giving this place another try since the food wasn’t bad but waiting an hour for pancakes didn’t seem worth it."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKcnB6OFp3EAE",
            "text": "Great little place for breakfast, brunch, lunch or dinner! We went there for the first time for breakfast, and they had a great selection! Dishes were really good, and the latte was good too. Service was great, and the best part was it was super clean and we'll designed. Will definitely be going back again!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5aHNpeTRRRRAB",
            "text": "I love Florence Prime Diner!  This is just what the neighborhood needs!  I like to get the vegetable quesadilla, caprese panini, cuban panini, and I love their avocado toast for breakfast. They serve breakfast all day also so that's great. Definitely check it out if you are in the area. You will love it!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRNXJtSkdBEAE",
            "text": "Service was okay-ish,they were a bit busy so it makes sense,but there was this specific server who was amazing,he kept checking on us and making sure everything was okay. Food portions are good and definitely try the pancakes! Will be back soon!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBbGRuRC1RRRAB",
            "text": "The food was amazing, service fantastic, and price is fair. I can see why such a high rating 👍 Home made style chicken soup, and a pasta with chicken dish, both very good."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNobl9XT01REAE",
            "text": "I liked the quirky breakfast pizza. The pancakes were dense and not very flavorful. Regardless, the food tasted fresh. Service was great: attentive and friendly. It's certainly inexpensive, though I wish the quality of the food were a bit higher."
        }
    ],
    "reviews_count": 76
}