{
    "name": "Jax Inn Diner",
    "place_id": "ChIJO-oR2QhfwokRvjuJMXycfg8",
    "grid": "QN3",
    "address": "72-12 Northern Blvd, Jackson Heights, NY 11372, USA",
    "rating": 4.3,
    "user_ratings_total": 3118,
    "phone_number": "(718) 476-1240",
    "reviews": [
        {
            "date": "2일 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21FNVlWTkZka3hZYVVWd1ozVndRa1ZOWlUxdWEwRRAB",
            "text": "Muy mal servicio, me quedo corta con decir asi, muy mal serciio no lo recomiendo"
        },
        {
            "date": "수정일: 6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3djhuQUJBEAE",
            "text": "My breakfast spot when I getting an oil change from my car dealership."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tNNE5UVmZTVGhSVURoWWNtZDROVk13TUdneFNtYxAB",
            "text": "this is a classic style diner the food is great the decor is nothing special a little boring but again it's the food the reason to come here is to get a very tasty burger and other diner fair"
        },
        {
            "date": "수정일: 1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnNHQ3WmpnRRAB",
            "text": "Excellent food and service. I'm never disappointed."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OWVRtSkdOblp1WjBNMVRWUm1OVVZuVTJsdWJrRRAB",
            "text": "Ok"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twVFJtaHRaV05wWldkaVIxVnFOa2hvZFhkR05uYxAB",
            "text": "EXCELLENT 24/7 DINER IN JACKSON HEIGHTS"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xSU5tcEtWWFExYVZCWFkxRnJSemxrZWxsNmRFRRAB",
            "text": "Wife’s doctor and Mazda service center nearby so been here a number of times in the morning over the last few years. First time I got chocolate chip pancakes and I’d say they make some of the best pancakes in NYC. Fluffy, tasty, great mouthfeel. Quality and consistency over many visits. So 5 stars definitely for them and the service.\n\nEverything else is pretty good/above average diner food. Can’t go wrong eating here."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVMVUzQk1PR3BpWDNsUVMwMXBabEZ3U21wWFIxRRAB",
            "text": "The restaurant shows skill. The dishes here impress with taste and quantity. This place earned my highest regard. The complete workers offered kindness and guidance. This spot is wonderful!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Wc2FISnBXSE54V2s1WlRHRTJZM0oxUVhoalNsRRAB",
            "text": "I tried several places near the LaGuardia airport.\n\nI saw Jax Inn Diner that is open 24/7 was packed and drove around for 20 mins looking for parking.\n\nOnce I located a place to park. I walked two blocks, and the place was packed!\n\nHere are my observations:\n\n1. The place was very busy, and it was apparent that there were several factors.\n\n2. The image is of the restaurant ambassador who steers the team to excellence! He was very nice and had the service core-values.\n\n3. I decided to sit at the corner, and I could not believe my eyes! Plates and plates of succulent food, leaving a very obvious bouquet, or better yet, fragrance! YUMMY!!\n\n4. I wanted an omelette, then I saw potatoes, then I saw pancakes and I realized I needed to look at the menu. lol\n\n5. The menu was full color, and I only wanted to know one thing: was the coffee good???\n\n6. The coffee was amazing, for a restaurant\n\nSadly, I had eaten at, the Buccaneer Diner, which was a recommendation from the hotel.\n\nI posted a review about that restaurant on my thread. If you’re interested in knowing.\n\n7. Please see the images of food that was delivered.\n\nThe pancakes were fluffy, and the turkey sausages were amazing.\n\nThey had homemade butter and maple syrup. The homemade potatoes, and eggs were great!!!\n\nIt was a delightful breakfast.\n\nIf you were staying at the Doubletree and or the Hampton Inn or a nearby hotel near the airport, be sure to make a beeline to Jax Inn dinner, you’ll thank me for my heartfelt recommendation."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poa2NpMXhSR3RZUzNoRloyMTVhVWRhWldGVldIYxAB",
            "text": "kinda mediocre disappointing food and expensive? chicken burgers $29 for a deluxe?? fries were burnt and fake chicken pattt? i gotta start cooking at home smh, service is good tho"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCRVRtbERhbTlaWVc5RExUWldVbTFhU2tGM1duYxAB",
            "text": "Todo de este lugar me encanta, la comida, los precios, el servicio, punto a considerar por favor: Tratar de mantener un poco más limpios los baños!!!! 🙏🏻✨"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5eFJHeDFka3RmZEc1dE0yeFRZMGgwVXpkWmRXYxAB",
            "text": "Western omelet. Never had diner food that was so bland.  Sorry but an omelette side of hash toast and coffee shouldnt cost 25 bucks total including tip."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toRWEyVTVhazFhWDA4M05HTmhSbWcxU0daMmJFRRAB",
            "text": "Service and Food selection is great"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tORGQxSkVkMlJRWjA0eGNFeFdZVTFpVEVOaWIyYxAB",
            "text": "Terrible experience! we decided to give it a try after a couple years of not coming back and have to say terrible choice and waste of time. We were immediately denied service for bringing our small service dog with us this time. Not gonna lie food isn’t even good anyways it’s just slapped on a plate.  Never coming back ever again."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xZelJVZ3dhMDAwTkVkUE1qTm1kRXB5YTI1TmJGRRAB",
            "text": "amazing waiter edgar, food so good, and like i said waiter is amazing helping us with our new visit"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xscFpXeHBUbU5GV2xBeVJFMU1jRzh0UWs1UFQwRRAB",
            "text": "The food was amazing,  staff polite and courtesy"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xvM1ZteFJXVGRZYjBKWFRqQnJlbkpaZDJseVlYYxAB",
            "text": "A fantastic and wonderful NY diner great food nice, portions, fair price, ample parking, great staff"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CS2FIQlVNWEpOYzFKQ2RVUnRkRWxUVURFNFpuYxAB",
            "text": "The omelette was delicious. The staff was attentive and hard working. Parking is plentiful. Arrive early on the weekends as this place get full pretty quick."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaNVVqaHFkWFZ3VUdWblZEQkxlVTF0U1ZseGVuYxAB",
            "text": "A fantastic, classic Diner experience. The decor is quintessentially \"Diner\" and the service is excellent. My water and coffee were re-filled without my having to ask, and the staff were very friendly. Many speak English and Spanish as well, big plus. The food was exceptional - we had a French Omelette, Maryland Eggs Benedict, and Chocolate Chip Pancakes - all phenomenal.  We'll be returning."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21weldtVlhMVjkzT1V0UWNtMTROMDgyT0dSellVRRAB",
            "text": "Great service as always. No complaints."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xveVRUVm5hVmRtVkRCWlVTMDVTMFZCVFZKM2QyYxAB",
            "text": "Honestly the hamburgers were just horrible. It was bland, unseasoned, and hard. The service though was really good, the waiters were so nice and helpful but the food was just not it."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKeFgxYzNiV1JPYkRKeE5FRkhjVWxqVkZOUVdtYxAB",
            "text": "Very cheap quality food. Ordered for takeout and got the stalest toast I've ever had. Requested eggs scrambled and it came over medium. $17 for ground chicken, a couple eggs prepared wrong, and stale clearance bread. A little bit of seasoning might've made it all bearable but it barely had any. Not sure how this diner has over 4 stars"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201M1RFaHFMV3hrTTBsSloySTNUV0UzZURod1ExRRAB",
            "text": "Wanted local diner vibes? Cool. Decent diner food. Cool. Come back into the car after eating a lot of food…letting the food you just indulged in settle…NOT COOL. Why? Owner will come out and say you parked your car here illegally and it’s for customers. Completely understandable if you saw me illegally park here and go off somewhere else. Tow it. But to come out and accuse me of something absurd without facts is why I won’t be returning unfortunately. Thanks for nothing “Mr. Owner” 😂🤷‍♂️🤦‍♂️🤦‍♂️🤦‍♂️"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJM1dYTlBRbGR5VUVrdFdVODFWVWRtZUUwNE1tYxAB",
            "text": "Buttermilk pancakes are so good! Also, chili tastes so meaty and delicious, plus bacon burger was big and tasty. We will have to do some chili takeouts. BBQ pulled pork sandwiches are sooo good, said hubby."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZeWVrSjNZMFo0VFU1aWIxQTJjbFZNY0dWaFExRRAB",
            "text": "This was the first bad meal I’ve had in New York. I told the waiter one meal that was served was missing several components. He checked the menu and agreed. I told him another meal was also missing components. He sort of chuckled and walked off. That was less of an issue than the fact that there was no flavor or seasoning to be found in our food. And the butter packets were spoiled. Very disappointing!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wRFMwRmhVWEJhUjNkbVVHVkNjVUp0TlhKT04xRRAB",
            "text": "Me and my family go here at least two times a month. This place is very very good, the food is very high quality and its just delicious! My personal favorite is their vodka pasta. I remember going to a fancy, expensive italian restaurant and getting vodka pasta, and all i could think while eating it was \"the jax inn vodka pasta is so much better.\" This place holds a lot of memories and i'm glad it's here. A great diner!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsVlVYSTRlV1JxYTBWalgzWk9RMjVJUjFSeE1uYxAB",
            "text": "I have ordered from here for the past few months and it is nothing but delicious at any time of day!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taZlZHNVhhVWRVV1U5cWNFOXNOVkZ2Y0dOdVZFRRAB",
            "text": "Last night, we chose this place for dinner because it was very close to our home. The restaurant was quite clean. The staff were friendly and helpful. The food was very tasty for a diner. The portions were large, so we couldn’t finish them and took the rest home. We will definitely visit again 👍"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s4MmFFcGtlRVZsTTBoamNrVmlUbkk0ZERGUFkwRRAB",
            "text": "Excellent food and service"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSRlZIa3dhVFZKYUV0dmRuQnBZWGhvT0V0U1NrRRAB",
            "text": "Great place for quick dining, fast service and solid food. The sandwiches were good, and I enjoyed the French toast. The place has made an improvement since 2021 I would come again. Nothing flashy but a solid diner"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214UGIxWnFORGMyUjNaVVZXMXlaM3BZV1RObE1VRRAB",
            "text": "The service and food were great. What was seriously off putting was the streaming FOX news behind the counter. Don’t they know the community? Their customers? Change that station! Otherwise, great eats & solid coffee."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtNVppMHVnRRAB",
            "text": "Have eaten there a couple of times Every time Service is good Food is good Gets busy in the weekend especially after  8o'clock"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GVmVscFhZbHA1YjFsTmFIZzRhRkUxVTAxMmNIYxAB",
            "text": "Always good service and fast"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSM05EVnliVXBuT0U1eU5WSTRaVTVhTFdzeVIyYxAB",
            "text": "Im a uner eats driver they never prepared there food on time and say 5 minutes i went after 50 mins they said 5 minutes"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWQ1VGQjZYMHhOYW5ORWNUTTVYeTB3U0UxWFpVRRAB",
            "text": "Mi esposo y yo hoy quedamos totalmente sorprendidos y decepcionados de este lugar, pedimos un club sándwich y les dijimos que queríamos extra bacon, cuando nos lo trajeron vimos que no nos dieron el extra bacon, pero para no perder tiempo le dije a mi esposo que lo dejáramos así, pero SORPRESA cuando pedimos la cuenta venía un cargo que decía “open table $3.00” y pregunte de qué era ese cargo…adivinen según era de que nos habían puesto cinco pedazos de bacon extra y cuando le dije al manager que eso no era cierto, me dijo que la próxima vez le tenemos que decir antes de comernos el sándwich para que así él pueda hacer algo…POR SUPUESTO JAMÁS HABRÁ UNA PRÓXIMA VEZ…lo pagamos y nos fuimos…SHAME ON YOU JAX INN DINER"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOR1h0Y3Jfb3J2b2x3RRAB",
            "text": "Wonderful"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJcjAtS2ZObmR6ajN3RRAB",
            "text": "Im a regular.  This place is special to me for the memories and the important people I share them with.  It's a diner. But it's more. There's a warmth from the owners and staff, a family friendly place.  Good food, good service. Breakfast, lunch,dinner. It never fails to satisfy!"
        },
        {
            "date": "6년 전",
            "language": "ko",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJX0tmZEt3EAE",
            "text": "일상식은 베스트. 고급식은 쳐짐."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiN3Y3aWxRRRAB",
            "text": "GREAT diner food, very impressed! The French toast was awesome! Grilled cheese was good and the potato skins were delicious and huge! Service was great too. Went back the next morning and tried the skirt steak and eggs. I was surprised at the quality considering its diner food. The steak was very tender and a perfect medium rare. I’ve been back multiple times and have not been disappointed, The different kinds of flatbreads and the moussaka is phenomenal!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBcllUVk1BEAE",
            "text": "Really nice place, seating was pretty fast, servers were nice and inviting, and the food was good. We have been eyeing this place for awhile, and living not far and passing it daily, I wish we would have stopped in sooner, we will definitely be going back.\nParking is around back of you can procure a spot as this place is busy, but the wait isn't too long. Definitely recommend this spot."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzNTRyOVlBEAE",
            "text": "Simple, fresh, and refreshing food. Salads are crisp, soups are warming, and entrees are filling.\nFries and fried chicken were perfectly crisp. Toast was a bit dry for the sandwiches. The chicken pot pie and rigatoni were great. Only complaint is the lightness on the seasoning, but it was good nonetheless.\nService was good."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXdElTVy13RRAB",
            "text": "We came to Jax Inn Diner about a week ago, and arrived at a time when it wasn’t too busy (Say Tuesday around 5 PM) and the place was instantly very welcoming. The staff was very attentive and constantly checked on us which was great. Hubs had a burger and I had the fish and chips! It was sooooo good!! The fish was very fresh and the fries were crispy. Hubs made a mistake by ordering the burger well done, but that was his fault (don’t ever order something well done) overall a great place, will come back to try the rest!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUROeWJIRmNnEAE",
            "text": "Love diners and the allday menu. This diner is decent. It's appearing that it isn't as well maintained as it should be. The entrance wasn't swept when we went. It included a  stained mask and other light debris.\nThe interior is bright though the seating looks like wear and tear leather. Not able to be cleaned or maybe not properly cleaned.\n\nThe food was good depending on what we ordered. The octopus had a great presentation. It tasted quite like trimethylamine or that fishy flavor. Maybe it wasn't soaked as it was also a bit too chewy for me but my friend enjoyed it. The blackened chicken was enjoyed and it's a big salad. Don't know why the side of bread wasn't included, maybe an oversight. The pancakes were deliciously soft and not gummy or chewy. The corned beef hash wasn't thrilling but okay. The sausage is thick juicy and had a nice flavor.\n\nThe server and the runner were really nice guys and accomodating.\n\nI hope the manager reads the reviews good and bad. Such a popular neighborhood Diner and diners are accommodating due to forced closures. For those who love diners I hope management accepts the compliments and also knows how to make some minor improvements in this current environment."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxMnZEb1NBEAE",
            "text": "We went for brunch for the first time. Great food and service. Initially thought it was a bit pricey, but, their portions are big..so always could take leftovers home. Pancakes and eggplant Parm were delicious 😋 We will eat there again."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoeWJDZTJ3RRAB",
            "text": "Came in for a lunch with my family. The service was great. Waiter was attentive to our table. Food was okay. I ordered a ham and egg omellete with home fries and pancakes. The home fries were bland. The pancakes tasted like cake batter. Overall it was okay. I would go here again the service is great."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM0bVk3ZlV3EAE",
            "text": "Good service and decent prices. Their pancakes taste amazing and are a staple. California egg benedict is also a delicious dish. Would’ve given five stars but the bathrooms were dirty. Other than that, great place."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCLXBQamNREAE",
            "text": "12/22/2022 was my first here at Ajax Inn Diner and by far was the best.  The waiter’s were professional, clean and friendly atmosphere inside and out, giving an experience of an old fashion layed back and relax , like what you see in movies.   Definitely will return for breakfast whenever I’m back in Queens"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqa1lXMjhRRRAB",
            "text": "Delicious food and good portions. Great value for your money.\nThe only complain I have is that the chicken was a bit dry. I order the penne alla vodka add chicken.\nEverything else was excellent."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VKR21zNHZWOHI2TG5RRRAB",
            "text": "I am from Texas, Visiting NY.  The food was good, the serving sizes I thought were large.  The service was not fast, but not so slow that it was a problem.  The other plus is this restaurant does have it's own parking lot, so that is good. The only negative was that our booth (by the window) had 2 dead flies trapped in the wood blinds.  Maybe these should be taken care of?\nGlad I saw them at the end of my meal and not at the beginning."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJbVl6WmV6ei03eHZnRRAB",
            "text": "Everything on the Speciality Menu is delicious. Especially the Boneless BBQ Baby Back Beef Ribs. Service is prompt and friendly. Wheel chair accessible with convenient on-site parking. All menu items reasonably priced. Maybe a bit too loud for average customer."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIOU5QU3RnRRAB",
            "text": "$30 for a dried up omelet, 2 plain pancakes, and coffee is robbery. This is a diner, an omelet of all things should be... Relatively cheap. Service and all was great but prices are too higher for a diner."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNZcW9pQmZnEAE",
            "text": "Service was ok\nBut food really make me think to come back again we used to go often but look like they chance the cooks because the quality of the food lose flavor taste\nNow is tasteless  used to be soo good\nWe ordered omelettes and they were dry\nThe french toast was super juicy and crunchy on the crust now is dry and soggy\nSorry to said that but its true instead of getting better they are loosing"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvaV9lbXhnRRAB",
            "text": "Great place to sit down with friends for a relaxing meal.  Terrific menu selection; I had the Greek Salad with chicken- excellent and generous portion.  The topper was a piece of Carrot Cake for me and a slice of Lemon Meringue Pie for my friend; delicious!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxcmY2NzhRRRAB",
            "text": "Typical neighborhood diners in busy East Elmhurst, Jackson Heights and Northern Boulevard area with  parking in the rear and few in front of the restaurant.  Large portions food served, so as usual, some will be wrapped for taking home!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBbVA2ajN3RRAB",
            "text": "This is a bacon egg and cheese and they charge $8 for it. I’ve had better from a street vendor at a construction site. Very disappointing"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzNXNIWU9BEAE",
            "text": "an amazing local spot that i only recently found\ni have went twice for breakfast around 7am weekday and once for dinner. 6pm friday.\nalways experienced excellent food and amazing service.\nthey leave you to relax and enjoy the meal and company without feeling rushed or unwelcome. a family vibe. would be great for locals or anyone just visiting.\na perfect spot for any craving as they have such a diverse menu of options. truly worth trying. takes me some time to choose because they have a good variety!\nportions and prices are very fair. meal for 2 could be $20-$30. good spot for dates.\nso far i have tried\nfrench toast\neggs benedict\nwaffles\ntea/coffee\nchipotle burger\nthey give you complimentary bread in the beginning of your visit as well!\nthe fruit is always fresh\nthe ingredients really taste good quality, did not skimp out for anything. you really feel like they put care into the meal and presentation, not just throwing things together\ngreat ambiance, ample seating, good music, great staff- everyone is friendly and warm, they answer all questions with no issues\nbathroom isnt the cleanest however but that would definitely depend on the level of crowd at the time as with any other establishment.\nnote: they will give you check at your seats but payment is at the front before you leave.\noverall amazing and will encourage everyone to go!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNva1puTDdBRRAB",
            "text": "The people here are all so nice. The place is cute. The food is beyond delicious nothing disappoints! And I am definitely a fussy pants. I really love their Belgian waffles. My friend likes their chicken pot pie and I love their turkey dinner with all the fixings which I get almost all the time."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4c3FHeDBnRRAB",
            "text": "This has been my go to early morning Diner since childhood. Being that few places are open early these days Jax Inn is consistent and available. On my recent visit I got the lumberjack combo with 3 pancakes, sausages and 2 sunny side up eggs + maple syrup. My wife got the classic eggs Benedict. Both were amazing and servers constantly refreshed water, coffee and checked up on us. Jax Inn is also very affordable at under 40-50 for a couple."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2LTV5NHJBRRAB",
            "text": "The customer service is un parallel here. Very attentive host and server. The menu is vast with many options. The portions are HUGE. The price is just right for the portions of each dish. Everything tastes good here. Whether it be pasta, eggs or steak. My brother and I come here very frequently and its a must try. You will not be disappointed, but do make sure you have enough time to eat. The food is made fresh so it does take some time. Its worth the wait!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPbmZhMWFREAE",
            "text": "The service was great the omelet not so much! I I I   I can’t understand any cook who can’t/won’t make an egg without cooking it to absolute death! My omelet was cooked so dry as to be practically inedible. My friend enjoyed her salad however and as I said the wait staff was amazing. They offer off street parking & in spite of inflation I felt the prices were reasonable. I might try them again for a different dish."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURvajU3TlJ3EAE",
            "text": "Wholesome food of American and Greek gastronomy, fairly priced. Open 24/7 and offering free wi-fi.  Seating is difficult on Sunday mornings, requiring long wait times. Despite all this, Larry Sharpe appeared here on March 24, 2019 to address supporters after his historic run for New York Governor in 2018."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1NGI3TjdnRRAB",
            "text": "top diner , great food and friendly staff, don’t leave the place without having a huge slice of their cheesecake. it’s a must !"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUNm9EN2NBEAE",
            "text": "It is not easy to find a restaurant that opens 24 hours a day these days. It is a good place to enjoy a simple meal."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvbl9UZmVBEAE",
            "text": "The food is alright. But the curly hair woman, I think was the hostess is rude. The waitress, he was kind and polite. Just that señora was like jumping from one place to another. And treating ppl like they don’t know nothing like she knows it all very nasty attitude."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURHMFAzeFlBEAE",
            "text": "The portobello chicken sandwich is good the bread was to dry like old,, but the kale chicken salad was delicious,  coffee not strong like used to be, the waitress was very nice and so professional, not cheap, not expensive,, fair prices ,by the way both dishes came w/ chicken soup,  lunch special,, is a great option,"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvNjVPdGlnRRAB",
            "text": "Food is good, decent prices. For my dad and I, it was 42. They do charge more if you pay by card, so make sure to use cash. The receipt does reflect the prices on it concerning paying by card or cash. They have good deserts. Spacious booths."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJejliR213RRAB",
            "text": "The portion of the food items was pretty good. I experienced a slight, unpleasant smell of too much egg in the French toast, but i was able to tolerate it. The rest of the food was delicious. Seating was spacious. The atmosphere was calm. Overall, I enjoyed this spot."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURveTVYRzhnRRAB",
            "text": "it was mine and my daughter's first time here.  I'm telling you the food and the service was  the best. Can't wait to come back with the rest of the family."
        }
    ],
    "reviews_count": 68
}