{
    "name": "Pio Pio 2",
    "place_id": "ChIJpflYqqZfwokRZb2PG3wZSwE",
    "grid": "QN3",
    "address": "84-02 Northern Blvd, Jackson Heights, NY 11372, USA",
    "rating": 4.2,
    "user_ratings_total": 4154,
    "phone_number": "(718) 426-4900",
    "reviews": [
        {
            "date": "6일 전",
            "language": "es",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oUFZrWkdaVGt6YTI1TE5WWnJlVk40VTFsSlZuYxAB",
            "text": "He comido 3 veces en este lugar y las 3 veces fueron buenas, hoy llegamos con amistades a comer por el cumpleaños de una amiga, al llegar preguntamos si tenían alguna promoción o algo para cumpleañeros, nos comentó que ellos no hacían eso y que ellos no tenían nada, al sentarnos le consultamos a la persona que nos atendió si hacían algo para cumpleañeros, si tenían alguna torta, nos mencionó que no, entonces le sugerimos que sería bueno tenerlo, él nos dijo que no que al dueño no le gusta eso, y después nos dijo que si tenían una torta de 3 leches, pero no hacía nada especial que sólo la daban y ya.\nCasi ya al retirarnos y pedir la cuenta, nos percatamos de que si tenían tenían un servicio para cumpleañero, de cantar y dar la torta. Entonces porque a nosotros no nos quisieron atender de buena manera, al mencionarle que por favor nos ayudaran con eso, nos quitaron el recibo y nos dicen “es que nunca nos dijeron eso “ ????\nSe supone que pagamos por el servicio y la comida. Debo decir pésimo servicio, pésima actitud por parte de los meseros y el personal!! No volveremos a este lugar\nLa comida estuvo más o menos, no estuvo mala pero no estuvo como en otras ocaciones."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wdFlYVlpjMFJWZG5rNFRraDVOVU5FY1hsSVdYYxAB",
            "text": "I rather go to Mc Donald’s.. the chicken has no taste ! Pollo a la brasa Mario is way better"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psSlEwaGpjM0pyTVhWRE5tWTJOV3hYTjNnNFdIYxAB",
            "text": "Music to loud. Poor service, the waiter never asked if we need anything else. Food came warm, almost cold. Taste nothing spectacular. Not worth it for the price."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214eFFXVlljVXBNTldrd01tUXRVRU14VkVoeFVGRRAB",
            "text": "Amazing food!"
        },
        {
            "date": "3주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SNFZVRkRNV2QzY0ZWYWNGRTNjVkpHTFZsWldWRRAB",
            "text": "Excelente atención"
        },
        {
            "date": "3주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsTWNucHpNMEowTkVJeGRFdDRZMkpWV2tKRExVRRAB",
            "text": "El mejor pollo de la zona, toda la comida deliciosa, buen servicio y buen ambiente."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s4MFh6aERPRVpXWHpJMWNVNXdRV3gzVjNKTlgxRRAB",
            "text": "If you like Latin culture 🍵come here with Fam brunch is amazing to die for plenty of options"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBdjhPQjBBRRAB",
            "text": "The food is delicious. The matador combo always hits the spot. Jalea is a tower of seafood. The garlic sauce is incredible and the green sauce is pretty addictive. Jean-Carlo our waiter was excellent and showed us the utmost hospitality as well as attentive to our needs. His service was 10 out of 10."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlbGE3R2ZBEAE",
            "text": "Great food!"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WNWNrbHNNbTlRWlc1bWVEVjJNMVk1WTJob1NXYxAB",
            "text": "La comida muy mala, pedimos 2 lomos saltados y 2 ceviches, los lomos saltado estaban pasados de sal y ponen más verduras que lomo en total 6 pedacitos de lomo muy malo"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poMFFUZDNVWHA0TW0xd1QyTmxSRkpWU1hwb09VRRAB",
            "text": "I am never disappointed with the food and drinks."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZNFlrOTFMVTFDTVY4NE5uWmphMVpaVkVNMFZHYxAB",
            "text": "They gave us enough time to think what we want to eat. The food came out fast, it was lot of food! Great quality and quantity! The drinks on point! Great price for for what we ordered!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWSVNuSXRSVEpDU0ZKNmNHcHRXVGd5VkVZeFgyYxAB",
            "text": "Very good"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GRlEySmZhek55VGpZM05VVkNiM2RxWkhsR00wRRAB",
            "text": "Escelente ambiente , comida deliciosa y bastante, sirven mucha comida muy muy 😋 rico"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WdlZESkdUR0U0VldJNFN6ZGFXV0YwT0d0b1VsRRAB",
            "text": "i think they change the chef and  everthing is so diferent the jalea is so cold and the oariguela is not the same  but the atebtion to the costuner is very nice   pay atention to this complain  my doghther was  the favority place and now  she change the mind and place too"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1TlUxbzNZMHhNT0RoQlJXdHRSRmhsU3pCbUxXYxAB",
            "text": "Be careful with the juices. I ordered orange juice. The waiter, Emerson, told me it was natural, but it turned out to be artificial instant juice (Tropicana Juice). Be honest and tell the truth. The food is delicious, 10/10, but the juices are a disappointment, and the music is too loud."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKM1gzRXpaWEppZGsxcWFIQnphM2h4WTNKUlUxRRAB",
            "text": "I love this place, but I’ve had food poisoning two times now. Someone please check the quality of the chicken or make sure everything is clean bc this time I’m done with the place.  Sincerely a loyal customer of 10 years."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taU1owWTFWVlJ0UkhCU1FXMHdZM2QxTUZGd1QyYxAB",
            "text": "I used to live around the block and would eat here once per week. Now every time I visit NYC. I make an effort to eat here. I love all the food and especially the sangria. Staff is nice and super fast. I've been coming here before they built this new place there in now. Original place was the togo spot on corner. Till next ny visit. See you soon."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oQ1VVZHRaVTg1VjBKdGRtZFVSMWxFWjFnMGVtYxAB",
            "text": "The food here is excellent – definitely the highlight of the visit. I had half a chicken with tostones and maduros, and everything was flavorful and satisfying. The sauces that come on the side are a nice touch too.\n\nThe service, however, wasn’t as strong. I ordered a mojito but was brought a margarita instead. Not a huge deal, but details like that matter.\n\nOverall, I’d recommend Pio Pio if you’re coming for the food – it’s worth it. Just be prepared that the service can be hit or miss."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paelpubzJibXR4UTNwMFZuWXdVMjlPUmpSZmVuYxAB",
            "text": "Service was good, food was okay a little bit too salty. Side portions are excessive we asked for a side of tostones and they brought us a lot, which we couldn't eat everything. In general it was a okay restaurant."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsWVJtNVBkR1ZwWWs5UlRFeDNObmw1YW05NWJGRRAB",
            "text": "I been going to Pio Pio for years , but this time the food has no taste.  The quality are poor.  Not worth to pay that price.  Sorry Pio Pio."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Sd01rUnFkRzh6WWxNMk5HOXNlbXRXZFRsUU1rRRAB",
            "text": "The chicken is phenomenal. I wasn't overwhelmed by the lomo though.  Service was excellent as well!"
        },
        {
            "date": "2달 전",
            "language": "zh-Hant",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aV1ZqTnNNbEZSVm5kcGFGbHRMV2R2UVRkYWQzYxAB",
            "text": "2025.8.16"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKVmRtNW1PRzR3U0hZNFlVOXlVV0ZsVlhBeE4yYxAB",
            "text": "Yummy food"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5dWJEVkpObTl3ZUU4ek56UTRNVkEyUVRSSVlXYxAB",
            "text": "Went Thursday afternoon for a family outing. We ordered the Matador Combo. Ironic name for the dish that destroyed my stomach. Currently writing this while sitting on the toilet. My other two family members are sick as well. Not coming back here again."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMcE1QWk1REAE",
            "text": "Too expensive for a matador combo. It's not all that. and music is too loud!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ORlVHZFhYMUJCUTBVNFlYZGxWSGw2U0Y4ek5FRRAB",
            "text": "Fresh and delicious.  Authentic peruvian dishes.  And don't forget to try a pisco sour to max your experience"
        },
        {
            "date": "3달 전",
            "language": "it",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsb05GQnZObmxVU1VOVmFUVkRZMDVJTjJKS2VIYxAB",
            "text": "Combo macho, suficiente para 7 personas . Cibo buono fresco e fatto sul momento"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkTUxXOWlkMEphTWtabVp6RjVkVFIxT1doWE9GRRAB",
            "text": "I’ve always loved the food at Pio Pio and have been coming for years. However, I’ve recently noticed some major changes to the menu. For example, some of the combos are now very overpriced, and surprisingly, a few no longer include rice and beans.\n\nDuring a recent visit with a group, we ordered the Matador Combo, which is described as “family size.” Unfortunately, it only came with one small portion of rice and beans—not nearly enough for a group. That was disappointing, especially considering the high price.\n\nTo the CEO of Pio Pio: I respectfully suggest reviewing the pricing and portions of the combos. The quality is still great, but the value just doesn’t match the cost anymore. Thank you for taking customer feedback into consideration."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25Wb01qVlFWM1JFWTJKTWRtMVlRakU1Tmw5SlNtYxAB",
            "text": "Ordered at their take our location across from their dine in restaurant. The chicken is as juicy as I remembered in 10+ years ago. The Lomo Saltado was decent but the beef was definitely on the drier and chewier side. The green sauce they served here is on the spicer side, so be careful for those who can’t take the heat (like my friend)!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CVFUyNTZhVUZOU1VwclFrUnVZemhvTFhnNWIxRRAB",
            "text": "The waiter understood only Spanish & he never came back to see if we needed another drink. We had to call him back. Food is super hot & fresh the Pollo & shrimp Chaufa is the best! Drinks are good! Atmosphere is amazing, very spacious for Jackson Heights 👏🥰💯! Definitely will go back!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WMmRYRmZXRkJVTVhkek5uQk9VazVQUkZKdlpHYxAB",
            "text": "I don’t know if it’s a good thing but my food came out in 5 mins I ordered the jalea and the chicken rice and beans with fries and it came before the drinks even came the jalea tastes refried and the rice wasn’t hot the beans weren’t either I payed 93 dollars for a mid meal. This is not it the pio in Hell’s Kitchen is better"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWbWJHSXdSM2RNZW1jNFlYazJZbmh4VW10d1puYxAB",
            "text": "Have been coming to pio pio since when they had their original location across the street! You will not try a better rotisserie chicken.\nI always get a matador combo. Never disappoints. Always on point, great service and food is out quick and hot !!"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKaldFSlBTMnBLYkY5ZmIwMXBMWFJTTmpkVlQyYxAB",
            "text": "Yo creo que si quieres comer pollo al estilo peruano es mejor que busques otro lugar esto no tiene nada de ser una pollería peruana Yo creo que un pollo del Chino tiene más sabor que el que venden aquí"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OeWNWVmhOeTFuUkRSbVpWbE5XVnBLYkdKc2NXYxAB",
            "text": "Always a great place for food, drinks, and great atmosphere"
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOMVZrbGxSWGMyT0d4SGJsbFZTbUZRUm5wRVdsRRAB",
            "text": "I’ve been  going to this restaurant for close to 20 yrs and it never disappoints . The food is fresh and tasty and the service is incredible."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twNVlYa3hTVXByYlhKck5tWnphSEZaY1U5UFlXYxAB",
            "text": "Un buen servicio la comida agradable y las personas que atienden muy agradable"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jd2EzSk9lVUUzYnpaNUxYRkdZbTlETm5aSlltYxAB",
            "text": "First of all, Lomo Saltado was too salted not peruvian flavor, really bad. Causa rellena and anticuchos are ok, and then the service was so bad, not encouraging, serious and not helpful at all."
        },
        {
            "date": "수정일: 3달 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5OWNIOUF3EAE",
            "text": "Buena comida"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21obk0yRlJUVlZIWVZaZlNXc3plVzQxTVZKdWNWRRAB",
            "text": "We went today with my dad and honestly the experience was really bad, only one guy was nice when I ask him something but the others ones got mad everytime I ask for the straws and the fries where cold and the coke the give it hot and in summer. is expensive and no worth it, will never come back!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOdlVtTkVWMGx3Y1RkaWJrVldNMXBuYmswM1dFRRAB",
            "text": "Best food and great service. Sadly it's too pricey."
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twMVVtZGxSV05CVjFrd1RUSldlR2hrYmtkT1ZtYxAB",
            "text": "El servicio un poco lento. Están más ricos los platos con carne, como el lomo saltado, que los mariscos. Volvería a este\nLugar, la música y el ambiente muy buenos. El servicio un poco demorado, pero nada que me impidiera volver."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKT0xYbDViRWt6VUZkUmJUTXRkMlpYYVVSVFZrRRAB",
            "text": "This the best restaurant of Peruvian food in NYC. No doubt."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkYWFtNHpialpKZVhsM2JtdG5ZM0JHVldKNk1IYxAB",
            "text": "We are regulars. Food is reliably good. Service is always good. Decent value. Never needed a reservation. Parking can be difficult."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2swMWFpMDBVVlJWYzFsQ09WOHlWMHhMZGxaRGNIYxAB",
            "text": "Very bad food the jalea was cold not fresh, and the service was terrible. First and last time we were in there."
        },
        {
            "date": "2년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNobTZqVmh3RRAB",
            "text": "맛있어서 놀람 ㅋㅋ"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLV1Q5Y19IX1AyY0lREAE",
            "text": "Great experience for Mothers Day brunch. Service, food and sangria were delicious and very enjoyable. Everything we had from ceviche mixto and other dishes were 10/10. Highly recommend the sangria, one of the best I’ve ever had. We got the pitcher, good amount and refreshing. This is walk in only, recommend going early ( as soon as they open) for a good table on weekends. Great place over all, good for family events or special occasions. Spacious also, tables are apart. Certainly will be returning soon."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvN0lQWk1REAE",
            "text": "The food is served family style. The fried calamari to me was over cooked, the ceviche could have been served more. Not enough ingredients in the ceviche. We had the $74. Deal which was whole chicken, salad, 1 scoop of yellow rice with beans. We were a group of 6 that scoop of rice was not enough especially for the price they charge also comes with french fries and sausages.\nSo we ordered more rice and beans. The fried yucca was delicious with that green sauce. I had the red sangria but was told the white sangria taste better.\nThe staff were very nice, attentive and quick to serve us."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqbUsyTHBRRRAB",
            "text": "Looking for the ultimate Peruvian rotisserie chicken experience? Look no further! This spot is a gem for chicken lovers, offering a twist on the classic dish that will exceed your expectations. Even if you're used to having rotisserie chicken at home, the flavor and quality here will blow you away.\n\nPersonally, I'm not one to usually order chicken when dining out, but I couldn't resist, and wow, it was hands down the best chicken I've ever tasted. And the ceviche micro? Absolutely delightful!\n\nNow, onto the service. While the waitstaff presence is abundant, there's room for improvement in their attentiveness. But fear not, the lively atmosphere with live music adds to the fun, although it can get a tad loud if you're seated too close to the band. Pro tip: If you're aiming for a cozy conversation, opt for a table farther away from the music.\n\nJust a heads up, this place tends to cater to larger groups, so it's wise to make reservations in advance. Get ready to indulge in fantastic food and vibrant ambiance!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5eHZ2QTB3RRAB",
            "text": "This place is probably one of the best if not the best for Peruvian food! I have been coming here for many many years and I’ll say that the food is extremely consistent. We always get the matador which is a lot of food but for the price and what you get from they one order, it’s well worth it! Overall value is amazing. The ambience is nice but I wouldn’t say it’s romantic or intimate! Love this restaurant"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmbFpuUFBREAE",
            "text": "Pio Pio offers some of the most delicious Peruvian food I've ever had! The quality of everything was exceptional, absolutely incredible, I have nothing bad to say about the food. On the downside, the service is a bit slow due to how busy it gets, and the desserts could be just as outstanding as the main dishes. The prices are a bit high, but it’s definitely worth it for a special treat. Highly recommended for anyone craving amazing Peruvian cuisine!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNWEhwLWo4OWFybHRnRRAB",
            "text": "Always love this place.  One of my favorites.  The food is always on point!  The Matador dinner is my fantastic. Drinks are great but still the food is worth the trip.   I go here every chance I get when in Queens.   Atmosphere is a nice vibe.  Parking sometimes difficult so leave a few extra minutes for that."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4bHV2WHBRRRAB",
            "text": "This place was great. We went there for a friends gathering. The food there was awesome  especially their chicken. The price of the combo was reasonable compared to others. It was a great experience. Definitely going back if there's a chance."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSeWJhN0xnEAE",
            "text": "We had a party over there. They have a moderate space for 75-100 people. The food was delicious and the drinks were crisp. The servers were professional. Great place to throw a party for any occasion or just have some good time with your loved ones and friends."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4cVlpNWV3EAE",
            "text": "It's my favorite place from now on. First time visited this location today and feeling that they have the best kitchen on earth. Service was exceptional as well, and my biggest thanks go to those who warmed up milk for my coffee without even my asking. 🍨 are incredible! Lomo saltado is number 1 for me personally, but I highly recommend trying everything on the menu. Keep up the great work, guys. We appreciate you!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4aGZLMHNnRRAB",
            "text": "This restaurant is amazing the food is good and everything is seasoned perfectly. The service is amazing. This drinks are good. If you have a big party don’t worry there is more than enough food."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMaC15U2x3RRAB",
            "text": "Food was excellent. Their service was a little off. Had to repeat order a few times before the server understood what we wanted. Atmosphere was great, not very popular on a Tuesday night. There wasn’t a wait for a table."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSeHRDc0xBEAE",
            "text": "I’m new in the area and was told that  Pio Pio was a bit pricey, however the food was great. So I tried the steak with French fries, rice and beans and an avocado salad 🥗 the total was approx $54.00 🤦🏻‍♀️ the beans were an extra charge and the salad was $11.00, I honestly didn’t think the price was bad because  my expectations were high.\n\nNeedless to say I was so disappointed I wanted to throw the food away, however, I paid way to much and was way to hungry lol.\n\nFor one, they put the rice, French fries and steak in the same plate. The portion of steak was unbelievably small and the French fries were soaked in gravy so they were super soggy. For the price I was expecting everything packed separately. I will never eat here again 🤦🏻‍♀️ Thanks but no thanks! The steak and rice didn’t taste bad, but it couldn’t enjoy it due to the messy presentation.\n\nCount your days Pio Pio 😡\n\nIf you want:\n1. Very Small Portions\n2. Over priced food\n3. Messy/Soggy food\n\nEat here ☺️"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNma2ZxSVp3EAE",
            "text": "I'm shocked I've been missing out on this Jackson Heights gem all these years! The food is exceptional, particularly the Mixto seafood salad - it's like a taste of the ocean. And don't even get me started on the sangria... fresh, fruity, and utterly delicious! Can't wait to go back and indulge again!"
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3M1o2a0JnEAE",
            "text": "Amazing ambiance & even better food for a really affordable price.. Definitely a date night steal. I went with some of my coworkers and they were extremely accommodating and friendly. There is ample seating but parking is very tricky…"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQNndsUGlvOU03ZkZ3EAE",
            "text": "The Best 😍 Peruvian Chicken Restaurant Out There. We all enjoyed the Food and Service, it was a busy Saturday Night, short wait time, less than 10 minutes. Every food item we ordered was Perfectly Cooked and served with elegance. The Staff was Awesome 👍 Courtesy and Friendly. They also have Wonderful Seafood Dishes Too.!!!  We Can't wait to return for more Delicious amazing food.!!! 😋😋😋"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5MmRuODV3RRAB",
            "text": "This restaurant has several different locations. I went to the Jackson Heights location. There was no parking available there..\nWe were however seated 🪑 right away.\nThe restaurant is big and spacious and the staff were friendly."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlX09lbWJ3EAE",
            "text": "A great restaurant with a variety of delicious food the cocktails are delightful and the service is friendly.\nThe only thing I didn’t like on my last visit was that the cup was having a horrible smell like they didn’t wash it well that disgusting smell like stinky egg . besides that everything was wonderful"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VMT1J3Zl90X2JXWEx3EAE",
            "text": "I can not rate the food because i didn’t even get that far, we were sat down promptly but we asked for a drink menu and were told they don’t have any and we found it odd because there’s a full bar, i asked so what cocktails would i know you make he said it’s a open bar just order and we’ll make it but then how would i know pricing. First issue… then i noticed they had a “combo” with a whole chicken, avocado salad and a side of fries which was $60, what a ripe of because a whole chicken is $27, fries $9 the avocado salad $15 which was $51 so they are ripping you off for $9 bucks. We left after this and won’t be back to that location."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5aDhLbkJREAE",
            "text": "This place is huge! I've never seen so many ppl being served at the same time. Good service. Fast. Great food, as always. My fav for sure is the chicken, avocado salad & jaleas. Their sauces are a must! Empanadas are not really of my liking and the sangrias....i dont know roo sweet. But everything was great ! Recommend it. Sadly I was too hungry to take pics..."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlZ083NE5nEAE",
            "text": "The best rotisserie chicken on the planet! It’s something about how this restaurant marinates the chicken that makes it always juicy and packed with flavor. Make sure to try the green hot sauce you will fall in love with it instantly. I’ve been coming here for years and recently the food has made a come back to the days of old. Taste better than ever. Ordered a Matador combo a ceviche, papa la Juancaina and a arroz chaufa. A little of everything and it was delicious. Try this little slice of Peruvian heaven you won’t regret it."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4N1lqdnhBRRAB",
            "text": "Went there for my birthday and had such a great experience. I have been there many times before but our server 'Quique' really made a huge difference by making the experience special. He was so helpful and pleasant and really provided the best service! evenif the portions had gone down a little, I will definitely come back!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4dkl6QlFnEAE",
            "text": "1st time here, and it was very busy, so I knew the food would be fresh. I just didn't expect the food to be so delicious!!  Worth the money spent!"
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPdGZ6dUZREAE",
            "text": "Siempre deseé probar la comida peruana por su fama mundial y está fue mi oportunidad de hacerlo en este restaurante.\nDebo decir que esperaba algo que realmente me sorprendiera de los Camarones Cuzco que ordené, sin embargo son bastante regulares, (prefiero los mariscos con salsa a base de leche de coco de la comida hondureña) aunque no son malos, me decepcioné un poco.\nSin embargo, el \"Lomo de Res Asado\" y el \"Arroz Chaufa\" estaban espectaculares, incluyendo la yuca frita y los tostones de plátano verde que no pueden faltar, estaban deliciosos.\n\nHubiera dado 5 estrellas de no ser por estas razones:\n1. La música está tan alta que no puedes platicar sin gritar, es de mal gusto eso.\n2. Los meseros, aunque no son malcriados, no son amables y parece que solo quieren irse a casa.\n3. Nunca nos trajeron las bebidas que ordenamos, tuvimos que cancelarlas de la orden finalmente.\n\nAsí, que es un buen lugar para comer algunos platos un poco caros, y si no te importa el ambiente de bar con música estridente, este es tu lugar...pero no es un lugar para comer tranquilamente con la familia."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGcWZpYXJnRRAB",
            "text": "This place was great. The food there was awesome  especially the lomo. The prices are high but these are sharing plates. It was a great experience. Definitely going back if there's a chance."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUaGFDeE5REAE",
            "text": "El mejor pollo a la brasa que me he comido en mucho tiempo, un local súper grande y espacioso con mucho personal, las verdad es que el sitio me agradó bastante, sus precios y productos mucho más, fui en el día de la madre por lo que había mucha gente, lo único malo es que no tienen un sistema de espera por mesa, no anotan a las personas que van llegando si no simplemente tienes que esperar en una fila en la puerta lo cual no me parece práctico, sin embargo vuelvo y repito la comida, atención y precios, muy buenas"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSM042OGV3EAE",
            "text": "This place is huge. It is well worth the meal if you're hungry. The portions are large. The salad was a tad too oily for my taste and the meat to rice ratio was a bit too disproportioned."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCRVZtaFFhblpoZEVaelp6Uk5RakZvZHpGek9YYxAB",
            "text": "I was there for a retirement party yesterday on June 18, 2025. I would say everything was beautiful except for the waitress behind the bar. She was nasty to several individuals from our party. I am referring to the Overweight one with long black hair. She was very nasty when we asked her for the drink menu as well as asking her for questions regarding food and the bathroom. The minute we walked in she was very rude and ruined experience for many people at the party. There were two parties going on at the same time and only one bartender. The line was very long multiple times, and then the bartender decided to take his break leaving us with no drinks for a good while. I’m truly disappointed in the service here and will not be coming back here for any more parties or scheduling any more retirement parties here."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNDODhmZGdnRRAB",
            "text": "The food was delicious. The service was perfect! A great place to check out! Top Queens eatery, if you haven't tried it, you need to!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPanFXR2h3RRAB",
            "text": "Great tasting food and drinks with good size portions always great service at this location! Great atmosphere! Definitely authentic Peruvian food. Must try!"
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXd1l5SERBEAE",
            "text": "El pollo y el ceviche son una delicia, debes probarlos y te recomiendo los acompañes con una sangría.\nEl ambiente y la atención harán que no quieras irte, puede que llegues para…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2eEt1M1R3EAE",
            "text": "I had my sisters baby shower on Saturday and I was so happy with the service. First off I was able to decorate they set up a separate table where I was able to put the cake and presents and decorate with my own theme. We were not rush and…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURzcUtmUlBREAE",
            "text": "We had been to Pio Pio many many years ago for our anniversary when they were at their original location next to Pio Pio to go. Since then we have been in love with their  Rotisserie chicken and their classic green sauce. We decided to revisit them at their new location for our anniversary this year and were pleasantly surprised. The new location is a massive hall. We had to wait around 15 minutes and were seated at a comfortable table.  We ordered the matador combo which includes one whole grilled chicken, hot dog and French fries, avocado salad, rice and beans and sweet or green fried plantains. For dessert we ordered the Tres Leche cake to share. The portions were so huge that after 2 adults and 2 children eating, we still had leftovers to go. The food was delicious with reasonable price, service courteous and quick with them attentive to our needs. The only down side is the noise as there are so many people!!"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4OHJ1V0lREAE",
            "text": "Lo siento mucho Pío Pío pero no te puedo dar 5 estrellas. El sabor de la comida es exquisito, pero me gusta si voy a un lugar y me cobran caro que me den el servicio. Las porciones son más pequeñas y subieron los precios. Hago un sacrificio de buscar parking por media hora porque no tienen. Esta vez los camareros te servían sin agrado y sin una sonrisa como que están hartos de trabajar allí, al dueño que les pague bien entonces. La música demasiado alta que parece una discoteca, solo le falta una orquesta en vivo y la pista, lo cual deja de ser un ambiente familiar. Los precios excesivos para la cantidad de comida que sirve. $11 dólares dos empanadas? De verdad mejoren para que no pierdan mas clientes. Les dejaré un video de antes y fotos de ahora del arroz chaufa $22 y juzguen ustedes. Por ahora no regreso."
        }
    ],
    "reviews_count": 79
}