{
    "name": "Cinco de Mayo",
    "place_id": "ChIJHRZbKQtbwokRMno-DKCw0Ow",
    "grid": "BK7",
    "address": "407 45th St, Brooklyn, NY 11220, USA",
    "rating": 4.8,
    "user_ratings_total": 318,
    "phone_number": "(347) 384-2495",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toSFEybHpUMFJEV2xKWWNDMW5XVWhqUVdnMGFXYxAB",
            "text": "I would love to come back again"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wSFlWZDFhRkkwTTNkb1VrNU1jazUyWjNGNFdHYxAB",
            "text": "I ate from here twice. Sadly, it wasn't very good. The first time I had a falafel wrap, which was silly of me to get from a Mexican restaurant, but wanted to try it. It was okay, kind of bland, couldn't taste the hummus at all, it was pretty dry.  The second time I ordered the taco salad. There was hardly anything in it! A lot of soggy romaine, but hardly any toppings - you needed to pay extra for most toppings. No corn or Mexican rice options to add.  The taco shell was greasy and not very good, sorry, but I need to be honest. The red homemade salsa tastes like watered down spicy ketchup, it is sooo weird and hard to describe. This place isn't authentic Mexican food, not sure what to classify it as. I'm sure the people who work there are lovely, but the food for me is a no-go!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGTlVTMUhZbUo2TWtWVVoycHdaV2hsWVRJM01GRRAB",
            "text": "the food always hits and the price is great. thank you!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WcE1HZFNNa2RxWDBaVlVuSkpUbGxDYkZseU5IYxAB",
            "text": "Delicious taco, kids meals, and service was excellent! Love supporting a local business."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSTFpHVTVjRUZwT1hSSFJFNDJTSG8yVEhGM1kxRRAB",
            "text": "Walked by this place a millions times the past few years and finally decided to give it a try …. Omg what I’ve been missing out on!!\n\nGot a steak salad with pinto beans and they gave me a huge portion of meat (got 1.5 meals out of it) . Price is around the same from other salad places but ingredients here def taste fresher and guac was included."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KbFFYcFdNV05SVFhGbGJIQmZja0ZqWjBOVFlVRRAB",
            "text": "Really delicious tacos, fair prices and generous portions will definitely be back love their collaboration with Eva‘s from New York City the staff was very helpful and friendly and the tacos I had were delicious."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WaGJuQklaMTlQVG1wTVl5MDVWMVZPTW1KVE0xRRAB",
            "text": "We had Dinner there last Night and ordered chesadillas. Walters were really friendly and cool. Food was excellent. After dinner we had a stroll through this really picturesque neighborhood of Brooklyn. Really enjoyed the evening!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBMU5qRm9PRkpDUkVoclpIbDRaMjFYT1RWSFJrRRAB",
            "text": "I’ve never had falafel tacos before and they were SO GOOD. I’m not a local but will definitely make the journey to come back."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CQmNYTkhNVTVmZFZaRmJYZHFPRUZGTUY5alpWRRAB",
            "text": "Unos tacos increíbles y la mejor atención me la dio Alan!!! Es un genio el sabe cómo guiarte en la mejor elección"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWWVVtUTFTM2xzUzFCdlNVWkxNRWhoU1daSmNIYxAB",
            "text": "the ABSOLUTE BEST taco i have tried in brooklyn so far best prices best DEALS, amazing service amazing team and atmosphere!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOaFZuQnZRV3gxTTJkVGJWWmplVWhvWW5Fd1ZHYxAB",
            "text": "I've ate here a couple of times and the food has always been good. Today i tried their cinco de mayo plate. The seasoning is delicious.  The staff is nice and friendly. Definitely reccomend for a sit down place with friends or fam or if you need a bite to go. Only sharing half of my plate bc the rest i devoured it and let's just say the portions are great."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5Q01WRnNVRXRxUVVWdmNtVkVRWGRLY0V4WlVYYxAB",
            "text": "I just had the Birria tacos. 🤤🤤 Dios mío, fueron unos de los mejores tacos de Birria que he comido en mi vida. Hands down one of the best Birria tacos I’ve had outside of Mexico. I might go into debt buying tacos from here."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21NMVZWTk1jbWxETTJWQ1NGcHJTa3M1U0dab1MyYxAB",
            "text": "Great food and Carrot cake"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GVVdIaG5SakJLT0RCcmRHaHhVMll6VEVGbE1GRRAB",
            "text": "All good!"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIX0wtTkpBEAE",
            "text": "Great experience"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ZNVNqRXhNWEkzUjA5ME5HTjZWMGRMYkc5VVNtYxAB",
            "text": "Got uber eats from them last night. Garbage food nasty never again. Garbage"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jMFlURnNkVkJSWXpSRFNGWnRSMkZsU0VsaGJsRRAB",
            "text": "They had a spin the wheel and get an item for free which caught my attention. I was recommended the Cinco de Mayo bowl which was amazing. The nachos were crisp and pineapples were a nice touch. Overall great place to eat tacos if you prefer indoors."
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxNlkydHFUa3RSTjI5aE5qUXhZWE5OU21oSmJVRRAB",
            "text": "Excelente servicio y calidad"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMenM3dFNQenBqSjR3RRAB",
            "text": "From the Owner of Shally Beauty Salon- The standout dish was the quesadilla and tacos grilled to perfection with a smoky and tender center. The guacamole made tableside was fresh and flavorful, and the house made tortillas was outstanding."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJeVF5NW42dDUtUTF3RRAB",
            "text": "Great and delicious food. We had the tacos, burritos and quesadillas. All very good and highly recommended."
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPeUxpOWVxNTdXQ0ZBEAE",
            "text": "Muy buena la comida, la recomiendo sin duda alguna"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLaVVyS0hxbnFpMmZnEAE",
            "text": "Riquísima la comida y excelente servicio 🤗🤗🤗🤗🤗"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKYkJ4Nmlic0l1Tjd3RRAB",
            "text": "Excelente comida se la recomiendo"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOV3N6cTdkNTlIeF9nRRAB",
            "text": "Excelentes"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLbXRzc2ZMOUlqckZnEAE",
            "text": "Favorite place to get lunch in sunset"
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJUHk2UEs4NjdpcFVBEAE",
            "text": "Una delicia de comida mexicana, sus tacos de birria 🫠 son espectaculares con su sabor, prove la horchata y es muy buena, la chica que nos atendió muy amable: sin duda alguna cuando vaya a Brooklyn les vuelvo a visitar."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURva1lfbUhREAE",
            "text": "I love coming here. The workers are friendly and the food is delicious. Prices are very good too. You’ve got a regular :)"
        },
        {
            "date": "수정일: 6달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2MnEzZmZnEAE",
            "text": "Lamentablemente ya este restaurante no es el mimo la comida  última que pedí las quesadillas parecía elástico súper dura ni se probaba el pollo muy mal parece que cambiaron el cosinero."
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJNlBtZF9nRRAB",
            "text": "La comida muy mala para domicilio no pierdan el tiempo"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3bHV1TTFnRRAB",
            "text": "such yummy food and friendly service!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRMl9hQ1RBEAE",
            "text": "I was already going to give them 5 stars for the tasty burrito and fresh salsa and chips, and then they threw in a free empanada"
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRbG9EX2VBEAE",
            "text": "Me sentí en mi casa nos atendieron súper bien y mi hijo salió enamorado de esa atención tan especial por parte de todos que experiencia tan increíble"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRaExXb0d3EAE",
            "text": "Food is really good! Amazing prices! Staffs are all so so friendly and welcoming every time!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRdWZDRVdnEAE",
            "text": "food was so mid, the tacos lacked so much flavor, were extremely dry, and barely had any meat. we started with chips and salsa and i must say that that was the worst and when i say worst.. i mean WORST chips and salsa i have ever tasted. the chips were so stale, some had too much salt, some didnt have any at all, and step into any one of your local supermarkets and you can find better salsa. this salsa tastes like lemon, sugar, and a hint of hot sauce. the “chicken” tacos had a max of 5 pieces of meat in them and the rest was just pico and lettuce, plus the ingredient ratio to tortilla ratio was way off.. there were two very thick pieces of tortilla and it made it even more unenjoyable and dry than it already was. we were charged over $15 for 3 birria tacos and a small cup of consume, the tacos were so dry, lacked so much flavor that a birria tacos should be packing and is wayy overpriced.. i would understand if it was actually good, for a sit down resturant this is unacceptable. you could go to any food truck in the radius and find wayy better tacos for wayy cheaper. we were also asked if we wanted water, and correct me if im wrong but a sit down resturant usually has free water.. but no, they charged us over $7 for 4 bottles of water. the tacos were so bad some of us could only eat one before our stomachs started aching. this is honestly the worst tacos ive ever had, and usually i love me a taco but im going to stop eating tacos after this. i would not recommend to anybody but my worst enemies.. btw do not sit next to the bathroom"
        },
        {
            "date": "8달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnMmJhTldBEAE",
            "text": "La comida muy buena"
        },
        {
            "date": "8달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnb2U3c2tBRRAB",
            "text": "Iván Excelente servicio, y la comida muy deliciosa.\nRecomendado 👍"
        },
        {
            "date": "8달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnb2ZpM19nRRAB",
            "text": "Buena comida, Ivan el mejor!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnb2Rpa3R3RRAB",
            "text": "Excellent food, delicious and very tasty. Perfect for parties and catering services . Definitely will recommend to try. They have dine in, take out and delivery. Thank you so much, really enjoyed."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNneVBTc1RnEAE",
            "text": "Food was super good and has a very laid back. If I'm ever back in Brooklyn I'll be back."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfOWJpRXRBRRAB",
            "text": "I tried this place for the first time because a friend recommended it to me and I have no complaints! The birria tacos were so yummy and juicy. The prices are reasonable. I also enjoyed the complementary chips and salsa. I will definitely come back."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmX1lHbzhBRRAB",
            "text": "When I want a burrito, I go here. I also recommend visiting these guys and trying their burrito!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmdTVPRUd3EAE",
            "text": "Excellent food and service.\nThe cherry on top was romantic live music! Which is not a regular thing but ah it really made our night."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2dmN2cmZnEAE",
            "text": "Great little spot, no frills, just incredible Mexican food and nice staff - all for a great price. I had the birria tacos and they were INSANELY delicious. Husband had a burrito and he loved it, too."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQN2JfRW5RRRAB",
            "text": "Had their pozole, great for the price point and delicious 🤤"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYeWRXRHJ3RRAB",
            "text": "Food, service and staff are great!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYbkt5WHBBRRAB",
            "text": "The server was very nice, and the food came quickly. They also gave us free tortilla chips with salsa, which was a nice touch before our meal."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYenZHWlRnEAE",
            "text": "Food was fair tasting.  Order brown rice, 😋 delicious.  Yup fair is my rating folks."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURucXQtMkh3EAE",
            "text": "The food , service and prices are excellent , good portions , , no words to describe how good experience we have with them , 100% we will order food from them again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuLV8tak13EAE",
            "text": "Loved the chicken soup special. Especially for cold seasons"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNueHAtTjFnRRAB",
            "text": "The food and service was phenomenal. The prices of the food are very very reasonable me and my girlfriend enjoyed every second of our meal. If you’re ever in the area or looking for a nice meal this is the spot."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIal9YTWZ3EAE",
            "text": "The food was really tasty. It filled me up immediately. I got Birra tacos and chicken nachos I was able to eat outside and still enjoy the music it’s a nice and peaceful atmosphere"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqeHFMdzJRRRAB",
            "text": "We came here because of the high rating, but we were extremely disappointed. To start, the chips were very stale, and the salsa was nasty; completely inedible. The salsa was sweet and had a disgusting sour flavor. Tasted like a sweet pickle soaked in ketchup. The Horchata was homemade, and had a good authentic flavor. We got the Burrito with Birria (shredded beef). The beef itself had little to no flavor, and was dry. Overall, the burrito tasted decent but of subpar quality compared to “good” Mexican food. The only reason that made it two stars was because of the homemade  sauces the food is served with. The red being a classic Salsa Picante (red hot sauce). The green being a pleasant cilantro lime sauce. The food was in desperate need of the sauces. If the food tasted even close to as good as the sauces, it’d probably be closer to 4 stars even with the stale chips and fermented trash salsa. I have NO IDEA how this place has such great reviews. My advice: find a taco truck instead."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCa2RIb1B3EAE",
            "text": "One of my favourite spots for the real taste of Mexican food plus the great service from the staff. Had a Chicken milanaise torta with avocado slices, onions and tomatoes. Which was delicious, served with its homemade green sauce 😋👌Highly recommended they have Salted beef(cesina) and Pork as well."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSemRqTFl3EAE",
            "text": "Very filling burritos, very tasty, big space. Right near r train. Dining in comes with chips and sauce. Fish burrito especially is so soft and tasty"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSNXFhRFZREAE",
            "text": "one of the best chicken quesadillas i ever had... the chicken is so flavorful... this is the best mexican food in sunset park !!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlclotNGtBRRAB",
            "text": "I bought 2 burritos here al pastor. Very good customer service. The burrito is really good, big enough and very tasty. They give me 2 cans of soda free with the order."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIZ29qWlNREAE",
            "text": "Tacos were amazing! Me encantó, que hasta quiero más😋"
        },
        {
            "date": "2년 전",
            "language": "de",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNabE0yY2hnRRAB",
            "text": "Wir waren gestern hier essen und es war unglaublich lecker. Das Essen war frisch. Die Bedingung war sehr freundlich.\nWir waren begeistert.\nWir kommen gerne wieder!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEaWFTY0RBEAE",
            "text": "Affordable and delicious food. The workers are so nice."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsM2U2TFBREAE",
            "text": "It is really delicious and the place is cozy and quiet... You have to visit them because it is worth it"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURINnBQSS1BRRAB",
            "text": "Super atentos y compartieron tacos con bebida! Super amigables!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKbjVtajlBRRAB",
            "text": "My parents come here all the time for lunch and dinner and suggested it to me. I tried it today and ordered a hard shell taco salad. It is BY FAR the best hard shell taco salad I have ever had! Food was super fresh and as an added bonus they include little samples of their protein carrot muffins with your order !!!  highly recommend!!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIN2Y3QUVnEAE",
            "text": "Excelente lugar para comer, limpio y buena atención; el tiempo de espera es poco. Los tacos de birria y burritos son mis favoritos, aunque cualquier cosa que está en el menú lo preparan muy delicioso."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGbTlMbHVBRRAB",
            "text": "Very tasty and big portions"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0bjVmUFJBEAE",
            "text": "No idea how I ended up here for lunch and had no idea what to order but the gentleman serving was super friendly and suggested a plate of steak/rice/cheese/beans/salad (a burrito bowl?). All very nice and would visit again if in the neighbourhood. A happy first time customer."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNka1BQNzNRRRAB",
            "text": "I ordered takeout from this restaurant through Uber Eats, where it's selected as a Top Pick spot, but unless the restaurant was having an off day on the day I ordered, this is far from being a top Mexican food joint.\n\nThe South American burrito was gigantic, sure, but it lacked any semblance of flavor. Nothing tasted fresh and it was bland all the way through. I couldn't finish it. I had about a third of the burrito left over and decided to throw it away, much as I hate wasting food, it was difficult to stomach. A entire burrito of indistinguishable mushy beans and rice and hard meat. Yuck. 1/5\n\nThe Mighty Jeff Rosas was a little better. It was still bland but in a bowl form, it made it easier to eat with less mess. The portion size is still big, but I was able to finish eating the entire dish. Again, it lacked umami and didn't taste of fresh ingredients. Complete absence of that bright zing and pop in your mouth that real Mexican food brings. 2.5/5\n\nThe best thing I had from here is the horchata. It was enormous and very tasty. I liked the cinnamon notes that were evenly spread throughout the rice milk. It didn't get too grainy near the bottom like some poorly made horchatas do. 4/5\n\nI doubt I'll order from here again.  There's so many Mexican restaurants all over town, and this one is definitely mediocre. It says \"Health\" in the name, which may be true, seeing as there's not even a lick of salt on any of their menu items, but in exchange, you get sad-tasting burritos. Is it worth it? Not to me."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6b2ZqUE5nEAE",
            "text": "Love this place, especially BIRRIA tacos and the dip sauce they give for the chips. I wish they were open later. Also the pricing of the food is very affordable"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSdnV6eE13EAE",
            "text": "Ordered 4 times and very happy customer.  The chips and salsa is so good, love their taco bowl, hubby loves the 3 meat dish.  Very friendly each time we call in."
        }
    ],
    "reviews_count": 68
}