{
    "name": "Ayat Industry City",
    "place_id": "ChIJx-uXbWxbwokRgOqFfrEIEus",
    "grid": "BK7",
    "address": "274 36th St, Brooklyn, NY 11232, USA",
    "rating": 4.3,
    "user_ratings_total": 334,
    "phone_number": "(718) 831-2585",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poeGJtNURlVE5aYVRsVlZ6ZEdTVUpKVFZORVdWRRAB",
            "text": "I got Mix Shaw SANDW to go, and some of the chicken was completely raw. I did not get food poisoning though. (so 1 stars, not 0 lol) I was eating at home, was not paying attention to my food. Noticed something that had texture like eggplant, so took a look. It was raw chicken. I disposed of the rest of the food and ate like 6 vitamin Cs and 2 tablets of activated charcoal and 2 shots of apple cider vinegar. And I did not get salmonella."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210RWJFcHhjazFDWjJObmEyZDZWbTVvV0V0ZlZHYxAB",
            "text": "A lovely restaurant with great staff and delicious food. I came here with my family and we were so well taken care of. Thank you Ayat for bringing beautiful Palestinian cuisine to Brooklyn!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25VelJUQmtiamh6V200MlJUa3dRMnh3TVVRMFIxRRAB",
            "text": "We had a group meeting in the room upstairs tonight and the staff was very easygoing and accommodating. The food was also delicious and very generous portions. We’ll definitely be back next month."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWVlZ6SXRaRGR1VkhCUGJEQldlRmxTVUhWT09XYxAB",
            "text": "Fantastic food"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214d2VYTXRlVzB5WkVOWlFWaGhiVmhKVFdOM1ZYYxAB",
            "text": "Delicious food, excelente service 💙\nJosue was very kind and professional!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKQlMwZFhWa1ZLYVhoRFREWmxNbUpJWWxGM2FWRRAB",
            "text": "Delicious food, great vibes. Will definitely be going back to enjoy again with my entire family!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CQ09YRXdWa3RTYlhCUGFYVjNjbTV4VUhOd2NHYxAB",
            "text": "I just wanted to share some feedback about my recent order from your Industry City location. The food wasn’t up to the usual Ayat standard — the chicken shawarma was really chewy, there were no fries on the plate, and overall the quality was disappointing. I’ve been coming to the Bay Ridge location for years and it’s always been excellent, but this one really missed the mark. Just wanted to let you know from one Arab to another — I expected better from Ayat."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GVVIyUkxVRE5HTVVWWVRUUk1aRkkxVWpaNFVXYxAB",
            "text": "The food was amazing! Would highly recommend!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjMVFXZGZRM2wzYzNCU0xXcE5TR1Z5U1MxUldWRRAB",
            "text": "Ayat Restaurant in Brooklyn is an absolute gem! From the moment you walk in, you’re greeted with warm hospitality and the mouthwatering aroma of freshly grilled meats and spices. Every dish feels like it’s made with love — the hummus is creamy perfection, the shawarma is tender and full of flavor, and the falafel is crisp on the outside and soft on the inside.\n\nWhat really makes Ayat stand out is the attention to detail — the presentation, the generous portions, and the authentic taste of Palestine in every bite. The staff are friendly, attentive, and always make you feel at home. Whether you’re coming for a casual lunch or a special dinner, Ayat delivers every time. Highly recommended for anyone who loves bold, authentic Mediterranean flavors!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21NM0xVYzJXVWxtYW5kS2FVTkNjak15YkRkVE0xRRAB",
            "text": "The chicken rice one was little bit dry but other dish was delicious. Good portion size."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kUE5FVllOMGRpUzBwZlQzWkhjWEZtV2tKVE5rRRAB",
            "text": "Two nights in a row I choose this restaurant. Wonderful chicken kebab plate!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSdVZrWlRhbTFtWjFoSWRFcHFhbGN5VkRoUlZrRRAB",
            "text": "The food here is absolutely unreal, and the service is so kind and accommodating. This has quickly become one of my favorite places whenever I visit NYC. I live in Florida now, and there’s nothing like this around here. Your menu is epic, and I truly appreciate your presence. Having lived in NYC for 30 years and only recently moved to Florida, my only regret is not discovering this place sooner. So, so good, my friends!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoTFNVcFFXa2x1U0dnM1YwbzBWelJ2V1RWbWFuYxAB",
            "text": "The food was delicious and everyone was so generous! I got two appetizers and I got very full and we even received free dessert in the end! Delicious, I highly recommend! And the garlic sauce is top tier"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2todVNUSlRjbWd3Y0ZVNU5HWm1XRTQzV1c4d1dGRRAB",
            "text": "Ive been looking for a really good Mediterranean joint, this one didn't disappoint.  Def. try the muhammara."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkWVp6VkxRaTAwZVc4d09FUnVSMnA2ZWkxbGFVRRAB",
            "text": "Delicious Palestinian food, presented beautifully. Staff were very helpful too. Can't wait to come back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sRE1YUjBkVk5WUm1sdFpTMHpNR2xUVUdRMlUwRRAB",
            "text": "Such amazing food and service. It's a new favorite, must try spot NYC for me. Try the Grape Leaves, Haloumi, and Spinach Pies – they were amazing! I'll def be back"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wcVRGSnBRbkZ1VUUwd1RIUmhhVGxLYmpKV1prRRAB",
            "text": "The food here is fantastic. The vibes are so high. There was a horrible man sitting next to us making everyone at his table uncomfortable, but that is unrelated and I doubt he’ll be there when you visit. Five stars."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taRWVtNWlaMU40VUdaMWRFUXRPRFJRWDJ4UExVRRAB",
            "text": "Excellent food excellent service excellent price point.\n\nIt’s bright inside on the first floor, but the roof is lovely. Any lack of ambience is completely overshadowed by the amazing food.\n\nThe waitstaff makes you feel like you’re eating at your grandmothers house. Extremely welcoming and generous.\n\nI will be back, to this location and others. Nothing but great things to say about Ayat."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201TUxXSnlhRmM0V2xGUlZXMXhiR1pLUVY5a1FsRRAB",
            "text": "I actually visited the location and the service was not friendly"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxd2QwSlhiMlp4TUVWbmNqZExiRmN6V1c1UWJrRRAB",
            "text": "I have tried Ayat before but this was our first time at this location.\n\nThe bread was not freshly baked like in other locations. The baba ghanoush didn’t taste fresh and had a strange taste. The tea was served cold, which was very disappointing. Even the manoushe was off, what we were served was essentially pizza with cheese, not a proper manoushe. There’s a clear difference between the two.\n\nI strongly recommend doing some quality control across items to bring this location up to the same standard as others."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ac2VFcEhibk5ITmxnd2NsTkljRUZhVG1reWFVRRAB",
            "text": "Incredible food & lovely people!\n❤️🖤🤍💚\nI met some friends here for lunch a few months ago & we had a wonderful time. Our server was so friendly & helpful with great suggestions & answering all of our menu questions. We ordered many different dishes & shared everything which is a good way to go so you can try as many items as possible. The food was absolutely delicious, the atmosphere was lovely & it was so nice to support a Palestinian restaurant at the same time! Highly recommend!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5U1Yxb3RNMFkyVlc1bU1VdFdRakpzYUY5U1VrRRAB",
            "text": "We were visiting Brooklyn and looking for a place to have dinner near Liberty View Brooklyn Hotel. We found Ayat at Industry City, which was m a 10min walk. What a cool place! We were just looking for some dinner but we enjoyed a nice walk browsing the area and retail shops after dinner.\n\nThis was our first time having Palestinian food- it was so delicious and the portions were generous. My hubby and I split a large Chicken Kebab platter and were plenty satisfied. The food came out beautifully plated with vibrant colors from the yellow rice, the fresh herbs on the chicken and the fresh green salad. It was seasoned perfectly, flavorful without being too salty or heavy.\n\nI definitely recommend this place and wish we had time to try more things on their menu."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkWWJrRXRYemxpTUhGNGEwNVllV1pqUVdwd00wRRAB",
            "text": "Food is amazing and the service is friendly and efficient. Always go here. Never go to Sahadi's."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSWWRVeHBiSFoxVVVGYWRYUTFTWGxaVlZsMmQzYxAB",
            "text": "Fantastic falafel, hot fresh pita and the fried meat dumpling things. Mwahhh ! Baklava is divine."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xZdGJHNHhWWHBoTlhRemJHVkNaVzB5ZERSS1lYYxAB",
            "text": "The muhammara is delicious, the salad so tasty, the service very kind and attentive (thanks Danny!) and so many details like the oluves at the table!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201MldEQlpYMGh6ZUdOR2NHTlBhSFZ0T0Y5bVkyYxAB",
            "text": "Got the chicken shawarma platter, which was really good. Enjoyed the sauces with it, and the pita!! Also got the lamb kebab sandwich but it was very chewy :( However, the Arnold palmer was sooo goood❤️Would go here again but wish the staff were more attentive."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0d1VIaGljRlEzTWt4R1pVMUtRV2hsZGpkT2RFRRAB",
            "text": "BBQ chicken jumped from $15 to $19 crazy\nNot coming back to this place\nTaking advantage of “ Free  Palestine “"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4Q01uTk9jVGxWTWtGMk9VZHFVREZXU3kxRmVVRRAB",
            "text": "We were a group of 9, including a baby. We sat on the second floor which gave us a lot of privacy and quiet. The food was delicious and ample. We had two mezzo platter and two grill platters and there was more than enough food. Everything tasted great. The kibbeh was excellent. The chef got the stuffed cabbage and squash just right. Not an easy feat. The grilled meats were juicy and tender, especially the lamb. Our servers, Daniel and Olga were attentive and very reliable.  The price was just right. We will be returning here often."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WclYwOXRWREYxUzJkT1puZExjR2xmYW1GTmIxRRAB",
            "text": "Very good food, vibe, and staff. My friend and I shared some amazing lamb kebab and beitenjan. The eggplant in the beitenjan was a bit softer than I prefer, and the dish was very sweet. Even still, it was delicious! The lamb was amazing,…"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21zNFRVZG5WemRUUlRkdU0yY3RjMWd3UTNSTlIyYxAB",
            "text": "Food is good, portions are nice,  service was a tad slow but overall good experience, would go again"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21JM2NUQmlNWEJJVjBSdVJEWk1jMFptV1RST1UxRRAB",
            "text": "The food is AMAZING, The service was professional, courteous and pleasant. The Atmosphere is nice enough, what earned 2 stars was the chairs. The metal chairs were the most uncomfortable chairs, Impossible to get comfortable on. I implore the management to invest in some more comfortable seating. Please"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aNmFubFhkalpDYjI1WU5GZHNTRzlrWlRGV04yYxAB",
            "text": "Never say no to dinner at Ayat! The absolute best restaurant in nyc"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oRlZGOXhXRFV0V1dKQ01qUmxUMlZHV1VwemRHYxAB",
            "text": "Food was good and arrived quickly. My favorite was the cigar rolls with cheese!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VNT3V2c3pRMGEtZmpnRRAB",
            "text": "I’ve eaten at Ayat about five times over the past few years, both dining in and ordering via Seamless. The food has always tasted great — no complaints there.\n\nUnfortunately, the portion sizes have gotten so small that I don’t think I’ll be coming back. I just ordered a chicken bowl for around $20 and was shocked at how little chicken was included. I actually weighed it: just 94 grams (about 0.2 lbs).\n\nIt’s a shame — the food is genuinely delicious. If the portions were more reasonable, I’d happily be a loyal customer for years to come."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPeVFyN3paLUx5d1NnEAE",
            "text": "I saw their new menu so I dared to try their new salad and I was delighted with the flavor combination. The service was friendly. I will return with more friends so they can try their new dishes."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VLVE14b3l2OG9yOFBBEAE",
            "text": "This isn’t authentic, its dry and flavorless, but the service is good"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VQbnp1X1RXenZ6dV9RRRAB",
            "text": "Of all the Ayat restaurants I've been to, this one was the worst. They are heavily understaffed so the service was terrible. The food (kafta) was cold and hard, because it had apparently been sitting on top of the counter since our server wasn't around. In general, I love the Ayat restaurants my favorite being the one in Bay Ridge, but definitely do not recommend this one."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VNakFpNGkzaE5mTGNnEAE",
            "text": "Ordered from them twice. The first time, they substituted a less expensive side for the one I ordered. The second time, I ordered a shawarma sandwich and 2 sides. I received 2 sides. Buyer beware, order elsewhere."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQQ1Z3SmVmaE9EbGR3EAE",
            "text": "Great food and staff. Loved the atmosphere 👌"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZaE1ta0tnEAE",
            "text": "1st time having Palestinian food. Delicious is all I can say about the food."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvellLNHhnRRAB",
            "text": "I was honestly impressed!! Who would say that Palestinian food would taste delicious, I ordered Chiken Kebab and I loved it, the ingredients had a fresh taste and the taste exceeded my expectations. The super fast service, plus the staff was very friendly and efficient, would definitely come back to this place! Highly recommended"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvLVl6MXh3RRAB",
            "text": "Used to be my go to place in the area, but over the years it really deteriorated, just make the effort and go to bayridge location.\n\nWasn’t going to leave a review until I found some hairs in my kids food.\nShawarma and kefta were burnt and dry, kibeh was microwaved, salad tastes 3 days old, falafel was dry."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvanBUMVVnEAE",
            "text": "Question about food wasn’t answered. Food was lukewarm. $26 for overcooked beef. Waited for 15 mins for a plate that could be put together in 3 mins. Maybe they used to extra 12 mins to overcook the meat. At least the takeout bag was nice."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNva3B1LXVBRRAB",
            "text": "Always so so good."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvMktlYVNREAE",
            "text": "This was a wonderful spot! Everything my family ordered was stellar but the top highlights were the babaganoush, muhammara, and the beef shwarma. Genuinely the best I've ever had of each! The vegan platter was also not to be missed. I'll continue to dream about that cauliflower."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJbjg2ZVJ3EAE",
            "text": "Top notch chicken and rice"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJbnR2bjV3RRAB",
            "text": "The waiter Danny attended me today he was very kind, he has patience and knew how to explain the menu well and thanks to his recommendations I was able to make a good choice in my meal."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJbnZ2MDRBRRAB",
            "text": "Thank you Daniel for your recommendations in my meal everything was wonderful I will be back soon"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJLUxXaDRnRRAB",
            "text": "Food looks good but looks were deceiving. Lacking in flavor, meat was rubbery, rice smelt like it was microwaved. Mixed grill had little pieces of meat and it was not good. Very hard to chew"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJaXZxYVFREAE",
            "text": "Very slow service and not fresh."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRaEwyTUZnEAE",
            "text": "Very delicious, great service, no complaints, loved the chicken on rice with almonds cauliflower, and eggplant. The cold apps were amazing, especially loved baba ganooj"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBbjRIWmxRRRAB",
            "text": "The food was very good. I ordered the Maklouba. The chicken was seasoned very well and the rice was very flavorful. My only gripe is that it took over 45 min to receive my food and when I did receive it it was the wrong dish. If not for that I would rate it 5 stars. Definitely a great spot for a hangout with friends or a date night."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6cDgyc1lnEAE",
            "text": "We made ressos for six people for noon on the Saturday of Mothers Day weekend. We were running late so luckily, they were able to accommodate for 12:30. They have a few locations in Brooklyn but this one seemed like the most friendly for a sit-down Mother's Day lunch. The downstairs area has seating but seems more casual. It's nicer upstairs (which is where we were seated). There's also an outdoor patio on the second floor but they weren't open that day. We ordered:\n\n-Mezzen Filistini - a mixed appetizer of hummus, baba ghanoush, muhammarah, tabbouleh, salata tahina and labneh. My faves were the tabbouleh and the muhammarah. They give you complimentary bread with zaatar and olive oil at the beginning so just make sure you don't eat it all at the beginning. Otherwise, you won't have anything to dip the mezze in\n-Falafel - I didn't care for the tahini sauce but the falafel itself was great\n-Fattat jaj and fattat lahma - 6 layer dish of meat, rice, chickpeas, garlic tahini, crispy pita, slivered almonds, and parsley. We had one with beef and one with chicken. I preferred the chicken because the beef was a little dry. The slivered almonds added a nice crunch to the dish\n-Mixed grill with rice - this had beef and chicken kebab, lamb chops, and lamb (?) kefta. I really enjoyed the kefta\n\nOverall, it was a nice experience and everyone seemed to enjoy the food."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCXzV5UGJREAE",
            "text": "What a good time. Except the 20% mandatory tip added to the bill. What has NYC dining become?\n\nFood is delicious and the plating is on par with the casual dining. I would say if they use real table cloth. Then I will be amazed with what this place and IC had to offer especially for PPP on the meal.\n\nWe got the drink, meal for 2 and two appetizers which is plenty for 2 of us and a lunch to take home. I will say the portion is big but filled with rice and bread. It’s better than some place that charges $8 for a small plate of rice.\n\nDefinitely try the lemonade as it’s not too sweet and very refreshing. I love the layout but if you expect to get some quiet dining, this isn’t very good for that. You can hear every table. It’s more of a casual place for friends and family. I can’t wait for a warm day for their outdoor to be available. We have the enclosed upstairs which is very warm and comfortable.\n\nOne of the servers doesn’t speak English well but got our order 95% correctly. Also the service is fast. A bit too fast. We order and 5 minutes later, our food comes. I wish the meal is a little bit hotter as it’s warm. They can use another minute on the grill. Too much filling. You don’t need bread on rice seriously.\n\nOverall. It’s a pleasant time."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNibHBQR09nEAE",
            "text": "4/5 Mixed Grill ($34) - we loved the variety of the different  grilled meat options on this platter! Overall had great grill flavor, but it did lack some flavor that  is usually characteristic of Middle Eastern  cuisine.\n\n4/5 Pita ($2): Served piping hot with olive oil and Zaatar, which is always appreciated! A bit on the dry side and could use some salt for flavor.\n\nThe service is also on the slower side, we came on a Friday afternoon and there were 3 other tables, but our platter took a while to be served. Also note a ortion size, we split one order as a light lunch!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiNnV6M3NnRRAB",
            "text": "Quite good across the board. Nothing blew my socks off but I would definitely come back.\n\nThe lamb + cauliflower dish was a special highlight. I found the falafel to be too herby and not firm.\n\nPortions are absolutely enormous!!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3Xy12YlF3EAE",
            "text": "One of my personal favorite places to eat at. Amazing food and service. Please order Mezze filistini for a cold appetizer. You won't be disappointed 🤝"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqNmZ5bmpRRRAB",
            "text": "We had an amazing dining experience at this restaurant! The staff was very friendly and attentive, making our time there enjoyable. The beef shawarma platter and falafel appetizer were absolutely delicious."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwd2NXc1lBEAE",
            "text": "This is a casual restaurant with a cool vibe. It has indoor and outdoor seating with really cute decor and good music was playing when we went there.\nEveryone that works there was extremely nice, so I would give Service more stars, if I could.\nNow the food. It was very good food, flavors were genuine and really good quality, quantities were big, so the only thing I would say it wasn’t perfect was the pita bread. It wasn’t bad, just not as homemade as the rest of the food we ordered.\nMy favorite part, the honesty when we got the bill and it specified the amount difference between paid with card or cash. Which other restaurant does this?\n\nOh, before I forget, it is BYOB."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwazVqMkJREAE",
            "text": "After visiting the restaurant in Bay Ridge, we decided to try their location in Industry City as well. The food at both places was equally delicious, and we couldn't get enough of it. The portions were generous, satisfying our appetites. However, when it came to the atmosphere and vibe, we definitely favored this one!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPM3J2ZGdnRRAB",
            "text": "New place that I happened to walk by, good food. Personally I felt it was a little too dry. But flavors wise and customer service was great. There was live music  by the time I left on Friday afternoon.  And three dry part is the kibeh and sfiha (meat pie)"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlaHBXSkZnEAE",
            "text": "This restaurant is so beautiful, i liked the decorations and the writings on the wall. And the food, OMG it’s another story, it so delicious. I want to give a shout for  “Eli” she great us and offered recommendations on the menu, she was professional and nice, was always passing by if we need any thing else. One more thing they are really fast in bringing the food.\nI came in the afternoon, i will come back in the evening to try the upper part of the restaurant.\n#Free_palestine"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKc3Z5YWFnEAE",
            "text": "Ayat (the one located in Industry City on 36th Street) is a really cool place to go for Palestinian food. My friends and I decided to go here after seeing the cool rooftop deck from across the street while in Japan Village.\n\nWhen we walked through the front door  the smell of food was delicious and we went up the stairs to eat outdoors on the rooftop and were delighted with the decor and seating options - we had the entire upstairs to ourselves (it was a Thursday night at 8 pm, so we were lucky).\n\nWhen we sat down, we were presented with cool two-sided wooden menus and a basket of hot pita and some oil, spices and olives. The menu is very simple and the descriptions of the foods were helpful, but I opted to look up pictures of the dishes in the internet to get a good idea of exactly what we might be ordering as we weren't familiar with some of the dishes.\n\nWe ordered a mezze platter as an appetizer and the maklouba (a 2 person chicken dish, as well as lemonades. The Iemonade was particularly delicious.\n\nThe presentation of the food was cool, and the water cups look like little clay terra-cotta bowls and the plates are all the same terra-cotta style, which I really liked.\n\nThe food was all really good. I wanted to try many different things, but I'll have to go back to try more.\n\nI really loved the laid back dining experience and I recommend Ayat to anyone who likes Palestinian food, but even if you aren't knowledgeable about Palestinian, you can rest assured that you'll like it if you like Middle Eastern food.\n\nMy only qualm with the experience is that we were charged $10 unexpected dollars at the end of the day.  Unlike most places that serve you some sort of bread when you first arrive, if you run out of bread while eating your appetizer (which was a massive multi-person platter that really should come with its own basket of pita) when you ask for more bread it is replenished at no charge and the server didn't inform us that it would cost more.\n\nI was surprised to find that we were charged for $3 for the extra pita @ $1 per pita. The same thing happened when we were presented with the large dinner platter and ran out of the white sauce that comes with the plate, when we asked for more, the server just shook her head affirmatively and brought it to us without warning us that this little bowl of white sauce that comes with the platter would cost us $7 more.\n\nIt's not a good feeling to look at your bill at the end of your dining experience and find unexpected charges on there. The proper thing to do is let your customers know that when they are asking for replenishments of items that already come with their food to let them know there is a cost associated.\n\nIn this specific case, nowhere on the entire menu does it say that pita is an item on the menu and therefore there's no way to know that asking for more pita would cost anything. Similarly, when ordering the maklouba, nowhere on the menu does it say that it comes with a specific sauce that's on the menu, but when I looked at the bill I saw the $7 charge for a small Khyar ma laban, which I had no idea I was receiving with the meal. If I had known, I just wouldn't have ordered it. I had full knowledge that by ordering an additional lemonade that there would be a cost since it's on the menu as an item because that's an obvious menu item.\n\nOther than this minor issue, I still enjoyed the experience and I would recommend the place to Palestinian / Middle Eastern food lovers."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1MWZqUkV3EAE",
            "text": "Best food I’ve had in a while.\nThe mint lemonade (limonana) is so refreshing and the salads are paired so well. Everything is as authentic as it gets and gives back home feel. The fattat daj is my go to favorite and the mansaf is the best you will get in an NYC restaurant.\nThe mezze are all well done, war dewali, falafel, hummus, muhammarah, all of it is chefs kiss 🥰\nTheir original location in Brooklyn has the same level of quality and flavor.\nBest Palestinian food I’ve had outside of homecooked food.\nFrom the river to the sea 🇵🇸🇵🇸🇵🇸"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4cU1TRjJBRRAB",
            "text": "As of May 2023, BYOB (at least on the roof), and they didn't charge us a corking fee.\n\nGreat place for a big group and shared plates. Had a beautiful table for 12 on the roof. Shared a couple of the mezze filistini (assortment of appetizer dips), then got three meat platters and two vegan platters. All in all, the total came out to $23 each with tax and tip, and we had leftovers. Amazing!\n\nThe servers weren't around much, but that was ok. Had to wait for a while for more pita, but otherwise everyone was helpful. I do wish they'd answer their phone, I called about 6 times day-of to see if they were BYOB, so we didn't find out until we were there. But the delicious food and rooftop vibe made up for it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNybU1EQ3B3RRAB",
            "text": "I came here on a Monday evening after making a reservation for rooftop seating for 2 and walking in was approached by a short hispanic man who told us we cant sit upstairs because were not a party of 6 or more and needed a reservation. After we told him we have a reservation he still insisted on seating us downstairs until we told someone else who took us upstairs. It made no sense as the restaurant was empty and only had three tables of patrons. After 15 minutes of sitting with the menus noone came back to take our order so we went down to give the order instead. The bay ridge location is a million times better. The food was okay , atmosphere was nice but the staff is disorganized and doesnt speak english. They forgot to get us a soda which was whatever. Upon arrival they give you the tiniest little cup of olive oil and zatar which my neice can grab in her palm. I ordered filet mignon kebab it was a little chewy and flavor was not all there. Cheese pie was probably my favorite or maybe i was hungry. The zatar pie was the saddest zatar pie i ever had. Location is prime but the food was mediocre if they made it more organized and as good as bay ridge this location would be great."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtNHJfZWx3RRAB",
            "text": "Authentic Palestinian food. The mansaf is some of the best I’ve ever had especially at a restaurant. Hummus could use some more spices but overall a great food with lots of options."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqbWZ5MDVBRRAB",
            "text": "SO GOOD. This might be some of the best food I’ve had in NYC! Ordered braised lamb with cauliflower in yogurt sauce, came with huge dish of rice. Each table also gets pita with olive oil, olives, and zatar. It was delicious and the service was great! They even gave us extra mint tea to go!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqbDVEVVR3EAE",
            "text": "We came to eat with my family of 8, and we felt at home thanks to the hospitality and caring attitudes of the waiters. The service is quite fast and the food is delicious, the plates are quite large compared to the prices, it is one of the best restaurants you can visit with your family, I wholeheartedly recommend it."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoeDdmekR3EAE",
            "text": "Bangin food!! The waitress Eli is very friendly and welcoming and took great care of me! Love the food love the vibe love the service this is a great place to get some authentic middle eastern food ! Try the beef kefta!!  🤤 😋 🇱🇧 🇵🇸"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKOHN1RTB3RRAB",
            "text": "My wife and I came here for our Dinner Anniversary. Being that she used to work in the Middle East, she was searching for an authentic Palestinian food. She was recommended here, and the food is amazing. We had gotten the Fatoush and the Manaf. The lamb is very tender, juicy, and overall well cooked. We recommend coming here."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJNU51RTlnRRAB",
            "text": "Wonderful little gem I’ve just discovered. Also noticed they have other locations across the city. Some of the most flavorful middle eastern/ Mediterranean cuisine I’ve had in Brooklyn. The food court in Industry City is a vibe AND I highly recommend this spot more!! Grab a frozen from Barrows and walk over!! Happy Summer!!"
        }
    ],
    "reviews_count": 72
}