{
    "name": "Bangkok Bar NYC Industry City",
    "place_id": "ChIJBxjAar9awokR18rabXFPpo0",
    "grid": "BK7",
    "address": "238 36th St Building #2, Brooklyn, NY 11232, USA",
    "rating": 4.4,
    "user_ratings_total": 131,
    "phone_number": "(929) 469-6455",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25obVptbENXa1Z4ZWxOc1drZFlSMWh5YjNZMFJGRRAB",
            "text": "Best Pad Thai!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21NMlVuUmlTV055ZWtORWJubE1jMnR6VTFwUmNVRRAB",
            "text": "Came here after shopping at the outlets for a quick bite. Stopped here and ordered the Drunken Noodle with beef, Panang veggie curry and crispy spring rolls. It all had so much flavor and SO delicious! We will for sure be back on our next visit."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tObVlYSlVZMFZCWW5vM01FcDZPVVZyYTJWa04wRRAB",
            "text": "Delicious, quick, affordable lunch in Sunset Park. Always love stopping by Industry Kitchen and exploring the delicious food from around the world! Stumbled into this spot and it quickly reminded me of my trip to Thailand years ago! Super fresh, quick and easy and affordable! Loved the fried chicken basil stir fry and their coconut shrimp appetizer\n\nMust try spot if you’re working in the area, they also do venue takeovers for a Thai inspired party"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKT2MwOU9aa2N6Tm5kR2JucENSbmQwTW5sVFJVRRAB",
            "text": "Amazing"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCNlVVcEtXVXMzVG01dVFrNUVOWGxhTUV0WVgxRRAB",
            "text": "⸻\n\nBangkok Bar in Industry City is hands down one of the best spots I’ve been to lately. The food was absolutely incredible—flavors that made me feel like I was eating real Bangkok street food. Everything we ordered had so much depth, texture, and balance, it was unforgettable.\n\nWe started with the scallion pancakes on a stick, and let me tell you—they were so good I had to order them twice. Perfectly layered, crispy, and full of flavor, they’re definitely a must-try appetizer. I ordered the crab meat fried rice and it was packed with fresh crab and so flavorful that I honestly didn’t want it to end. My friend ordered the Crying Tiger, which is a beef dish with crunchy garlic, fresh red onions, and this amazing combination of sweet, tangy, and savory flavors. It had so many different textures going on—it was truly next-level.\n\nTo pair with the food, we had Singha beers, and they were just as impressive. Crisp, refreshing, no heavy aftertaste—just smooth and clean. It’s only my second time trying Thai beer, and I’m already a fan.\n\nThe atmosphere at Bangkok Bar is laid-back but vibrant, making it a great spot to enjoy authentic Thai street food flavors with friends. From the food to the drinks, everything felt fresh, flavorful, and made with care.\n\nI highly recommend Bangkok Bar to anyone visiting Industry City. Whether you’re looking for amazing small bites, flavorful main dishes, or just a refreshing beer to enjoy with your meal, this place has it all. I’ll definitely be coming back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toMGRGaENNRVJaTms1UGFFSXlkVmRGVlVVdFVHYxAB",
            "text": "I am not lying when I say these are some of the best drunken noodles I’ve had for. Great for a quick sit down or on the go. Will definitely be a go to spot of mine whenever I am in the area."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210WE5VTXhOa2gzVHpKYVdpMUhOa2hGUVRaMGVrRRAB",
            "text": "Really great atmosphere, great food and beverage selection. I got the crab fried rice with a side of crispy chicken & my lady got pad see ew with chicken"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2todWNWSkhhVGRoU25KSWNUWnlSbE5TU1dadk1VRRAB",
            "text": "I lived in Thailand for 15 years. This is the most authentically Thai food I’ve eaten in America. Everything is EXACTLY as you’d find it in Thailand — it hasn’t been dumbed down for the American palate. I especially recommend the coconut shrimp — the best I’ve had anywhere, including Thailand, and they even coat it with edible glitter so it LOOKS terrific — and also the tom kha gai (coconut soup with lemongrass and galangal). Be sure to order the mango & sticky rice for dessert."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBdExUQkNRVGhRVHpOZlVVRllhVGhHTnpWa04xRRAB",
            "text": "For starters, the Thai iced tea was pretty good. The Pad Kee Mao was delicious and came out rather quickly. My only complaint, if I had one, was that the price point was a little high, but so is everything else in the Food Hall."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210MVFWVk9RV296VTNFMFZVd3RYMnBGU2xOTmMzYxAB",
            "text": "ACTUAL THAI! Parang here has hit the top of the list for nyc! The portions are generous and very easy to eat on go or anywhere around industry city. They were very welcoming and kind for dine in! I found myself savoring the flavors deeply! I wanted to go years ago and now I regret waiting for long."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taYVgzWkhTbUZ0WlVkTWEweDZMVlpWZEhSeFFuYxAB",
            "text": "Very nice staff, quick service, great food. The Thai iced tea is also great!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205T1N5MDJTRGM0Ymt0WU1HdG9hM1F6TlU5S2MzYxAB",
            "text": "We’ve come here many times, and the delicious food, refreshing drinks, and friendly service are consistently excellent! The decor is also lovely and inviting (cool retro Thai film posters on display). In particular, I recommend the garlic rice dish (protein of your choice; I enjoy the mock duck) and various flavored Thai iced teas (right now I’m sipping the passion fruit one, and it is perfect on this hot summer day). Stop in, and enjoy this hidden gem!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25FNFNFOXRabkIzWkc5elpFRjBlamRPZW1scWFXYxAB",
            "text": "We come here every time we visit Industry City! The food is flavorful and fresh, and we are always greeted warmly when ordering. The decor is colorful, and there is seating inside. Highly recommended for a delicious meal and in our opinion, one of the best restaurants amidst plenty of great options!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pObVdVVldUMjVTYmtveFZISlRkSEl3V21aTExXYxAB",
            "text": "Amazing Thai food!! Excellent service!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aRGFWcFZSRkpaUnpsRk56RmFNWEl0YjJoUVJuYxAB",
            "text": "I love this place! I have a shellfish allergy and I enjoy their mango sticky rice! Their service is top notch!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KMGRWZzRkRGwwVUdGR1FVeGhhM2xqTUZKaFowRRAB",
            "text": "One of my fave places to eat at in industry city and the staff is always so friendly!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201eFRHUldiRGt4TjBGNU1GaFhTM0ZSVm5kNFMxRRAB",
            "text": "This is how crying tiger now so bad! Before they will separated the rice before, they put all together. How you think with mix source rice!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoWk0xWllTR0Y2ZG13MmNEZENWbEpaVERGb2JrRRAB",
            "text": "Came on a holiday and they were open which was a huge plus. I love testing out different Pad Thai dishes so I tried the Veggie Pad Thai Medium Spicy. It had a weird after taste compared to other spots I’ve tried. I was hungry so I ate it, but I wouldn’t recommend. The spice level wasn’t there either and I had to add sriracha to my dish multiple times to feel a kick. The staff was super friendly tho. And, my friend enjoyed her rice dish meal with chicken. Maybe I just had the wrong dish. I also like the fact that I can see my food being prepared."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkWlMxSnVVMHBXTVZWTE1qaGhhREZ5UlVzNVNYYxAB",
            "text": "Crying tiger is to die forrrr"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4TmFVWlJURXB1Y0c1c1UyeGFWWGRsTFdwd2MxRRAB",
            "text": "super good service and yummy food :)"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kU01VbERjbmxNVVVOcFFuTldla1JqZEVkVlluYxAB",
            "text": "Really great thai food, fresh ingredients, super fast and friendly service. Bangkok BAR is my go to everytime I come to IC. Really cute spot withnindoor and outdoor seating. Highly recommend!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OblUyWmZSalJpTmxkRGJVRjZjamhuUlc0NVgwRRAB",
            "text": "Love people here nice and food it yummy and fast all good here."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s4MlVXeE1NV1puZDJ0WGJIZFNNR2d4WWkxSlltYxAB",
            "text": "All great placevfir quick lunchtime-\nI love it here"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aQ1NrTkNhRmRFVm5wM01qUk9TM3BvVkMxUVpWRRAB",
            "text": "Great food, amazing staff!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJNWNWQjZhM1p6WTBSSGFWRTVSSFJ3VlhWdmVuYxAB",
            "text": "My favorite place to get Mango Sticky Rice!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPbmk1ZmFGMjhfa2pBRRAB",
            "text": "amazing!!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsT1JGRklhRkJIU1hodE9VVkdSM2N0ZFROYWRFRRAB",
            "text": "Really good service and food was so tasty"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJLU1sTzI5NE5uR1lnEAE",
            "text": "best thai in brooklyn"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sUmFFTTNNRzlTYlcxaE56Uk9SVXRHV1ZoUlMyYxAB",
            "text": "Great food and was faster than expected. Had the fried chicken over fried rice and was great!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJVDh3LVNxOGJLMWFBEAE",
            "text": "I had never tried Thai food before coming here but after trying Nua Yang, it easily became my favorite dish of all time. The manager let me know that under the new management they had removed it from the menu permanently. She was very nice and recommended the basil beef but it did not taste similar at all. It is very disappointing, coming here used to be a delight, i stopped coming here since !"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMM0M1c0RmXzgzbEF3EAE",
            "text": "My go-to Thai spot! The basil chicken is incredible — full of flavor, fresh, and perfectly spicy. Always hits the spot. Great service too!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPcWZoc25xMHNyQ0RnEAE",
            "text": "Love it! Try the Panang curry."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VObnk5XzNNeElXYWh3RRAB",
            "text": "Amazing, love the duck!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNNnQydEtBN0tUajhnRRAB",
            "text": "Delicious as always!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ210dGVLNGZfSk13EAE",
            "text": "Amazing spot with amazing service & wisdom. Food is delicious & staff is great!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMM2h0NU90Z3ZIUHp3RRAB",
            "text": "Very friendly environment. Food is amazing and the Thai ice tea is amazing"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJLWhsZlM2OHFUT2JREAE",
            "text": "Super friendly, really good Thai food."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VKYno3NlQ2b3VUMUd3EAE",
            "text": "The food isn’t tasty, the amount of meat for the extra charge is very small, and the photos don’t match reality. I do not recommend it."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VMLXEtZV9WbHVxcTh3RRAB",
            "text": "This Thai restaurant is rubbish. A meal costs 20 yuan for 6 small shrimps. Don't go to this restaurant!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VMbUR2cl9DblluNHRBRRAB",
            "text": "I order green curry with shrimp they put 6 tiny shrimps I won’t order again"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNva3JiVWJREAE",
            "text": "The food was amazing here, they cook right in front of you. The people there are really nice as well."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJaS1ya1dBEAE",
            "text": "Great food and wonderful customer service. I accidentally left my jacket here and they were very kind to hold it for me for a few days. But the food is great too."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJOGJ2OGVREAE",
            "text": "Bangkok Bar’s fresh lemonade is the perfect balance of sweet, tangy, and refreshing. Made with freshly squeezed lemons, just the right amount of sweetness, and a hint of citrus zest, it’s a drink that instantly revitalizes. Served chilled over ice, it’s a great way to cool down and cleanse the palate, whether you’re enjoying it on its own or pairing it with a flavorful Thai dish."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJOGFlLVZBEAE",
            "text": "Bangkok Bar’s Panang Curry is a must-try for lovers of rich, aromatic Thai flavors. The dish is perfectly balanced—creamy coconut milk blends with the deep, slightly sweet notes of Panang curry paste, creating a luscious, velvety texture. The addition of kaffir lime leaves adds a bright, citrusy aroma that enhances every bite.\n\nWhether you choose tofu, vegetables, or mock meat, the curry absorbs the flavors beautifully, making each spoonful deeply satisfying. Served with fragrant jasmine rice, it’s a comforting yet refined dish that captures the essence of authentic Thai cuisine.\n\nFor those who enjoy a mild, slightly nutty curry with just the right amount of spice, this Panang Curry is an excellent choice. Pair it with a Thai iced tea or a refreshing cocktail for the ultimate Bangkok Bar experience!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJb1pmRG9BRRAB",
            "text": "Very nice food and great service!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJX3RmX3BBRRAB",
            "text": "Love the vibe here with the old Thai movie posters and products from Thailand visible on the shelves. Bangkok BAR does the classics well and the staff are mostly from Thailand so they grew up with the items on the menu. Love the beef larb and crying tiger."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNndm9IUXJRRRAB",
            "text": "Can’t get enough of their tofu and mango rice!! Worth the trip every time. Such a fun area as well :)"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnMXRTQ3F3RRAB",
            "text": "Solid spot for authentic Thai food for REAL Thai lovers. The bold mixture of mouth watering flavors I expect when going to a proper Thai restaurant. This is now my go-to Thai experience when visiting NYC."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnbHF1U0RnEAE",
            "text": "This is hands down my favorite place to eat in Industry City! Seriously a hidden gem. The food is not only delicious but fun to eat. The staff also never fail to make you feel like family."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNncHFQSDhBRRAB",
            "text": "I honestly still can’t believe this happened. This was one of our favorite places to come to in IC. We love supporting small business but this was beyond disappointing.\nI found a baby roach in my pad Thai!! Will not be coming back!! Sadly"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3aXVpWUFnEAE",
            "text": "Located inside Industry City, this spot feels like a hole-in-the-wall bar with a Southeast Asia vibe on a hot summer day - perfect for a quick, authentic eat. The food was fresh, delicious, and true to its roots. I was thinking of ordering Khao Soy but it's no longer on the menu and their mango sticky rice is seasonal as always.\n\nORDERED:\nMe: Pad Thai & Thai Ice Tea: the Pad Thai was so fresh and delicious in every bit. The portion was so decently sized that i was so full after. The Thai iced tea was perfect.\n\nAnna: Pad See Ew & bottle water\n\nThey accept cash, credit card, and Apple Pay. All in order, I recommend this place and would come back again."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKeHJQV3lnRRAB",
            "text": "Absolutely flavorful dishes. I was pleasantly surprised by the Jungle Curry since I have never had this dish before. It was certainly spicy but the flavor is there. Pad thai is sweet and lime-y. The decor is a vibe too."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5cnBET0ZnEAE",
            "text": "Very impressed by their flavorful curry dishes, and very friendly service! Would absolutely come back to try more of their menu!\n\n4.5/5 Massaman Curry  -- loved the spices in this curry (very mildly spicy - especially great for those who have a lower spice tolerance), roasted peanuts and fried onions were a very nice touch as well.\n4.2/5 Penang Curry -- also very flavorful, 2/5 on the spicy scale, tons of beef and veggies\n\nBarstool counter seating with quick service and attentive staff members!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3cGY2TzBnRRAB",
            "text": "Beef rice with additional egg $2, total $21.68. I chose mild and there was heat. It was good but nothing too special. I didn’t see the eggshell in my photo before I took a bite and bit into one. Thought of bringing it back and stop eating but I didn’t want to bother bc it was only on the egg. When I was done I walked back to the cashier staff and showed him the egg shell and he said sorry. Not sure how I feel that’s all."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0eGZybmpBRRAB",
            "text": "Great food, curry is on the little spice side. Pad sew yoo and green curry is my goto.  Might be a longer wait during peak hours."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNMjlUQV9BRRAB",
            "text": "Anyone who knows me knows I am so picky when it comes to Thai food. This place is so delicious.  I had the veggie pad Thai and my mom had the chicken pad Thai. We ordered a side of bok Choy. It was really really good. Next time I want to try the curry. Staff was super friendly and so attentive."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUczhIeE1BEAE",
            "text": "Lady at the front wouldn't give me a bowl for my soup after asking for one. Had to share my soup with my party using a lid. Like I'm a dog.\n\nPad see ew is good and the beef is also very good. Best Thai in the area."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEM3J5Y2JBEAE",
            "text": "Great staff and service here! I always make time to come here and eat something when I’m in the area! I recommend the Jungle Curry with a Chang beer."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmd2V1eFFBEAE",
            "text": "Consistency good. The chefs make the food in front of you. There’s indoor seating as well as outdoor options for when the weather is warm. Delicious food and you can request spicier or milder to your liking. Been going to this spot for years. :)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREay1mdFdBEAE",
            "text": "So flavorful! I got the khua kling, which is a dry spice rub with green beans. My order came out quick and the dish was incredible, with a perfect balance of heat, numbing spice, umami, and sweetness. The portions are big enough for leftovers, too. Definitely watch out for the spice levels here, they’re no joke. Highly recommend getting an extra side of rice and a Thai iced coffee to cool down!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUeDV6Y3JRRRAB",
            "text": "Their Thai tea is phenomenal!\nGot the pad kratiem (sautee garlic) chicken, prob wouldn’t get again. Another customer said their Staff Favorites menu items are delightful so I’ll have to try those next time!"
        },
        {
            "date": "2년 전",
            "language": "pt",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoOTdLanBnRRAB",
            "text": "Pad Thai da melhor qualidade! Muito bem servido!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3OV9XNjRRRRAB",
            "text": "Decor and ambiance are so cute, very much like the restaurants in actual Bangkok. Food is pretty good. Thai tea is the right amount of sweet. Staff are very friendly."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0bE9fU3V3RRAB",
            "text": "Ordered pad Thai with chicken 3 times from them and I absolutely love the taste… The only important thing you should be careful with while cooking are chicken bones.. all 3 times I found quite a lot of tiny chicken bones in my meal, not good, please consider this review for future!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURydzQ3MFdBEAE",
            "text": "Cute little place, a little hole in a wall in the food hall. My rice dish was delicious and the perfect amount spicy, and the Thai iced tea was top notch."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoeWNpcUtnEAE",
            "text": "The food has good flavor, but their menu completely undersells how spicy their spicy dishes are.  The level of spice for a medium spice dish was so spicy I couldn't get through it (and I have good spice tolerance)\n\nSo, yeah, they should be a bit more transparent and direct about that."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxaFl5V0lnEAE",
            "text": "More. That's what I kept telling myself about the food...I just wanted more and more of it. This cuisine is not something I am particularly skilled at or knowledgeable about so it was not my first choice.... However it was one of the only things that was open on 1/1/24... So that being the case we had the had the Pad Tai and Pad Pak... the flavors were incredibly delicious... I wanted to eat both my meal and my sons... Lol.. We definitely could not finish them both, the portions were generous!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSdlliSVZnEAE",
            "text": "Beautiful people making food with love. I appreciate that their spicy dishes are actually spicy. If you ask them to hurt you with spice, they'll do it.\n\nThe dishes are all very flavorful, regardless of spice level. Just be aware that a fondness for sriracha or tabasco puts your tolerance at mild to low medium spice levels."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKbm91UkhnEAE",
            "text": "I ordered a pad thai from here and it was not good. The tofu was tasteless and broken into big chunks instead of small squares. The pad thai came cold. It was just not good. Maybe if I go to the restaurant, I will have a different experience, but as of now, I will not order from this restaurant again. Sorry for the negative review. I wish I could get my 30 dollars back."
        }
    ],
    "reviews_count": 69
}