{
    "name": "Hometown - Industry City",
    "place_id": "ChIJYfHLIxFbwokRtnz48KyOzEA",
    "grid": "BK7",
    "address": "87 35th St, Brooklyn, NY 11232, USA",
    "rating": 4,
    "user_ratings_total": 367,
    "phone_number": "(718) 576-3556",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sVmREbG5TSEJLYURKbmMxZHJPVUZQZG5scmVHYxAB",
            "text": "Food was definitely not worth the price. Brisket was dry and flavorless. The chicken was cooked well but… very flavorless.."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poNWEwRXllRFp1VkROcVNucHlMWGt6VVhZMk1uYxAB",
            "text": "I tried this place around the time it opened and though it was great. This time around I was so disappointed. Brisket was dry and too greasy at the same time, coleslaw was just too much mayo and corn bread was too dry crumbling off before I can put it into ny mouth. Many tables were left filthy.  I ended up having stomach pain."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWWlVGazRWMU5wWTFwMFFYa3dZVU5VV1VWQlNrRRAB",
            "text": "Best BBQ is the city."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kWWFIUkZRbkEzYkdjeGFrMXZka1J1VW5VMlpsRRAB",
            "text": "Brooklyn’s go-to for smoky brisket and ribs."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205dGRYaHhXVnB6VWtoRVpYRkxkekoxVG1NNU5uYxAB",
            "text": "Checked out Hometown BBQ in Industry City. I got the brisket, cornbread, and mac & cheese. The brisket was tasty but a little on the dry side (like some other reviews have mentioned). The cornbread was solid and the mac & cheese was nice and creamy. Service was super friendly, which definitely made the visit better, but the brisket was disappointing..."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsd1pqQlJlak5LZVVKclJtZGpNV1pqU0ZVeGQxRRAB",
            "text": "My first time in this restaurant and I think the food is good, the environment was great and the service was very fast I consider coming back."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25NemVVbExPSFpzVVZSWk1FbFBXRkZ6U25CTVptYxAB",
            "text": "Very disappointing culinary experience. I was really looking forward to this meal, but it was extremely underwhelming. The brisket sandwich was incredibly dry, the only flavor I could pick up was black pepper, with almost no smoke. The pulled pork was also dry and over flavored with vinegar. Worst of all was the mac and cheese. The noodles were undercooked, and the “cheese” tasted like it came from a grocery store powder packet. Unfortunately, nothing lived up to the hype or the price of $72 for three items and two iced teas 👎🏽"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT200elYzRklWSFJRWVVOQmVFTnJUbFZxTldsUVdtYxAB",
            "text": "Hometown catered our wedding. They did an awesome job and were super professional. In particular, they were very on top of working with the venue staff to make setup and breakdown happen. We were in constant communication with Mel before the event who did a great job answering all of our questions.\n\nLove the food as well. The pulled pork is real good and the cornbread with honey butter is killer. The baked beans side is really good too!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pobFQyVkxjSHBzYm5wWU1sbDVaRlJWTUUxd2FIYxAB",
            "text": "Delicious food, very nice service, the wait time was good. The food was served right to us, and when I tasted the cornbread, it was DIVINE. The salt balanced the flavors out, so the cauliflower wings are sweet but spicy. I was sweating😂 but definitely recommended. The chicken sandwich was good. The sauce put it all together. It was a little expensive though but the food is good."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ScGEwVTFkRGhmTUc1MVlXWTNUVlpzY1V0aVUxRRAB",
            "text": "Waited over 45 min for an order of just a brisket sandwich at a not very crowded time. Was offered a refund “but wait until after the food comes out”. I thought that was a strange request but overall a nice gesture so did not question. When the sandwich eventually came out the cashier said “actually your order is now marked as green in the system because you got the food so I can’t refund it”."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VPLTRtcy16M05HVmR3EAE",
            "text": "Horrible food and not fresh"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oeFZuUkZSMFZKZEVWelpYQm9RVmd4ZFVKMloyYxAB",
            "text": "We walked in and ordered 35 minutes ago.\nStill waiting for two sandwiches.\nThey allegedly close in 10 minutes.\nWe were charged for our order instantly.\nCharlie Foxtrot."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3NE9YSTVSME52VlZoT2FIcENkRFpRZFRoSWJFRRAB",
            "text": "The BBQ powerhouse of Red Hook but ✨without the lines✨ and a cute bar across the courtyard? Yes please.\n\nHometown has been a mainstay for years and there is a good reason for it. Delicious, hearty, value for the amount of delicious Smokey meats that you’re served. Definitely worth stopping by here on your way to Sunshine Market, Sahadis, or the designer discount stores.\n\nI look forward to going back! Great service, turn around, friendly staff, and perfect for a party gathering."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4WVYyOW5UbVZQYW5kUlgwZFpjekJpYlc0M2RrRRAB",
            "text": "Brisket was dry and tough but had decent flavor. Pulled pork was definitely a win, moist tender and well seasoned. Mac was creamy but flavorless. You have to purchase everything separately which is weird. I’ve never been to a BBQ place that doesn’t include pickles or cornbread but hey 🤷‍♀️ potato salad is just a tangy mashed potatoes. The sandwiches are probably better but I wont be back to find out. Atmosphere was pretty dead for a Friday night. Minimal interaction from staff, not the place to expect friendly engaging service."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwVlNEaEVOSEJRT0dKNlMyOXdlbTV4ZWs4MFYwRRAB",
            "text": "I usually visited their flagship in Red Hook and decided to try this location out. Meat was perfectly smoked and tender, but holy cow the brisket was SUPER salty. Lay off the finishing salt or do so with a less heavy hand. Place can also do with a few more indoor seats especially on rainy days."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tjNVowSm1RVlpSZFdoMGRHMWFaVXRKVTE4dFMzYxAB",
            "text": "Catered for a corporate event, nothing special and no real vegetarian option"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VNdjRvdXJEazdTSG93RRAB",
            "text": "Excellent beef ribs, if extremely expensive. I’d comment on the rest of their offerings, but they were out of everything at 5pm. Kids hotdog was $13 and wasn’t anything special."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VMR0pzUC0yb0lhZXNnRRAB",
            "text": "For $125 we got 6 ribs, small potato salad, small Mac & cheese and corn bread. The ribs had absolutely no meat on them, Mac & cheese had a hair in it! Horrible!! We had to throw it out and spend more money on a decent meal- absolutely ridiculous."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ1E3ODNpX3ViVy1RRRAB",
            "text": "Awful experiences seem to abound on Memorial Day 2025. The trouble started at the cash register w an employee who had no answers. Sides were fast, but the entrees took one hour plus. And, like others here, ice cold. Colossal disappointment. No manager in site to talk to."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VPSzY2WW1XeDRTYnJRRRAB",
            "text": "Arrived over an hour before closing time (5:45 pm, close at 7 pm) only to be informed the were out of all the meats- brisket, turkey, pulled pork, ribs, even the bacon slab on the Sunday of Memorial Day weekend, when they obviously should anticipate it would be busy, which it was.  I could understand running out of one thing, but all meats?  Crazy, and this is the second time in a row this has happened.  Icing on the cake:  waited 10 minutes in line to be informed of this - no sign, no announcement.   I've enjoyed their barbecue in the past - they know what they're doing on that side - but the management of this location is terrible"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VPRzgtNFRYNGZxX1p3EAE",
            "text": "We have been going to the Red Hook outpost for years, so are especially disappointed with out Industry City experience. The restaurant was relatively empty, about quarter full. The sides came quickly, but were long gone by the time the rest of our meal (1 sandwich and 1 order of ribs) came: 50 minutes after we ordered it. Both cold when they got to us. The staff seemed disinterested in helping, when we asked questions about the food while ordering the person at the register just said they don't make the food. Even a glass with ice for our drinks proved a challenge. Really a bummer."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VPZkdfX3ppNk9TbXl3RRAB",
            "text": "This place is poorly run. It took an extremely long time to get my food. The brisket sandwich did not come out with the sides, it was a 10 minute time difference so they couldn’t be eaten together. The staff seem generally confused and unenthusiastic.\nAs far as the BBQ: 7/10.\nThis place could use a systems overhaul."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VKLVRrNFBEcE1TYndRRRAB",
            "text": "They expect you to tip right after you order but won't clean for you won't even look at you in the eye...\n\nI wanted to eat there but needed the rest room first so i asked them where the restroom the cashier said \"you can take the menu I don't care\" like what does that suppose to mean. The food is great though 😋 service could of been better,  price is decent"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJckpoT3o4NFlIMkdBEAE",
            "text": "Fair pricing, food is not bad. Cool spot."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJeTB6dEsxM09YTV9nRRAB",
            "text": "The corn bread with flaky seasalt, oaxacan chicken, and korean sticky ribs was amazing."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VMZV9pNi04aTlHNUJnEAE",
            "text": "My 2nd bad experience here in a row…guy just barged through me and my table, barely got an apology. Last time I waited forever on the food and server told me it wasn’t his problem. Shan’t be back."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJdThYWE9BEAE",
            "text": "Perfect food, poor service. Cashier very rude"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJdU42N25nRRAB",
            "text": "Food was great. Got the brisket sandwich. Very moist brisket. Terrible service! Lady behind the counter decided not to give me any attention for 20 mins as I was picking up my online order. She rather be on her phone and turn her back to me. She saw me standing at the pick up counter with my kid and still decide not to attend to me. I had to ask the gentleman for my order which was ready and sitting there."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3eE9XM3RnRRAB",
            "text": "They serve cold brisket, second time now, never again.\nHorrible & over rated."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURROGZMM2VnEAE",
            "text": "Brisket was dry and chewy. Spare ribs were great."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRMkxIaTdRRRAB",
            "text": "My wife and I stopped in for lunch. I ordered the pulled pork, she the ribs.\n\nMy pulled pork was nauseatingly greasy, and after waiting for half an hour, her ribs never came.\n\nWhen I went to the counter to get a refund, the guy said \"I can get them for you right now!\" Maybe he should have done that earlier.\n\nMuch better BBQ options in BK and the city."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnOE5ldGFBEAE",
            "text": "The word Mid came to mind a lot.\nMy wife and I had a very hard time trying to find the entrance to this place and ended up walking around the building 2 or 3 times. The doors were also very hard to pull open, which led me to think it was closed.\nThe prices are NY fair.\nThe ordering process is a bit strange, and you really have to project your voice to be heard.\nThe food was nothing special. I ordered the Brisket, It was a tad bit fatty, and my wife ordered the Korean Ribs, which had waaaay too much sauce on them, I literally had a full bite that was nothing but sauce.\nWe were there on a whim and didn't research places to eat too well. This was, however, a miss for us."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnMjV2cXNRRRAB",
            "text": "Mac and cheese was great! Brisket sandwich was also quite delectable. I ordered the chicken sandwich for myself and it was horrid. It came practically dripping in grease still and the chicken itself was immensely bland. It tasted more of old, used grease than a crispy chicken sandwich.\n\nAs far as service goes, my cousin ordered, and not even a minute later I ordered myself. They got their food in about 5 minutes while mine took far over 20. There should be no reason for this lack of consistency, because there was only 1 other table while I was there, and they’d already received their full meals.\n\nNeedless to say I will not be returning to this location."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBc1ltRnZBRRAB",
            "text": "If you're looking for the \"best\" barbecue in NYC, don't expect much here. I'm not entirely sure why this place is hyped up so much. Perhaps the Red Hook location is better?\n\nWe arrived just after noon on a Saturday and was served relatively quickly. You can tell the quality of the meat is good, but there's absolutely no smoke flavor in any of the meats, let alone any decent seasoning. The ribs were the biggest culprit. Not a lick of smoke, and the fat was improperly rendered. It was also apparent that it was reheated on a grill. Who knows how it was \"smoked,\" but I hesitate to say it was smoked at all. The pastrami sandwich was decent, but for $28 you might as well go to Katz's. I've eaten at many of the top barbecue restaurants in the country, and the meats here were so lacking.\n\nThe two sauces were nice. The sweet one was fairly standard, and the other spicy sauce was quite good. I wouldn't mind having that at home. I didn't order the sides, but they looked promising, but good barbecue is made on meats, not sides.\n\nIf you want good barbecue, go elsewhere. Maybe for NYC this is good enough, but this would be bang average at best anywhere else in the country."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfZ1llaW13RRAB",
            "text": "One of my favorite places I come across at IC the food is great, the music is great and the service and staff are all very genuine and helpful, I got a brisket sandwich and it was amazingz and definitely queer friendly."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmLXRMYnpBRRAB",
            "text": "Brisket was really not great. More fat than meat..."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmdTV2Q0pREAE",
            "text": "Great food and ambience. There is outside and indoor dine in.\nOne thing i wish them to add sugar free soda."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmN00tSUxREAE",
            "text": "Doors locked even though they are supposed to be open. 6:25 pm on a Thursday night."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2ZzdUTUR3EAE",
            "text": "Wasn't my favorite.  Heard so much about both of there locations and will try the red hook spot and hopefully give a better review"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQeDZ5NEFnEAE",
            "text": "Ice cold flavorless brisket sandwich and valveta Mac and cheese waste of money"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzeDREQjZnRRAB",
            "text": "Compared to the Red Hook version, this location does not have the crazy wait and 100 people in a line for food like it's the 1920s recession. The food is exactly the same delicious everything and the service is much faster plus the seating and atmosphere is a bigger improvement with less pit smoke.  Beef rib is the bestest 😋."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYX2YtaU1nEAE",
            "text": "A1 service, clean place, prices affordable,  and the food was great. I definitely recommend,  will return in the future"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYekpDODVnRRAB",
            "text": "Review of Hometown BBQ\n\nHometown BBQ is, without a doubt, the best BBQ spot in New York City. Having tried other well-known places like Dallas BBQ and Dinosaur BBQ, I can confidently say that Hometown BBQ stands head and shoulders above the rest. The flavors here are deep, smoky, and rich, a testament to the care and expertise the chefs put into every dish.\n\nOne of the standout items on the menu is the Korean ribs. These ribs are incredibly tender and packed with a perfect blend of sweet, savory, and smoky flavors. They are a must-try and will leave you wanting more.\n\nAnother unique aspect of Hometown BBQ is its Friday night experience. After a great meal, you can stay and enjoy some lively salsa music and dancing, adding an extra layer of fun to the already fantastic dining experience.\n\nBut back to the food—every dish I tried was phenomenal. Whether it's the perfectly smoked meats or the thoughtfully crafted sides, it's clear that Hometown BBQ puts a lot of work and passion into their menu. If you're in NYC and looking for an unforgettable BBQ experience, this is the place to go!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURudmRHdXBRRRAB",
            "text": "I remember when Daisy May’s was the only Texas BBQ in the 5 Boroughs (that’s an OG flex). Look how far NYC has come since then.\n\nIs HT the best BBQ in the NYC? I’ve had some of Austin’s finest, and this spot is in their league. They wouldn’t win in Texas, but they can hang. There was a time when Fette Sau was my only love. Those days are long gone. Home Town is a destination & I’d take two trains and a bus to get here for this Q."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURudHRuc0x3EAE",
            "text": "I like that the breast was crispy and yet soft. The brisket and rib meats was tender, but the flavor was ehh alright. It filled the stomach rumbling. Overall good, but I wouldn’t write to my mom about it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNucDZxNDVnRRAB",
            "text": "Good is great. I really wish they were cutting meat behind the counter instead of in a closed kitchen.\nIt wasn't busy, but still felt like a long time to get my sandwich. Finished 2 beers before it came out"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuN1lycHlRRRAB",
            "text": "Had the best experience here real low-key 😁"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiaWZEVGFnEAE",
            "text": "Top tier bbq in Brooklyn.  Lots of food choices in the area but this place will keep you coming back for more! Perfectly cooked brisket sandwich just explodes with flavor"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiOHI3QlB3EAE",
            "text": "Big serving amount compared to the price."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiMXFTelZBEAE",
            "text": "Food was great. Really hit the spot after some drinks."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEdC15U3pRRRAB",
            "text": "The best barbecue to be found. Hands down the best. The brisket is just marbled to deliciousness, the spare ribs have a rich flavour and the honey cornbread is like nothing I’ve had before. The Korean Stick Ribs were excellent as we. As platters of food go, hometown is where it’s at. Notable mention to the Fried Chicken Sandwich, Cauliflower Wings and Jerk Tips. You just can’t go wrong with any of the options."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMMWZEbjJRRRAB",
            "text": "Absolutely incredible! The best BBQ I’ve found in NYC! The brisket is a must! Tender, well seasoned, and overall just melt in your mouth deliciousness. The macaroni and cheese was obviously tasty and the rib tips were my boyfriend’s absolute favorite! You truly can’t go wrong with anything on the menu. The location itself is casual, cool, and tucked away from some of the more lively parts of Industry City so it’s perfect for a quality meal. The service is prompt and the staff is welcoming. Couldn’t ask for anything better."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMaDhXb3RnRRAB",
            "text": "We stopped by Hometown before an event and I completely enjoyed trying the :\n- Jerk Rib Tips\n- Brisket Queso (w Tortilla Chips)\n.\nI didn’t expect to like this spot as much as I did. I even went back for their Korean sticky ribs (not pictured) after the event.\n.\nThe summer beer on tap was delicious (I forgot the name) and there is plenty of lovely outdoor and indoor seating.\n.\nThey do run out of food by the early evening but they have lots of ribs by closing\n.\nSuper friendly staff and helpful with bringing food to the table and suggesting what sides go with the meats\n.\nI love getting recommendations and fully loving the food!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6cGRTaHFBRRAB",
            "text": "ABSOLUTELY ONE OF MY FAVORITE BBQ SPOTS IN NYC! It’s so DELICIOUS every time I’ve been here. I tried the pulled pork sandwich last time, which was a delight, and upon my second visit I had the brisket sandwich. All I have to say is GET THAT SANDWICH 😍😍😍😍 The corn bread is such a delight as well, so buttery and perfectly made. I’ve tried A LOT of not so good BBQ spots in my years of living here, but I know I will continue to come back to Hometown! SHE IS THAT GIRL! 😂❤️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6dXRTS2tRRRAB",
            "text": "HTC burger was to die for and was so worth it. The sides are great. Hometown is always a hit, and love that the industry city location is actually more accessible than the Red Hook location which is always crowded. Try everything here, especially the bacon. And the staff was so sweet. Can’t wait to be back."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPeGFlTjFnRRAB",
            "text": "Got the brisket sandwich, very spicy but the meat was very moist. Service was slow.\nEdit - Have been back three more times and I have to say that the food is great, tried the ribs, the brisket, the Vietnamese wings, beef rib and at this point cannot tell which one is my favorite. This place is a must if you like barbecue"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5OElIdnVRRRAB",
            "text": "This location is nicely tucked away from the livelier areas at Industry City and is a great spot for a quick quality meal. It’s not a big location like the Red Hook flagship location and honestly feels more like a pop up. But solid brisket sandwich here if you want to devour a sandwich in peace while the kids are running around outside in the play areas of Industry City! 👍🏼😀"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaeFpHdzZ3RRAB",
            "text": "Great potential. Needs a little work. Friday night, one person taking and serving orders  needed help. Korean ribs were awesome. Jerk rib tips were good. Cheese fries were meh. Fries were good. Cheese sauce had no flavor and was drowning my fries. Would go back Tobey other menu items."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCazZLRmJnEAE",
            "text": "I went here for a team lunch. It was about 15 people and Hometown was very accommodating. Their food is great if you like barbecue. I personally got the chicken tacos and it was good. Also love their 2 sauces - sticky and hot&sweet. Their Mac and cheese and corn bread is a must!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwN19LS1JBEAE",
            "text": "The best brisket in NYC. So tender and juicy (even the elan part). The portion was huge, much more than what I expected. Had their weekend-only pastrami sandwich before. It was also delicious . The mustard spread was a bit too salty though, but the meat part was 9/10!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtb2JXOVB3EAE",
            "text": "I finally managed to introduce my friend to Hometown BBQ after talking about it for the last couple of months. I've visited both the Red Hook and Industry City location over the last couple of years, but have found it's easier to get a table at the Industry City location. The BBQ is spot on and my favorite place for BBQ in the city. My friend, who grew up in the South, and has tried BBQ in nearly every Southern state even approved and said we should visit again. I've also had the Vietnamese Hot Wings and the Korean Baby Backs, which are amazing!! The pastrami sandwich ($28) is delicious. The Mac and Cheese ($6) has a nice kick to it. I enjoy going to the actual restaurant location, but would order from here more often if they had an evening delivery option."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5bGNIRUlnEAE",
            "text": "Finally finally finally I got their #1 rated always sold out pastrami... and it 100% lives up to the rating, BUT the bread kept it from getting 5 stars🌟 as looked and felt like grilled cheese  bread.  The bread wasn't bad... if just does…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxcHNiQWhBRRAB",
            "text": "The brisket. I dream about the brisket. The brisket is my friend, my enemy, my everything.\n\nThey have other dishes, don't get me wrong. But THE BRISKET.\n\nNow for the fine print:\nThis is the smaller location. But don't fret - it has the same amazing brisket, with half the line. Yep, you heard me, half the line. They also have less food options here (no beef rib or jerk ribs), but the our friend the brisket is here.\n\nDebating between Korean Sticky Ribs and the \"regular\" spare ribs? I prefer the \"regular\" ones. They slid right off.\n\nI'll go to bed dreaming about this brisket again, like every night."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqcnNMZnZBRRAB",
            "text": "Forget KC, forget Texas… this pulled pork bbq sandwich is the best! Nice slaw in it with details. 😋😋😋 FYI- one  sandwich and one can of beer, $29.63  NYC pricing 🫤"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqeUw2VVZ3EAE",
            "text": "I had done a bit of research before visiting NYC and knew we had to have a meal here. It did not disappoint. We shared the Hot Cauliflower which may have been the best dish. I had the Jerk Rib Tips which were a very close second, but be warned they are spicy! My friend had the pulled pork sandwich which she said was delicious! If you’re in Brooklyn don’t miss this spot!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxbk1xMGFREAE",
            "text": "Great outpost in Industry City from the Redhook location. Can get busy quickly and they can run out of meat so come early!\n\nThis time got 1/2 lb of brisket. Great bark with finishing flakly salt. Always get the cornbread (drizzled in honey) and creamy Mac and cheese."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6a18tYVFREAE",
            "text": "Sandwich and fries alone was $24 before taxes and tip. Sandwich was huge and comes with alot of flavor! 10/10 would get again, couldn’t even finish it all so take the other half home. Fries were crispy and came with a lot of flavor!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoZzQtSTRBRRAB",
            "text": "The Mac and cheese was good but the actual BBQ was alright. They don't have a variety of sauces and it is bit expensive for the portion you get. However the workers were very kind and let us order a few minutes before closing."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSeU1peklBEAE",
            "text": "We order beef rib, brisket and pastrami bacon. And Mac and cheese side. The meat was really tender and juicy. The only con is the temperature of the meat  , a bit cold. The service was friendly and the ambient is ok."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1Z2V6SFhREAE",
            "text": "Delicious brisket sandwich and Texas pinto beans served by super friendly staff! Sandwich,  small side, and a Mexicoke will set you back about $35. But you won't be disappointed."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNab2JqTlRREAE",
            "text": "Bbq place inside industry city. Pretty pricey but decent bbq.\n\nBrisket ⭐️⭐️⭐️: the fatty parts were good but the lean parts were dry and chewy.\nBeef rib ⭐️⭐️⭐️⭐️: the best thing that we got. Was pretty juicy and had a nice crust and wasn't dry. Very steep price at 55 dollars though.\nPastrami bacon ⭐️⭐️⭐️⭐️: kinda just tasted like bbq pork belly to me. Didn't really \"get\" what it was."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0NE5UVVNBEAE",
            "text": "Better Pastrami then the current Katz.\nThe pastami was amazing. The beef short rib was heavenly. It was actually better Then the few times I've been to at Redhook hometown. Really enjoyed our meal. Staff was very nice. Thank you"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqNk11ZVNREAE",
            "text": "I am so in love with this place! Everything is good with no comments. Highly recommended to visit if you like a BBQ."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGc3JlcTRnRRAB",
            "text": "Authentic smoked meat. Less crowded than the other Brooklyn location.  Food is pricey but it's expected as food is rich and quality. You can find street parking or underneath the bar, both metered"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMdEwtMXNRRRAB",
            "text": "Thank god u found a barbecue spot in this area.  Haven’t had in like 8 months. Food was good, people were cool. What more can u ask for"
        }
    ],
    "reviews_count": 75
}