{
    "name": "Eat Street NYC",
    "place_id": "ChIJLRvGUKxbwokRlK4-UxSWkQ0",
    "grid": "BK7",
    "address": "887 5th Ave, Brooklyn, NY 11232, USA",
    "rating": 4.8,
    "user_ratings_total": 93,
    "phone_number": "(347) 457-6175",
    "reviews": [
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201YVYycEtka293WkVFMU5FSTFWRlozUjFKUldsRRAB",
            "text": "Pulled pork was good."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21acGVUSmFPRUl6WTFSaFVGTkRVVlYyVTB0RWNrRRAB",
            "text": "The food was excellent, the staff are nice and they gave me a free yogurt too! Deserve their high rating"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjNE5XMDJOM1ZwTUZkdFZVRnJSSEJTUWpKdGNWRRAB",
            "text": "The cookies are amazing!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSNmRtVmliRVZ2V1RGWWNWaHBXR0ZOUmpkNVdXYxAB",
            "text": "Amazing sandwiches! The cookies are to die for!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taRGJXNU5SV0ZyWjNocVdIWnlObVJ2YTFoUGJtYxAB",
            "text": "I had arrived in NYC in the wee early morning hours.  I slept in my car until shops opened up as my hotel wouldn't be ready until later that afternoon.   I had never been here before and got a delicious sandwich the cashier recommended.  I definitely would say for locals to stop by ^^"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJM0JwdnE4bTkyLTRnRRAB",
            "text": "Had a birthday party catered and the food was immaculate, fresh and full of flavor. Dima is a godsend to the catering business and is a must for every event"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZdXAtc0tnEAE",
            "text": "We were in town and we decided to check out Eat Street NYC. BOY I'm glad we did, Joe made us feel right at home. Lots of delicious food to choose from & the portion sizes were huge! Thanks for your kindness, your time and the sweet treats Joe! This is one of Brooklyn's best kept secrets!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJdDhIOUxREAE",
            "text": "Nothing like the comfort food from eat street, doesnt matter what you get its all good!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJMTUtMVFREAE",
            "text": "Zack is a sweetheart. Perfect bagel, perfect schmear, extra cookie. Great way to start my morning ❤️"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJaW9IcTJRRRAB",
            "text": "The best sandwiches and cookies"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJb3BlWnl3RRAB",
            "text": "They are very welcoming and the food is delicious!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3aWYyR2lnRRAB",
            "text": "please add more vegan friendly options:("
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3elpQUzdnRRAB",
            "text": "Just got to say a little pricey for 5th Ave Brooklyn.. but make no mistake about it the food is amazing 💯🔥"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRbzhYMjB3RRAB",
            "text": "On quality of food alone this is one of the best spots in the city. Papi Burrito is a top Brooklyn breakfast burrito! The pulled pork morning hash is also insane (pictured). On top of the food, the prices are very reasonable for the portions; $15 for all the food in the picture. They're also so nice every time!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRbUlMVk9nEAE",
            "text": "The chicken little sandwich was great!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnX2Y2UDRnRRAB",
            "text": "The best steak and eggs I had in a while!! Awesome price as well, will be coming back!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURnMUt1RDNRRRAB",
            "text": "Amazing food!! Have gotten catering from there numerous times and the service is impeccable. The penne la vodka and chicken sandwiches are my favorite 5/5"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnOTVtNVpnEAE",
            "text": "Amazing food always ready quickly. Love the smash burger, sandwiches both lunch and breakfast (thick cut bacon egg n cheese is delicious), and can’t forget the cookies. Favorite place in sunset."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnaTRTN2xBRRAB",
            "text": "Great sandwiches, and sent a small treat with the order!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2azhUb3FRRRAB",
            "text": "This place is a gem.  I was in Brooklyn visiting family and wanted a quick bite.   Best decision I made. I got the chopped cheese empanada.  It was soooo good.   Guy in the window dapped me up and hooked me up. Will def try again!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2Nl91UjlnRRAB",
            "text": "This is a long overdue review for one of our new favorite places. My wife and I had four excellent experiences.\n\nThe staff is friendly, helpful, and humorous.\n\n- First experience: \"ESNYC Papi\" sandwich. Delicious.\n- Second experience: We chose them to cater for our baby shower. They delivered the food early, which was great. Everyone loved the \"Chicken Little Sandwich\", \"All Action Sandwich\", and \"Eat Street BLT Sandwich\". They were really good sandwiches.\n- Third experience: \"Presidente\" regular size was also delicious.\n- Fourth experience: \"Papi Burrito\" and \"Chicken Little Sandwich\" were so good.\n- Sweet potato fries and cookies are consistent and delicious.\n\nAfter trying out so many sandwiches, you can't go wrong with any of them. We anticipate to continue coming out here to eat more of their sandwiches. Have not been disappointed at all."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzMmRiZDF3RRAB",
            "text": "You can’t go wrong with anything on the menu. I’ve had the salads, the sandwiches, the wraps and they’re all always consistently delicious across the board. Everything is always so flavorful and absolutely stuffed. You won’t go hungry here!\n\nAlso, don’t sleep on the cookies!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzdjRyZ21nRRAB",
            "text": "Love it. I recommend you stop by and have a “Papi Sandwich” or “Bacon Melt” with thick cut bacon, No one is doing that in the neighborhood. Must try!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzNDh2QllnEAE",
            "text": "Eat Street NYC is an absolute gem in Brooklyn! The food is fresh, flavorful, and reflects the best of NYC’s food scene. But honestly, what makes this place stand out is the owner. He’s truly a champ and embodies what it means to serve with heart. You can tell he genuinely cares about every customer’s experience and goes above and beyond to make sure everyone feels welcome. If you’re looking for fantastic food with equally fantastic service, Eat Street NYC is the spot. Highly recommend!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzNC1DWTJBRRAB",
            "text": "Incredible food, lovely people. I ordered the All Action, No Bronson with prosciutto, burrata, and I believe some fig jam and more. It was absolutely delicious! They also threw in a cookie (and I believe the 2nd half of the sandwich??) for free, which one never should expect and was such a delightful surprise. The staff were very kind and refilled my reusable water bottle when I asked. Overall 10/10, will definitely come back"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzLW91b1dREAE",
            "text": "Every time I get a sandwich here, I'm so happy. All the parts of the sandwich are so delicious-- seasoned and fresh, including the bread. Also the people who work there are super nice and friendly and I enjoy going to pick up my order because they brighten my day. We're lucky to have them in the neighborhood!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYaVl6dGhRRRAB",
            "text": "This was the first time my hubby and I ordered breakfast from here through seamless. It was just one of those days you just don’t want to make anything and let me tell you… I’ve never been more impressed and happy with that choice. This is Deli food elevated! The portion is incredible and worth every cent you spend here. First of all, this is the first time I see pictures that actually match in real life. Love the creativity of the names(kind of why I order the Papi) but the name matches the oh so goodness of these sandwiches. They came hot and free of spills and they even through in 2 cookies for free which were soft! Also, usually when a restaurant doesn’t use seamless delivery personnel you can’t track them but they are genius! They sent a link so I am able to track how far. I know this review was long but it was just amazing! Such BIG, yummy sandwiches! I look forward to making me this our spot♥️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYakpfOG1RRRAB",
            "text": "Best catering team on the planet . Use them for business luncheons for my clients , and it couldn’t have been a better choice . First and foremost , everything delivered promptly , never any order shortages or missing requests . The food ? No need to ask . Finger licking good and this directly from several and random sources . Will continue to use them !"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYZ01TTmNBEAE",
            "text": "Amazing Pancakes!\n\nHad the best pancakes at Eat Street NYC! They were perfectly fluffy, delicious, and served with great attention to detail. The owner super friendly! Definitely a must-try for breakfast lovers!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYZ0pqeFVREAE",
            "text": "What are the best breakfast sandwiches I’ve had in a long time."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNueDh2ekRREAE",
            "text": "I work a few doors down from eat street and this is the go to breakfast and lunch spot for the whole team. Dave and Zach are great and the food is always delicious!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNueDVQSG93RRAB",
            "text": "This is THE BEST lunch near me !"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuLWVhZTV3RRAB",
            "text": "Perfect \"on the go\" food. Despite getting the empanada and fries it wasn't a greasy mess."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNud0pfMnRnRRAB",
            "text": "The food is delicious - 10/10 . We’re definitely coming back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3N3BuVUJBEAE",
            "text": "Their food is top-notch, the entire menu is can’t miss. You try one sandwich and you just want to know about the next one. It’s great to have them here in the neighborhood. Best sandwiches in Sunset Park!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3cnFTd1dBEAE",
            "text": "This place deserves to be placed in the pantheon of NYC sandwich shops. The breadth and depth — and the bread — of Eat Street’s menu is as amazing as the detail that goes into what they do. Like a great album, Eat Street is all hits, no filler. Literally."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwLTdqNE1REAE",
            "text": "These guys are not just serving great food, they're here to serve the community. Zack and David know how to connect to all their customers and make them feel like family. You will always crave their sandwiches and be interested to try the new thing on their menu. Can't wait to order from them again and highly recommend their breakfast options!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3em82SzV3RRAB",
            "text": "I adore this place. The owners are extremely welcoming and will ask about your life and family; truly representing the aspect of community. Th chopped cheese empanadas, chicken bruschetta, and eggplant parm anre my go to meals.  The chocolate chip cookies are my daughter’s favorite weekly treat."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3anIyTk5REAE",
            "text": "Wonderful food. I wish I recreate the first moment I had their Sweet Honey Sopp and Smash burgers. This place is a historical landmark in the making 🔥…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3anA2ejVRRRAB",
            "text": "Eat street is the best breakfast/ lunch you can get in sunset park hands down 💯💯💯💯💯💯…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREbnNMT25nRRAB",
            "text": "Finally, a place where you can just pick from a menu without thinking of “which dish is good here or if you’d get end of day leftovers”. Mind that it’s a “hole in a wall” style place, no inside/outdoor sitting, perfect for takeout or a single sandwich in hand.\n\nI ordered some random things: chix soup, BBQ pork sandwich, prosciutto/cheese in croissant and jerk chix empanadas.\n\nSoup was just great, no starch in the container which is strange but fine by me. I raise my own meat poultry, egg chickens and make bone broth. The broth was solid, plenty of meat.\n\nBBQ pork sandwich was of a splendid taste, perfect I would say. OK size, well put, good add-ons. Not vinegary, pork is tender, moist and has some crunch (not the dehydrated heat lamp crunch but light crunch. Chips).\n\nEmpanadas (jerk chicken) tasted great: thin skinned with a side of green sauce. Update: avocado cream. A tad cold on the inside though, probably a one time thing. Update: second time they were nice and toasty.\n\nUpdate: croissant sandwich was great too.\n\nService was friendly and prompt (it was not a rush hour but still).\n\nWill be back when in town. Not enough time on this trip to run thru the whole menu. One other note, as a hotel traveler: food was well packaged, which is important."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREc3RhVzhRRRAB",
            "text": "Beware of ordering from EatStreet. DO NOT tell people there is NO SERVICE FEE then up-charge items 25% online. Very deceiving and a huge money grab. It's not hard to be transparent. Lying about your charges/services is a slap in the face to the consumer. I understand the convenience if ordering delivery but 25% is greedy.\n\nToms River, NJ"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNENllYbUp3EAE",
            "text": "This may be the best Bacon Egg and Cheese in the city. Next level. Croissants were top notch too."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEeUo3aUxREAE",
            "text": "Ohmygod! First of all, the nicest guys in sandwich game! Unfortunately, I didn’t catch the name of the guy helping me, but what a class act. Unsolicited, he brought my food out to my car in the pouring rain! AND there was a free Boston crème donut in the bag! What?! Who does that? And then, I tried my “All Actions” sandwich, plussed up with grilled chicken… and I must say, unusually delicious—from the freshness of the ingredients, the optimal proportions and construction, and the exemplary pesto . You see, I am someone who takes sandwiches extremely seriously, and clearly Eat Street does too! Now, I would never come to expect this kind of treatment in general, but this experience clearly indicates how they feel about their customers and their product. I am forced to recommend this fine purveyor of sexy sandwiches to damn near anyone who will listen to me as I scream it from the Brooklyn rooftops"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5ejlfSURBEAE",
            "text": "Delicious food!! Great service! One of the best places in Brooklyn for a sandwich or fries!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5dFAzXzJRRRAB",
            "text": "The food is delicious! But most of all the service is exceptional. They took event measure to make a quick stop at the counter kind, generous, and friendly."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5bmZYdWZnEAE",
            "text": "So delicious and spicy"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0ME5QNWRREAE",
            "text": "Food always taste great. Never disappoints. I eat there about 1-2 a week because they are so good also the owners are very nice and their cookies are to die for."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROdU82TjZRRRAB",
            "text": "Wow 🤩 I ordered the Rosario special and the eat street bacon melt. It was so delicious 🤤 great prices, ingredients and service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOeXFPSmZnEAE",
            "text": "I usually order on Uber eats. Chicken Caesar wrap is amazing! Also love the apple turnovers. Really solid food and the people always leave nice notes on the bag"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxNkxqRHpBRRAB",
            "text": "Got the papi on a brioche bread and chicken little on a rustic bread. Loved the chorizo on the papi breakfast sandwich! The bread on the chicken little was so crispy one the outside and soft on the inside. We also got a chocolate chip cookie on the house, crunchy on the outside and soft on the inside (would recommend microwaving it for 15 seconds). Definitely worth coming here again and would recommend!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURabnBQWXh3RRAB",
            "text": "LEGIT! Nothing was mediocre about their food or service! We got the Papi sandwich on an everything bagel (eggs, chorizo, avocado, cheese amongst other ingredients) and a veggie cream cheese on a plain bagel.  I can be quite a food snob, so it is pretty tough to impress me. However, every ingredient in these sandwiches was of quality and you could tell they put heart into making everything!\n\nAbsolutely fresh and delicious bagels! The Papi sandwich was amazing. The vegetable cream cheese tasted homemade with super fresh ingredients. I don’t live in the neighborhood, but definitely see myself coming back here for more and more in the future!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURabnIzeFNBEAE",
            "text": "If I could give them 10 starts I would. The food was TO DIE FOR . I ate it so fast because it was so damn good and delivery was speedy. They even included a lovely note on my bag :)  will go sure be getting lunch later"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGLV95SmFnEAE",
            "text": "Great little breakfast/lunch space, the food is fresh and delicious! Service was great."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1MTdLcV9BRRAB",
            "text": "The 5 star rating for their food is real y’all. Their bagels are fresh and they PACK their fillings for their sandwiches. My favorite is their mami sandwich which is just eggs cheese peppers on their brioche bun. Their porky sandwich is also delicious and their bagels with cream cheese comes with a THICK generous slob of cream cheese. Their fresh juices are also great. Ordered from them 3 times in a week."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwczQzS01REAE",
            "text": "We stopped for lunch at Eat Street and I ordered the Turkey Swizz sandwich. OMG! I can't say enough great things about this place. The ordering was a synch. We received our food in about 5 minutes! The sandwich was fresh, tasty.  The Italian bread which my sandwich was on, was crunchy on the outside and soft on the inside. It had the perfect amount of turkey, cheese and avocado with very crunchy lettuce. The owner gave us bagels to try. I don't usually eat bagels, but I knew it was going to be great. And it was probably the best bagel I've ever had. I ate the entire bagel, before my sandwich.  Needless to say, we will be coming back to taste more of this culinary delight. Thank you Zach. Great place!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNabGFteTdnRRAB",
            "text": "Everything I have ordered here has been delicious! Very fresh, very tasty, and staffed by lovely, kind humans. I recommend the Hot Girl Summer salad with grilled chicken. It totally hit the spot on a warm day."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsLXJxc2NnEAE",
            "text": "We ordered catering to our office in Industry City. The food came on time, fresh still hot and they even set it up! Highly recommended, the people at eat street are extremely helpful and a pleasure to work with. The food was delicious."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwc19udzBnRRAB",
            "text": "Stopped by for a couple of sandwiches.  Turkey Swizz and Mama's Chicken Salad. So delicious, fresh, crunchy bread on the turkey and soft and buttery, yet crunchy croissant on the chicken salad. We will definitely be coming back. Thanks Zachary."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWcnU2eVdnEAE",
            "text": "Had a catering order I needed to fill fill last minute. I heard about Eats treats from a family recommendation and give them a call for the special event. I had this team catered the most fire sandwiches last minutes. Going to use them on a Christmas event now."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsX3Q3a0RREAE",
            "text": "I needed catering for my event of 40 coworkers and I contacted eat street NYC, Dave helped me setup a menu for my budget, the food came on time , the setup was perfect and the food was incredible. Will definitely use them again, now everyone at the office orders breakfast and lunch from them lol"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaaGJ2QTB3RRAB",
            "text": "Great food with delicious taste. It had all the right seasoning. The first bite I took had an abundance of flavor. Definitely will be coming back to try other items on the menu."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaNklmZFhnEAE",
            "text": "Reallly good sandwiches for a decent price. I love that the staff were friendly and my order was prepared quickly. I’d come back but would appreciate more vegan friendly options"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsMmEzUzlRRRAB",
            "text": "Great place. Order lunch for my office regularly the food is amazing.  Met the guys at the window while walking by, got lunch and now there's no going back! Definitely a welcome addition 😊"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWMF9LYjN3RRAB",
            "text": "Bomb place!!  Their bagels are quintessential perfect bagels.  Coffee and pastries knocked outta the park too.  Cudos to Zack, makes you feel like home!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNad29LaXZBRRAB",
            "text": "Eat Street is my new go-to breakfast spot! While there's no sit-down option (takeout only), the food is worth it. I recently tried their breakfast menu, and I'm hooked. I just wish they were open later."
        }
    ],
    "reviews_count": 66
}