{
    "name": "L’Wren",
    "place_id": "ChIJTzXw__1bwokRoqpZA9QFxGc",
    "grid": "BK7",
    "address": "4004 5th Ave, Brooklyn, NY 11232, USA",
    "rating": 4.7,
    "user_ratings_total": 254,
    "phone_number": "(917) 909-1894",
    "reviews": [
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5SU1VVlhlV0ZSTldRNFVuZDVWamxYVFV0R2VtYxAB",
            "text": "Good cocktails and good atmosphere. Bartender is knowledgeable and nice. Fun place - I want to come back for happy hour, which looks great"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKeU1tSkhhbEJoVXpad1YyRm5jVXcwTm5SMWMyYxAB",
            "text": "Everything was amazing. Hosted my 29th birthday party there. The staff was perfect. The owner Travis kept checking in and didn’t rush us out. Jessica made herself available for calls and emails period the day. They were communicative throughout the entire process of planning my party. The food was delicious and all my guests loved it. They made it fun, affordable, and easy to plan. I’m deff going to host more parties here and recommend this place to others. I also need to come back regularly."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSb2FtcFlRazlsUTFOak5WcHphVkJNY0VsMVZVRRAB",
            "text": "Cool vibes. They need to update their menu but overall chill spot."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKWFpEWTBYMjExUm1sUll6VnBabTk2YUZOS2NXYxAB",
            "text": "Great margaritas. My friend ordered a spicy one and I ordered mine dry. They are both perfect."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214clJrOXBTbFZrUmtoUFZtbGxXRVE0Wm5selkxRRAB",
            "text": "Only one bar attendant during rush hour ? I waited more than 20 min and still don’t have my drink. Worst bar experience ever !!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GMWRtdGZOVFJtWVhaUVkzSkZjMDB0T1daNVlYYxAB",
            "text": "Great place to eat and having fun!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJNVNUWTRXVFJpWW1ZdGJXOU5XVmw2ZVRsQ1FuYxAB",
            "text": "Happy hour is nice with food and drinks on the menu! The tater tots are a favorite; get those. Calamari was also good. They have a back room as well."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIdWJtREJnEAE",
            "text": "Hospitable staff and great appetizers"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZdk5XZ0hnEAE",
            "text": "Nice drink, fun group hangout environment"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJMHR6R1FBEAE",
            "text": "Nice joint in my 'hood, Sunset Park. Affordable, stellar customer service.   Didn't go to meet anyone so can't comment on the happy hour/late night scene. There is ample seating with a big lounge in the back."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJei1qQnV3RRAB",
            "text": "This place is so cute, great food and drinks and a lovely performance space! Kenny the bartender is the best ever and deserves a raise. Twice now I've seen him be the only bartender when its packed and he was sweet, patient, served everybody quickly, and was still so nice even when people were rude as hell! Kenny you rock!!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3MW83ZmV3EAE",
            "text": "L'Wren is an amazing place to go to grab some drinks and food with friends. It is also an amazing place to host events. I had the pleasure of planning a birthday party and was able to use the beautiful space in the back of L'Wren. Thank you Jessica and Travis for letting us use the space. And a special thank you and shout out to Ferg and Kenny for being the best bartenders and helping us with every little thing. We had such a great time!! Now I cannot wait to come back in May and celebrate my birthday!! Keep up the great work, definitely did not go unnoticed, you are all so awesome!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3eHEyMzJ3RRAB",
            "text": "Kenny is Amazing"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3eXVuRDJnRRAB",
            "text": "Such a great bar and happy hour ($8 cocktails and apps) the drinks were so good and there’s a very diverse cocktail menu, there’s something for everyone! The music was great, the bartender was very kind and the back room has a screen with movies going. I can’t wait to go back :)"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURROXN1azlBRRAB",
            "text": "Bartender was really nice, delicious cocktails and food was on point. This is a little gem EVERYONE should know about. Very intimate and great place 10/10"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2Ml95RzdBRRAB",
            "text": "I've tried several times to enjoy this neighborhood spot. The food and drinks menu are in need of a refresh, very basic.\n\nUnfortunately, more than once, the glasses continue to smell like garbage, then I noticed they stack the glassware (from a dishwasher) on top, literally on top of the trash can. So unsanitary, it made my stomach turn.\n\nLastly, all the prices on the website have been incorrect for over 3 years. The happy hour is not a good deal in any way. It's unfortunate that this place has gone downhill."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQcXJlZndBRRAB",
            "text": "Great drinks. Great atmosphere. Great bartenders"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzXzhUXzd3RRAB",
            "text": "Awesome atmosphere, great positive vibes.\nDrinks are made as your expectations + some great food!\nMust stop by!"
        },
        {
            "date": "1년 전",
            "language": "tr",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNueF9yb2t3RRAB",
            "text": "Guzel bir mekan begendim. Tavuk kanatlari gercekten cok guzeldi. Tam istedigin kivamda pismisti. Kokteyleler de lezzetti. Begendim mekani. Personel de gercekten ilgiliydi. Tekrar gelecegim"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiMzZlUGt3RRAB",
            "text": "4/5 In the clouds\n4/5 Sage Advice\n3/5 Moscow Mule"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiMUx6MHlRRRAB",
            "text": "Little gem local spot. The food is delicious and the ambiance is really nice . They did a nice job here."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNid3Vfdkh3EAE",
            "text": "Good drinks and food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyOXBxVXpnRRAB",
            "text": "Ok, so my wife and I were here two years ago. It was a very vibrant atmosphere.  We went on a date here today, yeah let's say I was not impressed. When we walked into the place, we hoped to be seated at a table. But the two bartenders were busy talking to themselves.  To me is seems that they didn't notice us until my wife asked if we should just sit ourselves, and the lady said, \" Yeah, just take any table.\nWhen it came to ordering food, the gentlemen told us to just come up to the bar and order food.  I was like ok, this is new. When the bartender tells you if you want water, just come up to the bar and help yourself.\nNow I haven't been to a bar that told me just to come up to the bar and get water yourself.  But this was a new experience. In my opinion, have a waitress to help seat and get your customers orders."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlNlpESTJBRRAB",
            "text": "Awesome drinks, delicious food and friendly staff"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMck5hanpBRRAB",
            "text": "Came here on a Wednesday night and my bartender was Telissa. Very nice girl. The bar was not that crowded. Ordered a spicy margarita and it came right in point. I couldn't help noticing the people next to me and it looked delicious. If I was hungry, I would definitely have ordered something. I frequent a lot of bars a d this one is really chill. You can definitely come here for a first date. Or if you just want to chill. I heard that they gave salsa parties once a month in the back and those parties are fire. I will definitely come back back on one of those nights. In the meantime, I'm enjoying my spicy margarita.."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMeVBpYVBBEAE",
            "text": "Came here for happy hour. The cocktails were interesting to try out, and the bartender was very cheerful and kind."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6NlA3ZHJnRRAB",
            "text": "Always have a good time here! Music is always good and food and drinks are amazing! Shout out to bartender Kenny too, was very personable and attentive being that he’s the only bartender to many patrons coming in and out."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqdGJmSTh3RRAB",
            "text": "What an amazing find! Staying in Brooklyn overnight to get on a cruise ship we stumbled into this amazing little bar.Great bartender and wonderful appetizers.Tap ,and bottled beers ,cocktails,and Happy hour! Highly recommend this gem!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURENXJPbHRnRRAB",
            "text": "Great cocktails, delicious small bites that are easy to share, great service"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNENnN5TkdBEAE",
            "text": "I loved L'wren. Great atmosphere and experience. Service was excellent and attentive. My only complaint on the food is that everything was spicy. Fun for a couple of things, but not fun for everything. Otherwise, great venue and highly recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5dmMyTVZ3EAE",
            "text": "The drinks were pretty strong but they were all great."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0NDZYa1VnEAE",
            "text": "This is my neighborhood bar! I don't get to go often, but when I do Travis and the other bartenders are so nice and welcoming. I recently had my birthday party at their private back room and Travis checked in to make sure everything was going well! The room had amazing atmosphere and was very clean and well designed. We weren't able to hang decorations on the wall, but was allowed to hang them on the back curtain and use balloons. Service is always amazing but most importantly the drinks and food are top notch. I accidentally left a bday gift at the party and they were able to find it for me later that weekend. Thank you for a good time and hope to be back soon!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0dFlid3hBRRAB",
            "text": "We had a 40-45 people party there on  Saturday, we got to be in the very large back room and it felf very private.\nTravis, Elissa and Tony took great care of our guests, even though we chose to have a cash bar, the cocktails were made promptly. Our guests looked a the drinks menu before going and were excited by how delicious the cocktails looked like and were.\nThe food is very good, my husband and I tried the food there before our party and the food for 45 people was exactly the same, they offer the same quality of food if you are 2 or if you are a big group which is not always the case elsewhere.\nWe didn't feel rush at the end of our party and the communication leading to the party was easy.\nWe recommend this place for everything: party, intimate diner, drinks with a few friends..."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN0eE5qbWxBRRAB",
            "text": "Excellent place for dates. Delicious tapas style nibbles I mean absolutely scrumptious!!! And of course the cocktails are everything:D"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROOTZUbzl3RRAB",
            "text": "Love everything about this hidden gem, service is top tier. Food is to die for and the drinks always hit the spot!! The ambience is everything here"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJNzU3U3B3RRAB",
            "text": "Amazing spot with the coolest bartender in town. The drinks are amazing and delicious. Great place to throw parties , back room is huge and so accommodating! 100+ can fit easy , had a few there already."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxdGZuSDZBRRAB",
            "text": "Surprisingly amazing bar food. Three Amigos is to die for."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxaGN1TnJ3RRAB",
            "text": "Lovely spot in a lively neighborhood.  Great music, excellent service.  More people need to discover it."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSbm9PTGtnRRAB",
            "text": "Food is delicious. Highly recommend the fish tacos and the tostada. Staff is super attentive and always going the extra mile. They have brunch now. Don’t miss out.\n\nUpdate: you must try the Kale Cesar salad. The artichoke is so flavorful!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURsd3F6TXVRRRAB",
            "text": "L’wren is the place to be. Great food and drinks , awesome margaritas , my favorite, Travis is Superb Always friendly I recommend this place to everyone, who enjoys great food, drinks and service I will definitely come back again"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsNDViVFJ3EAE",
            "text": "Stumble upon this spot when I was in the area. Cute little spot with outdoors seating that focuses on an Asian fusion tapas. I highly recommend the wings! They were so flavorful and juicy. The service was a bit slow as they were short staffed. And the food is a bit pricey for this part of Brooklyn and for just small plates tapas."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGdm82VnBRRRAB",
            "text": "Great drinks and food that will make you want to return again and again, and the ambiance is lovely with kind and attentive staff. We went for a large group party where we occupied their back room and they served shared plates, we were able to play our own music also they allowed us to use their screen and sound system for karaoke. It was such a good time."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1a2N5NVNREAE",
            "text": "We held a memorial service at L’Wren in their spacious back room. It was a private space, with couches for the attendees and it was well equipped with the technology needed for Zoom participants. The food and drinks received many compliments and the service was respectful and efficient. Highly recommend for any meeting, memorial, or celebration,"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM1Z3R5VmpBRRAB",
            "text": "Bartender was attentive and friendly and even gave us numerous recommendations to other spots in town, which was great because we are visiting for the first time. Food was very good. Do yourself a favor and get the asian sticky ribs!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaal9QbmJBEAE",
            "text": "Cute bar with “fancy” bar food and creative drinks. The venue itself is really nice with lovely decor and comfy seating. Great for date night!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURab192d0RnEAE",
            "text": "Everything is great about this bar. Travis and his team hosted a friend’s birthday party with open bar/food - was a fantastic deal. The back room has ample space to dance or lounge. Karaoke was a hit as well!\nService was 10/10, good list of cocktails to choose from, and affordable for the area."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURadE5YdTB3RRAB",
            "text": "Great bar in Sunset Park! Definitely a better experience than other bars in the area. I strongly recommend this place."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2dnV6VGN3EAE",
            "text": "Best cocktails in Sunset Park with the best staff. And do not sleep on the food! The menu is outstanding. Especially love the fish tacos and the tostada. They also recently added vegetarian options."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwMFBpNVJBEAE",
            "text": "I went here with a friend. A very nice place. The people were very nice. The music was very good. Love it. I would come here again."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKby1hYzBRRRAB",
            "text": "Amazing drinks and atmosphere"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNodG8zUEh3EAE",
            "text": "Wow!!  We came here a few years ago and we got so impressed.  They added food and WOW. You can’t get anything better. Asian / mexican / American fusion.  We loved everything we ordered.  Service was fast and amazing. And always nice to see Travis behind the bar making cocktails like a pro.\nThe back room is the best for any party.\nComing back in no time!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtMmYzaW9RRRAB",
            "text": "I came here with a friend for HH. They have a pretty cool HH from 4-7 on weekdays. The establishment is a decent cocktail lounge size (on the more smaller intimate side) and they have a back space for private events. The decor and aura of L'Wren is very nice. It's like a trendy but chill spot, at least on a weekday. I'm sure it becomes lively on weekends. They played perfect music that was not too loud so I was able to hold a convo easy with my friend.\n\nThe worker that was there that day was very nice and continuously checked on us to make sure we were ok.\nWe ordered:\nCrispy Korean Wings\nTingas Tostadas\nSalmon\nThe food was tasty.\nFor drinks we ordered:\nSangria and a mezcal pomegranate cocktail. The mezcal drink was absolute amazing!\nAlso, it's definitely a cool after work spot to stop by after a busy day. I will be returning and I have been recommending L'Wren."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4ci1Ld1dBEAE",
            "text": "I came here recently for happy hour with a friend and it was a delightful experience! The place itself is decorated beautifully and the layout allows you to choose different seating options. The service was amazing and they quickly corrected any mistakes made. The food was really good and tasted very fresh. Those drinks were made so tasty and strong and I will definitely be coming back to this spot to try the other items I didn’t get!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLOHRmeVdBEAE",
            "text": "You will not be disappointed coming to L’Wren! Travis is the owner/bartender and he is the difference maker that makes this bar what it is. He’s super chill, casual, nice, and makes a killer cocktail. They recently added food since COVID…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRbVpUbjNnRRAB",
            "text": "The place was definitely what we were looking for. Fresh spot, soothing minimalistic environment and music that makes me feel like home. The bartender clearly knows what he is doing and every drink on the menu (same as off) was delicious.…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCak9qZHVnRRAB",
            "text": "We had our Christmas party in the back room on a Friday evening from 7-9. The space was perfect for our group! Very cozy and comfortable. The menu was tailored to our needs, the food tasty and plentiful, plus the drinks flowed all night. We ended up staying way past 10pm. Everyone was chilling and having a good time.The service was friendly and attentive.The staff handled the stress well when things became busy and the place got packed. Great local bar with a nice menu, cool vibe and awesome service. We’ll be returning!! Thank you for a great evening."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvdmFDQWZREAE",
            "text": "Amazing atmosphere and excellent service. I cannot rave about this place enough, it's just what Sunset was missing. On any given day you can expect some chill tunes along with  tasty, refreshing signature drinks with a side of popcorn. Travis is the man, he not only makes some mean cocktails, he manages to provide a cozy and welcoming vibe no matter how big the crowd. Amanita supported us with a recent event and was an absolute gem. She made sure to make our guests feel welcomed while managing the busy bar."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSa1lpNTJRRRAB",
            "text": "L’wren is a wonderful bar with excellent cocktails and reasonable prices! The owners are lovely people. We had a party in the back room and Travis and the bartenders couldn’t have been more helpful and responsive. And the party platters…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1aWVuZGh3RRAB",
            "text": "We were hosting a pre wedding Friday night dinner for the Bride and Groom who were getting married in Prospect Park on the long weekend in May 2022.\nWe live in Canada and everything was left to them to create this incredible event.\nThe food was outstanding, and served beautifully into a wonderful atmosphere with seating areas and a long table for dinner.\nNo one actually sat at the table because they were having such an incredible time.\nThe flower arrangements were stunning and a perfect compliment to the decor.\nJessica’s design sense is impeccable.\nWe arranged an open bar which enhanced the experience as the rhythm of the evening was perfectly paced.\nThere was not one thing on the menu  we would skip. We had a range of food restrictions for our guests including a guest who eats only vegan food.\nThey were easily able to incorporate that into the evening seamlessly.\nWe decided on the spot to ask for Travis and Jessica to help us host the post wedding Monday Brunch. Magically, with very little notice they made it happen. And it was spectacular!\nThe food, the service, the quality and the value were easily 5 stars.\nAnd Jessica and Travis made our  weekend perfect."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2el9TNWJREAE",
            "text": "We live in the neighborhood and haven’t been here since they opened. But, oh wow! Travis K was our server and he was TERRIFIC! So nice, so accommodating—it was busy but he always made us feel cared for. Thank you, Travis! Food was pretty…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHLWQzSVBBEAE",
            "text": "We reserved the backroom for a birthday party a couple weekends ago and had such a nice time. Travis was very accommodating even asking us if there was any music requests. At the end of the night we had ordered two platters of food but he…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2dGVXak9nEAE",
            "text": "Shannon at the bar is outstanding. I walked in and showed a picture of my vaccination card to eat inside. She makes the bar a place where people talk to each other. It's a classic neighborhood bar with a lounge feel.\n\nTheir spicy margarita is their best drink.\n\nThe ribs are better than the wings in my opinion."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMybWNyOXV3RRAB",
            "text": "We went here for our first date w/o the kiddo since the pandemic started. We had a nice comfy couch seat in the front area. Open windows with lots of air flow but also heaters to take off the chill. Happy hour specials were terrific. Excellent cocktails and food. Service was great. Highly recommend for anyone looking for a super chill early date night in Sunset Park."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtaTRlbkh3EAE",
            "text": "Great local place! Excited to go back and try more drinks and food. Appreciated that the kitchen was open later in the evening (10:30/11pm). Chips and salsa were super fresh and delicious. Large portion! Easily enough for 4 people. You'll spend about $15-20 a person here for a drink and a snack."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnbWNqNHpRRRAB",
            "text": "Finally a legit bar in Sunset.  Delicious cocktails, beautiful bar with nice exposed brick wall, solid music (grooving to some Prince right now) and a super friendly owner/bartender.  Great addition to the neighborhood.\n\nUpdate: they’ve expanded the menu to include food.  Every item is killer.  Arguably the best food in the neighborhood.  Highly recommend the fish tacos, Mac n cheese bites, and sliders."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlM00zdGdBRRAB",
            "text": "L’Wren est très magnifique… from the drinks, to the bites, to the atmosphere, to bartender, to the neighborhood-  5 star vibes for sure."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4MzdtM0RREAE",
            "text": "I can't really speak for the food, but the doughnuts must be covered in cocaine, they are so addictive. I stopped in when a mate after eating half a cow a few blocks down. The doughnuts were desert, and washed down with some excellent cocktails. It's a great spot with plenty of space and a laid back atmosphere. Service was great as well."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNDODVlWUJBEAE",
            "text": "Casually walked by here with my wife so we decided to try it. What a gem! Covid hasn't hampered the service or ambiance..the food was terrific (Korean wings and tinga tacos) served fresh and served quickly. Travis our server/bartender was…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNCNzUzUkFREAE",
            "text": "Love the vibes at L'wren and the cocktails are so thoughtful and tasty. Feel so grateful to the team there too because they are so flexible in hosting community events there too with a beautiful back space. Always welcoming for Sunset Park neighbors! Thank you Jessica/Travis!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1Z2NtTHJRRRAB",
            "text": "We reserved the backroom for a small birthday party and paid $59pp for two hours of open bar. Although the space was beautiful, the service was subpar. The owner and the waitress came to take orders every 30 minutes and would take 20 minutes to fulfill the order. When following up on the order or making a new request, the staff rudely responded with \"we're not ready to take your order\". On average, those that paid for open bar got 2-3 drinks, and many of the orders were incorrect. Considering the major delays, everyone kept the incorrect orders to make the most of the limited open bar. Also note, that they were offering happy hour at the time of the event, yet all of my guest were paying full price.\n\nTo L'wren's credit, it was a very busy night, but they could have at least offered an extension on the open bar to accommodate for the delays in service. When talking to the owner to makes this request, she was unwilling to come to a resolution. Would not recommend for events."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSanRybFhREAE",
            "text": "Had a nice quiet evening to myself at L'Wren. Had the buttermilk fried chicken, tater tots, a few bourbons and watched the Dune remake in the back. Service was attentive... But also knew when I just wanted to be left to my own devices.  Everyone else there seemed to be well taken care of and enjoying a nice quiet evening in a dimly lit bar/lounge. Will definitely be swinging in again in the future."
        }
    ],
    "reviews_count": 71
}