{
    "name": "Maria's Bistro Mexicano",
    "place_id": "ChIJabtcqcdawokRGUYDWD2oQCI",
    "grid": "BK7",
    "address": "886 5th Ave #1f, Brooklyn, NY 11232, USA",
    "rating": 4.1,
    "user_ratings_total": 473,
    "phone_number": "(718) 438-1608",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CaGVtdzFaazFKYzJzNFdYRmpWWG80VTNOelNXYxAB",
            "text": "Service was very kind and efficient! Peach margarita was excellent and the Birria quesadilla was delicious. I liked the atmosphere and coziness of this spot, would definitely recommend if you’re in the area."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOTGRVaE1jM05UYzB4WmRrYzJkM2hPYWxsbmRFRRAB",
            "text": "the meat in the tacos, especially the chicken, was dry and flavorless. though the pork was a tad better i still would not recommend this spot, as there are way better options in this neighborhood and at a better price point...that are made with love. not worth it to drop 15-20 bucks here for mediocre meat!!! i was walking down 4th and stopped in to check it out without really thinking too much of it."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OTWRXOTBlbE52UWpKVVYyWTNaWHBQWjJocmRVRRAB",
            "text": "Cozy place with delicious food. Staff are friendly and helpful when ordering."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4UFJXb3lVR0oyTUZrM1luZFZNbEpFUm1aRU1FRRAB",
            "text": "Best mexican place in sunset park! Our favorite restaurant for taco Tuesday, they have the best offer!"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNDM29Td1h3EAE",
            "text": "The food very  little. Very expensive and not good flavor"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOQ1h6ZFhRVEZtVEhWTFlVRmZTekZxVEdWRlduYxAB",
            "text": "Food was good, but the prices was not. This is not the NorthSide Williamsburgs, is Sunset Park."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWUFFXSlNVbFJ3V2pNMlJ6SlhXRGRDVEY4MVdGRRAB",
            "text": "Incredible. I’m an out of towner in for a night before a cruise.  My excellent Wyndham Garden recommended this neighborhood restaurant just around the corner. Wow! It ain’t Taco Bell. Not TexMex, really real. Worth a visit."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLaVVwSml6cU1PYVF3EAE",
            "text": "Love the drink in here, especially the Miami vice that wasn't in the menu but they just made it specially when I requested. It tastes sooo good, I will come here every time I look for drink from now."
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPV0lpcnlkaWE2d1NREAE",
            "text": "Such a fun Cinco de Mayo celebration! The food was a total treat, the music kept the vibe going, and the drinks were on point. The staff was so sweet and welcoming — a great way to kick off the month of May!\n\nQué buen lugar para celebrar el Cinco de Mayo! Todo estuvo riquísimo, la música súper divertida, y las bebidas estuvieron en su punto. El personal fue un amor. Sin duda, un restaurante al que quiero volver."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZLW9xV0xBEAE",
            "text": "We live in the area but never stoped by last night we went and I must say that the food was delicious so was the margaritas I had the salmon plate it was yummy the guacamole and chips delicious I recommend this place it’s nice and chill."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvZ2FteHlRRRAB",
            "text": "Amazing steak & chorizo tacos and the churros were divine"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3ekxmU25RRRAB",
            "text": "Excellent food, great vibe, friendly service. Loved the chips and guacamole, tacos, camerones. Also the chili poblano was actually a sleeper hit."
        },
        {
            "date": "8달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRektqMDhBRRAB",
            "text": "Un beau moment passé à cet endroit 🙂"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnMlpLYzZBRRAB",
            "text": "Great food, great service, its been the closest thing to a home away from home."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBMzdySURBEAE",
            "text": "Best burritos ever"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBdGRQZmR3EAE",
            "text": "The steak tacos are out of this world. The best tacos in nyc and I’ll tried multiple spots"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfamNIYVBBEAE",
            "text": "Food was delicious, service was fantastic."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfME1xVHBRRRAB",
            "text": "9 dollar margarita to go what a time to be alive"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmNjZXMHFRRRAB",
            "text": "I discovered Maria's on New Year's Eve, and was warmly welcomed for dinner.  Friendly service, great drinks and delicious food.  So happy with my dining experience!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzc011eUpnEAE",
            "text": "Food was great and the staff were very nice. Great place to chill & eat with friends."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYanIzREh3EAE",
            "text": "One of my favorite places in the neighborhood and my go-to for drinks. Been coming to this place for over ten years and the service has always been great. Highly recommend it"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURucnZHRnVRRRAB",
            "text": "Amazing food and staff!!!\nI came here to have dinner with my friends, first let me say that the service is great ! Food and drinks were amazingly delicious.\nExcellent presentation, if you haven’t been to Maria’s bistro I highly recommend it.\nI will definitely be coming back with more friends and family ! :)"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURua3VPRDBBRRAB",
            "text": "Maria's Bistro cozy outdoor garden is a total vibe, especially with the new renovations. My husband and I can’t get enough of their delicious lunch options. Plus, the sangria and margaritas are simply perfection. Impeccable service in a clean spot has us hooked!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuNW8tY0V3EAE",
            "text": "My friend and I came in from out of town to visit and had been traveling for a while. This restaurant was recommended by the staff at the hotel we were staying at. Really good food!!  Small inside, but I believe they also had seating outside in the back. The mojitos were strong 💪🏼! The waiter we had was really friendly and helpful with suggestions."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuaHBQRHhBRRAB",
            "text": "I went in around 1pm. Sign said happy hour from 12-7 pm. I ordered one margarita and when I paid it was 16 dollars. Which I think for happy hour should be cheaper. Won’t be going back. I feel like it’s should have at least been 12 I know things went out but a small cup for 16 is insane."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIOXR2bVNnEAE",
            "text": "Loveeed the drinks 💜‼️‼️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIeTlmalBREAE",
            "text": "What a disappointing place, the bartender treated me and my friends badly, I expected better service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3Xy1pemZBEAE",
            "text": "They’re version of vegan tacos are literally just a ton of spinach and two slices of mushroom! Disrespectful they’re drinks are good food wise for vegans deft not"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3MTRQX0dBEAE",
            "text": "My friends had their wedding reception dinner here on a Saturday night. The service was great, everyone was on top of stuff and very friendly. The guac was super fresh and tasty, and i had the Carne Asada, and it was so juicy and good along with the rice and beans. Also the frozen margaritas really hit the spot in the summer heat."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3c0lUdWxnRRAB",
            "text": "Excellent food and service!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiamNUTVl3EAE",
            "text": "La chica q contesta el tlf no presta atención no me mandó mi orden correcta al igual q pedí guacomole fresco y estaba frío casi frizado. Es recomendable solo ir a comer al sitio porq cada vez q pido delivery siempre me envían mal lo q pido"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiNXVDOVFBEAE",
            "text": "Good food, could use a little more flavor but overall we enjoyed our meal."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiMHF5b2NnEAE",
            "text": "Absolutely fantastic.  The Chorizo Burrito is amazing!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNibDUzVnZRRRAB",
            "text": "Prior to even tasting the food, we had called the establishment as they left out the rice and beans portion of our meal (we paid more for the combo flauta specifically for the rice and beans aspect). The woman on the phone, she said her name is Maria (assuming the owner?) agreed it was left out and seemed indifferent and dismissive. She did not offer to help in any way or replace it, I had to further probe to ask if she could have someone deliver the missing item. She said this is not possible as it is \"too far\" (the delivery location is not far, we even checked on the maps what the driving time would be and if there happened to be traffic at that time). I had to keep probing to see how this can be remedied, which I am uncertain why that is the customer's responsibility to do, and she just said to call Seamless and get my money back from them- there is nothing more she can do. I became distraught by her dismissiveness and she said the only thing she can offer me is restaurant credit for something small the next time I order- as if we would give this establishment our business again with this type of service.\n\nI understand things accidentally being left out, I understand a lack of staffing unable to complete deliveries. However, it is due to Maria's complete nonchalance and dismissive attitude over a paying customer's missing item, and disregard for any type of sincere customer service, that I refuse to give this place any future business- and urge the community to do the same in order to pressure the standards that establishments should have.\n\nIn terms of the food, it was average. The empanada was good, the burrito was ok (not well distributed/too much rice, not noteworthy), salsa verde was lacking, salsa roja was delicious, flautas beef was dry, cheese had dried up, and the rice and beans that would have salvaged the dish were missing entirely. Although it is not the kitchen's fault for the demeaner of the owner, I'd recommend other Mexican establishments for both food and service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNieTlpQ1JnEAE",
            "text": "I don’t know how I haven’t written a review yet when I’ve been here dozens of times already! I come to the area for work and Maria’s is right there from where I usually stay.\nWhen I first came, my go to item for Mexican restaurants is Enchiladas Verde with Chicken. I haven’t tried anything else because this is the best one I’ve ever had and it’s such amazing comfort food for me after a long day at work. Love the vibes and servers are hardworking and helpful.\n\nSome cons that I don’t mind but may be inconvenient for others: No air conditioning in the summer and a small bathroom.\nI noticed that the enchiladas had gone from 3 to 2 enchiladas overtime but they’re so dang good that I don’t mind. I also have a small stomach so it’s still a good portion for me haha.\n\nStill 5 stars for me and I’d recommend anyone to visit!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURydUxiS1pnEAE",
            "text": "Excelente comida."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNydzZ5Ni1BRRAB",
            "text": "Love this place!!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUX19ETkxBEAE",
            "text": "Randomly walked in here with a group of 9 on a saturday night and they were able to seat us right away. Turns out this place is a total gem! All the food and margaritas tasted fresh and delicious. The waiter did an amazing job, especially since we were a bit rowdy after several pitchers of those margs. Def recommend going here when you’re in the neighborhood!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUNDV1SUJBEAE",
            "text": "The best chilaquiles in Brooklyn! So good that our group gets it basically every time we come here. Delicious guacamole as well and homemade tortilla chips, so good! Their brunch deal is great as well."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUakpIMlB3EAE",
            "text": "Lugar de buen agrado"
        },
        {
            "date": "1년 전",
            "language": "de",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqM3VtNkl3EAE",
            "text": "Eine gemütliches kleines Restaurant mit Bar im vorderen Teil. Ein total toller Kellner, super freundlich, haben 3 Tage infolge dort gegessen. Absolut empfehlenswerte Speisekarte. Das war das beste Essen in Brooklyn 5⭐️⭐️⭐️⭐️⭐️ plus"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREeDh5Uk1BEAE",
            "text": "Ordered a soup, it was cold. The enchilada was also cold. The two of us were provided one set of utensils. Sat on the patio and didn’t see the waiter for the whole time. I don’t understand why I’m paying for a $22 enchilada that was ice cold inside and with only two in an order. Won’t come again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5c2R6Y19RRRAB",
            "text": "We love it here! We have honestly became regular customers because we are always welcomed and treated with great service. The server Jorge is the very best!! We love him!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkN3VmLTR3RRAB",
            "text": "Stylish Mexican decor that's more eye candy than a sugar rush. However, amidst the dazzling ambiance, there's a lingering scent of cleaning supplies, which, let's just say, doesn't quite pair well with the dining experience.\n\nSadly, the carne tacos didn't quite hit the mark for me. They were more like a dull monologue than a flavorful fiesta. Needless to say, they won't be making an encore performance on my plate.\n\nFear not, cocktails were pretty good. The service is as swift as a sombrero in a breeze, ensuring your glass is always half full."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkcDRTNWV3EAE",
            "text": "Great place awesome drinks and is very authentic"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWMTVMUm53RRAB",
            "text": "I work long hours, and when I'm free I want to eat great, and be in a comfortable environment and this restaurant has it! Menu is well explained.  Every weekend they have different food specials that make every weekend different and unique.  They have many cocktails options. And if your craving a drink that's not on the menu they still try to make it if they have the ingredients.  The restaurant has TVs where I enjoy watching Sunday football!!!! Highly recommend coming to eat here!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURacThDcjl3RRAB",
            "text": "Wonderful meal, terrific staff, sweet location, and perfect all-around. And, a taste of real Mexico!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNad2U3dkpREAE",
            "text": "Maria’s Bistro has great food , drink and staff. I big mention to Luz, Jorge and Mario.\nThe best place to to eat and drink in Brooklyn"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwMTdPUkt3EAE",
            "text": "very poor service ordered 2 desserts and two drinks took about 30 minutes for my drink to finally come out! waste of time 3 leches is dry churros are the only thing i enjoryed there!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwOG9lZmFREAE",
            "text": "This place was super nice, friendly staff and delicious food!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSazltZlFBEAE",
            "text": "We were seated outside originally but it was chilly at the time. The waitress was kind enough to move us once more favorable seating was inside.\n\nThe atmosphere inside is awesome. Definitely love the decor. It's a bit narrow going in and had seating along the walls but we preferred the back since the space is a lil tight with people also walking by.\n\nThe food and drinks were great! Definitely enjoyed my drink!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCamEzY0N3EAE",
            "text": "I love this place! Everything is good. The food is freshly made and it’s authentic. I love the service and the servers I love to go in and eat alone in peace and I never feel uncomfortable or alone. You have to try the fish Tacos my favorite. Their Sangria is delicious too"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4cWYyemN3EAE",
            "text": "Sooooo glad that we decided to give this little place a try. The food SUPER FRESH, seasoned and cooked perfectly...My mother had the Salmon and I had the Carne Asada Tacos.....We sat outside and had a fantastic lunch! The food was quality and the service was excellent. Give them a try if you are looking for quality Mexican food."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlcTZEY2JBEAE",
            "text": "This place is amazing! The food is tasty and so are the drinks. I usually get the tacos or flautas and I’m never disappointed."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURDNDQ2N09REAE",
            "text": "The tacos were really good and balanced. I got the chorizo and carnitas (not pictured). Tacos are affordable. I got the pina colada which tasted like there was only coconut. I didn't taste the alcohol at all. I will be back to eat the tacos again."
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNpeWVMTkFnEAE",
            "text": "Ordered a burrito like I have done in the past, but this time it was a total failure. Completely filled with chicken fat and chicken skin and peppers, totally inedible.  So disappointed, I have gotten a chicken burrito from here at least…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtMlBIb3R3RRAB",
            "text": "One of my favorite Mexican restaurants in Sunset Park. Love the food and staff.  The Margaritas are a great. Food is delicious."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBdmQyelJREAE",
            "text": "Great good, service was friendly.  Had the steak and egg brunch that included all you can drink option. The waitstaff is good at coming by with refills."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4cnQtdEt3EAE",
            "text": "Ordered online and left the tip at the default 15%, they sent a very miniscule amount of rice with my 24 dollar dish, and a 7 dollar tip. Total for the order was damn near 60 bucks and both orders got the same of rice, the dolip of cheese is the size of my thumb! You see the white spec on the pic yes that's the size of my thumb!!! Not worth 24 dollars a dish."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlMEs2bVhREAE",
            "text": "Love this place . Everytime I go I enjoy the margaritas . I had a frozen margarita to start and wow it really hit me lol.thats why I enjoyed the margaritas ! The waiter (JORGE) was really attentive to us. NICE PLACE !!!"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ4dTcyNF9RRRAB",
            "text": "The food was very tasty but spinach was cold. They fixed it up right away. Great service."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBbjR1eXlnRRAB",
            "text": "Good service steak is on point and the guac and chips is bangin patron margarita 💯…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtZ3J1TFZBEAE",
            "text": "Beautiful place, excelent service, amazing Mexican food. The waitress for today's brunch was very very nice 😊👏👍 thank you Guys 🤩🥳😘"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4NzZmVnBnRRAB",
            "text": "Made a reservation for large party and the staff was very accommodating. The waitress was fantastic! She was very attentive\nand went above and beyond. Also, the food was great. We had a wonderful experience. Will definitely be coming back again!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLeE5lbUtBEAE",
            "text": "There isn't enough great things I could say about this restaurant! The service was top tier, super friendly and fun. The food was absolutely amazing. Ive been having an itch for fried fish tacos and that itch was definitely scratched.…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKOHZlZll3EAE",
            "text": "Dining in always has attentive, friendly, staff and the food is great. Delivery is a different story. I really hate leaving a bad review because I love this restaurant. But others in my situation really need to know the facts before they order delivery. My recent order was placed online and was very fast. However, when the delivery person arrived I buzzed them in and they never came up as instructed in the delivery instructions. I went downstairs to see where they left the food and the guy was just outside talking on his phone. I opened the door and said what's the deal? And he just looked at me and claimed he didn't speak English. Then he asked me for a tip, in English. First of all, the tip was already added to the order. Second, a tip is for following the delivery instructions. This guy wanted more money for not finishing the job. Needless to say I requested that the tip be removed from my order. I recommend you dine in at this restaurant which is always an amazing experience. As for their delivery staff, they obviously don't care about their job or the business they represent. Btw, the delivery guy was wearing Maria's Bistro clothing, not a third party delivery service."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLdU1mdjhnRRAB",
            "text": "This place has great outdoor seating. Amazing food. Drinks are very strong. So good for most. J prefer cocktail to have more quality than quantity but to each is own. Definitely a place to visit. Food is amazing 5 stars for food for sure. Took away one star because of quality of drink but other than that great place to eat!!."
        },
        {
            "date": "수정일: 3년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxbWZYbE5BEAE",
            "text": "Amazing place, es increíble el lugar, cuando entras recuerdas una parte de MÉXICO."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxcThUSGZ3EAE",
            "text": "Nice place great outdoor seating. Can really say anything nice about the experience I had. Waitress avoided eye contact the entire time I ordered, it was weird. The drinks came only when requested, after more then 20 minutes of waiting. No…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKdUp5U2t3RRAB",
            "text": "Food was mid don’t recommend the deserts to sweet. Only problem of the evening will be the encounters of rats running on top of the wooden sticks outside. Service was great overall. It really was just the rats that threw me off. They could have easily fallen on top of us. Just a heads up for the back area."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4aXFQNDNnRRAB",
            "text": "The food here is good but absolutely not worth the bad service during brunch. I’ve gone for brunch twice - the first about two years ago. They were completely neglectful to the point that I had to take the check up front. Thinking that it was because we opted into a bottomless brunch, I decided to return and not do bottomless. Their brunch menu is now $35 for an entree and three mimosas/bloody mary’s/champagne. When I asked to opt out of the drinks due to my previous experience the server rudely informed me that the price would be the same either way. The mimosas were hot and mostly juice and the food took so painstakingly long to come out. The eggs in my machaca were cold and the carnitas tacos were dry. There is no way I will ever return to this establishment."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxai1fNXdnRRAB",
            "text": "I went here with a couple of friends for some food for take out. There were long wait times, the waitress would walk away a lot and not say much which was very confusing. When I got my food and finally ate it, the guacamole, lettuce, and…"
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRdHBmSERREAE",
            "text": "Mario is amazing! We arrived for happy hour and he made the best drinks for us. He adjusted the drinks to our liking and was very attentive. I also received the free flan for checking in on yelp. I had the skirt steak meal and everything…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM4dklyWjhnRRAB",
            "text": "The WORST service possible. Waited 40 minutes for my drinks, eventually gave up and left. Had to chase the waiter down 3 times for a drink menu which he never brought. The girl cleaning and bussing tables actually had to take our order…"
        }
    ],
    "reviews_count": 74
}