{
    "name": "Zona Sur Bar Bistro",
    "place_id": "ChIJu2tlKbhawokRkz2dHlgxzUo",
    "grid": "BK7",
    "address": "4314 4th Ave, Brooklyn, NY 11220, USA",
    "rating": 4.6,
    "user_ratings_total": 508,
    "phone_number": "(718) 788-1606",
    "reviews": [
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZMlFUa3dhelJTYjNsSGJETnlYM05UWjJsek0xRRAB",
            "text": "My affection for this place is well-founded. The team displays warmth additionally. The food satisfies completely. The service responds promptly. The costs remain reasonable. The waiters and meals always meet expectations. I'm excited to bring various people to try this."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsdFRHazJhakJQVjNKSWNtTk9kbEpzYjFOek1WRRAB",
            "text": "Great spot putting out some great dishes. I highly recommend the branzino and zona burger! Will definitely be coming back."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xaVVRsTnRURU5ZU1hkSVRWWnVTbWN5TW5SdWRWRRAB",
            "text": "The margaritas are great, service and atmosphere was nice. Food was solid! The burger and chicken sandwich we got was great. The margherita pizza didn’t have any sauce which is…strange, it was moreso just a flatbread with cheese and toppings. Still good tho!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CTk9DMUhSRTlPUTBkeU9EZ3dWRU5oTUhabFdGRRAB",
            "text": "Very impressed with the quality of food and service at this charming place. Not many quality sit-down eateries in this part of town but this one is a gem. I had the avocado salad with salmon. Fish was perfectly cooked and the salad was very fresh and not over-dressed."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wVkxVdEJWa1ZzYms5R2JteG5Ta3Q2Y21SUFJFRRAB",
            "text": "Someone back in that kitchen is COOKING!\n\nNothing but love."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xNeWVuVTJUVGswVTA1bVlWTndhV3RLZFdFM1RIYxAB",
            "text": "⭐️⭐️⭐️⭐️⭐️\n\nThis is my third time visiting this lovely café, and it never disappoints. I first found Zona back in June while staying at NYU with my mom. After one too many hospital cafeteria meals, I Googled restaurants in the area, took a chance on this spot, and was pleasantly surprised. The staff, bartender, and even the owner Luis were so welcoming, and the clientele was just as sweet. That first visit I had seafood pasta, apple bread pudding, and a great cocktail—every bite was amazing.\n\nFast forward to August, when my mom had to return to NYU, I knew exactly where I was heading. After just one day of cafeteria food, I came back to Zona. After almost 12 hours at the hospital I stopped in for brunch before heading home this Tuesday afternoon and ordered the Zona French Toast with a passion fruit mimosa and margarita. Oh my gosh—so good. Excellent service from the owner himself.\n\nLater that week, after closing my shop, I came back again for dinner. I started with the Zona slider (so delicious I inhaled it), then had the fish tacos with branzino, corn salsa, and all the toppings—perfectly satisfying. I even have left overs as it is a generous serving. I paired it with an espresso martini that was easily one of the best I’ve had in years. I also had a passionfruit margarita that hit the spot after a long day. SO GOOD!  The server, Dani, a young lady, was excellent, mentioning the special and providing me with suggestions. Everything was fresh and delish.\n\nWhat really stood out was that Luis, the lovely owner, remembered me when I returned tonight just a couple of days later. I told him I’d be back—and I meant it. That kind of personal touch is rare and makes Zona feel like more than just a restaurant. For me, it’s become almost a comfort spot—somewhere I know I’ll get a good meal, a warm experience, and leave feeling better than when I walked in.\n\nThe space itself is cozy with great music, string lights for ambiance, and just the right vibe. You can come here on a date, with friends, with family, or solo—and you’ll feel right at home. I learned that Zona has been here since 2012, and it shows in the consistency, quality, and care.\n\nGreat food, great drinks, great people. Anytime I’m in Sunset Park, this will be my go-to spot. Trust me, you won’t be disappointed.\n\nI apologize for the “after” photos only, but truth be told I usually eat their meals faster than I remember to snap a picture, and this was no exception!"
        },
        {
            "date": "수정일: 2달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxNkxpWGVnEAE",
            "text": "La comida  buena"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCblRWWktTRUV3ZVZkT2FVeEZZWE4xVVdsaFVFRRAB",
            "text": "the desserts were the best part really good\n💗🌸"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GSGVVcG9kRUYwU2xCdmRpMXJWRzgwVW5wQ1ZVRRAB",
            "text": "What an amazing Place!\nThe pizza is delicious and the steak ufff 10/10\nservice it was great and atmosphere  👌  muy agradable!\nThis place became one of my Favorite now!\nby the way DRINKS ARE SO REFRESHING AND SOOOO GOOD!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLM21rYlNYcUt5Z2FREAE",
            "text": "Excellent food – we had lovely avocado salads with just the right mixture of arugula and onions, and a piece of salmon over kale with thinly sliced beef in an interesting mustard sauce. What clinched it was the wonderful wait staff who shared the Spotify playlist which was jamming in the background."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLejMwcVBZc09tT2x3RRAB",
            "text": "Just the right vibe for a family hang on a Tuesday night."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VQM1NwSnJDeHRqWkxnEAE",
            "text": "I used to eat here when I first lived in Sunset Park more than 10 years ago. It's great to see it's still going strong. The food is fun and very tasty with some good options on the menu. The service was very good and I'm looking forward to eating here again."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZeU5DYjlRRRAB",
            "text": "It's was amazing good they Best ive has here in new York"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvNXBxWnpnRRAB",
            "text": "Spent a balmy spring evening here and savoured the warm atmosphere within. Excellent service and a delicious steak sammy- will return when next in Brooklyn"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRX3MzQlFBEAE",
            "text": "This place was an absolute pleasant surprise.  Excellent drinks and food was great."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRenFyLVhnEAE",
            "text": "Looking to kill some time with a small group and found this cool little spot.  Was impressed with the quality of the food & drinks.  Service was friendly, fast yet attentive.  Highly recommend the Chicken Empanadas, Steak Frites, Chicken Paillard, & Spicy Margaritas."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnOTctSFd3EAE",
            "text": "Very nice little Bistro, went for a quick dinner after arriving in town late from JFK. Nice food selection and very nice staff."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnbHRDRkxREAE",
            "text": "tacos and nachos here are so so good!! def recommended"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnM05HWTBnRRAB",
            "text": "The food is great and so were the drinks. The service on the other hand was the worst. The waitress NEVER came to check up on us. We never received water. I noticed she was very very attentive to a couple that was next to us. Within 15 minutes she came over to check on them about 4 times. TOTALLY UNACCEPTABLE. I had to ask for another drink, and it took them 15 minutes to bring me the drink, while i saw the other people get served their drinks. They were VERY selective on who to service, felt very uncomfortable being there. It was my first time here and they did not leave a good first impression. I will not come back here."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBNmFhdUtREAE",
            "text": "Delicious! I love their french toast and the eggs were tasty."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBMG9fX0t3EAE",
            "text": "Favorite spot for brunch!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfcTZlRUxREAE",
            "text": "Been coming here the last 4 years almost, chicken torta for me never disappoints. Fries good, service cool, cool placee"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmMWFuUWJnEAE",
            "text": "Local neighborhood hole in the wall joint with good food, good happy hour with strong drinks 🍹 and good people. Support your local buisnesses! They work hard and treat you like family"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmaHJEajFRRRAB",
            "text": "Food was really good. Amazing quality. I asked for chimi churri for my burger and it enhanced the flavor like no other. Sangria was refreshing yet strong. Will be back 😊"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmdHNTRF93RRAB",
            "text": "The nachos are amazing service was fast and friendly if your in the area a definitely a place to stop"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmMG91eUNREAE",
            "text": "They didn't want us there. Spoke to the server in Spanish and he answered back in English so I believed I assumed wrong (mea culpa),  but then spoke to the other servers in Spanish.\n\nI ordered my eggs sunnyside, got them scrambled, my bacon was burnt crisp, the home fries had little to no seasoning and then the other server gave us the wrong check.\n\nIt's pretty clear they didn't want us to come back. Well, we won't, deuces."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQOFB1bWx3RRAB",
            "text": "Good vibes and amazing food"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQeE9IRUtBEAE",
            "text": "First time at Zona Sur and we're already talking about having coworkers meet here for dinner/hang out. Great service, great food & cool vibes. The drinks were great too. It felt comfortable for 2 people at a table and I'm sure it'll feel great with a small group also. I will definitely return for round 2."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzNGVhMGhRRRAB",
            "text": "food is delicious but portions are way too small, sangria is excellent but served in a small glass, I drank it in 2 gulps."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzcXFTVnZBRRAB",
            "text": "Had two fantastic meals at Zona whilst staying in Sunset Park for the weekend. Very welcoming place, good atmosphere and great service. Food and cocktails of a good London standard and at $20 for most mains, very good value for money (by NYC standards)."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYcklLZWlBRRAB",
            "text": "Food was excellent, and staff was very friendly and attentive!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIcy0yRlJBEAE",
            "text": "Went for brunch with my parents. We were on the early side of brunch, so we had the place to ourselves. Great atmosphere, music and lovely patio. Excellent and attentive service.\nWe all had different brunch platters; I had the delicious French toast with sausage and fresh fruit. We were all satisfied. However, the home fried potatoes were barely warm which is the reason I didn't rate the food higher."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3MTU3cWhnRRAB",
            "text": "La comida excelente pero el dueño lamento decirle que no quiere hacerme el deliver por qué no se su pone que el delivery es gratis yo le doy 5 dólares y no quise venir por qué el dueño a dicho que no entonces cuánto tengo que dar de propina para que me traiga la comida"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNRaGIzdVBBEAE",
            "text": "They have the best French fries ever!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3d3FiMUNREAE",
            "text": "Although the food was yummy. The service wasn’t great. We were the only two people at the restaurant before anyone else came and our food took so long to come. Our waiter didn’t come to us to see if we wanted or needed anything else in the meantime. I can only imagine how’d it be if we would go on a busy day."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNieC12bGF3EAE",
            "text": "So the food was very delicious. The service was excellent. Unfortunately atmosphere is fine although It’s small i find that the tables are way too small for everything they have on the table. It’s way too small of a table and needs to be longer in length or longer in width & all that stuff could not sit on the table if I’m gonna order appetizers pictures of margaritas and eventually an entrée! I’m gonna make a reservation for four people so my tables bigger next time because I will be back great place .\nThe food is absolutely delicious.!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6M2NPVGxBRRAB",
            "text": "The service was fine nothing exceptional but they are kind. The decor is cute. The portion sizes for the prices are poorly executed. The sangria is $10 for a class and they serve it in the smallest wine class I’ve ever seen sangria served in. Def not worth the full $10 price. The steak was more well done than medium."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6cGI2WGVREAE",
            "text": "Great find! This place is a green with great good, great portions, great prices and incredibly good service. Very happy with how warm and welcoming the staff are and how good the food is.\n\nGood place to sit down for brunch with the family or dinner with the wife."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6c3EzNW5BRRAB",
            "text": "Tuve el placer de cenar en Zona Sur Mexicano recientemente y fue una experiencia absolutamente excepcional. Desde el momento en que entré, me sentí acogido por el ambiente cálido y auténtico del restaurante.\n\nLa atención de los meseros fue impecable; fueron extremadamente amables, atentos y siempre dispuestos a recomendar los mejores platos y bebidas. No sólo se aseguraron de que nuestra mesa estuviera siempre bien atendida, sino que también nos hicieron sentir como en casa con su hospitalidad genuina.La comida fue simplemente deliciosa.\n\nCada plato estaba lleno de sabores auténticos que me transportaron directamente a México. Las porciones eran generosas y la presentación, impecable.Definitivamente, Zona Sur Mexicano ha ganado un lugar especial en mi lista de restaurantes favoritos.\n\nNo puedo esperar para volver y probar más de su exquisita carta. ¡Altamente recomendado!\n\nLuis y cyrus. Buenos muchachos"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqeWNpUUp3EAE",
            "text": "Surprisingly good food (great salmon dish) and excellent, attentive service"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEZzdtazlBRRAB",
            "text": "Small cozy place with delicious food. I loved it."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEM0lqb0tREAE",
            "text": "Discovered this cute restaurant and cafe in Sunset park that was absolutely perfect for date night. Service was amazing and the menu was delicious. 🔥\n\nWe loved the chill, causal vibes and exploring this menu filled with an eclectic mix of cultures. The cocktail list is extensive and our pisco even had Hibiscus bubbles on top! Get the steak frites and the garlic shrimp for sure."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5XzVLZnhRRRAB",
            "text": "Great  staff and service  and food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5dDhhaHlnRRAB",
            "text": "Amazing food and lovely owners. Try there steak frites🤤🤤"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5bk8tQWRBEAE",
            "text": "The other weekend had a second date and I love this place! The food and the drinks was so good and the atmosphere was the pizza she had was soooo good"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkNDY2UjBRRRAB",
            "text": "We have dined here with our 3 children, ranging from 15years to 8months. The staff is always accommodating and wonderful. The drinks and food have been amazing on every visit. Today, because of the snow we decided to call for delivery. The food & drinks arrived promptly & everything arrived as expected. I HIGHLY recommend Zona Sur & will continue to visit often. Sunset Park has a diamond in the rough, Zona Sur is incredible. Thank you."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0bUkzOEV3EAE",
            "text": "Met some clients here while in town for business. Food was excellent and we had a wonderful time. I would definitely go back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROb3MzSWh3RRAB",
            "text": "One of my favorite local spots, service is always amazing, food is great, and the ambiance is on point. Homey and cozy ✨️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWOXJxcXRRRRAB",
            "text": "I think the staff is very rude only care about how much tips they can cause that's all they kept talking about behind the scenes since I was at the bar that's all I heard,t I ordered two drinks and everytime the kid made my drinkhe put his dirty hands in the condiments jars and put them straight into my drink the bar seems very dirty alot of fruit flys in my face while sitting at the bar I never seen the staff wash their hands or wear gloves while handling money then making drinkings picking dirty tables up and they kick you out before closing time so they can rush home very rude to me I came out to visit an old friend and both of us were disgusted with the atmosphere the staff brought you"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNscjlXQUd3EAE",
            "text": "Zona Sur was cozy, inviting,  great atmosphere. It's a small place, but definitely worth a visit. The service was friendly and welcoming. I had a coffee martini,  absolutely delicious,  and a chocolate martini,  also excellent.  Packed a punch, they are not stingy with the liquor.  I would highly recommend it"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCN3RpeVJBEAE",
            "text": "I came here with two of my sisters, one came from out of town and we picked this place at the last minute so we didn't have a reservation. The place has lights on the ceiling which was nice and the food was so good and the server was nice and recommended desert. We couldn't decide so we got the lava cake and a apple crumb 😋  They bought us over some shots before we left. Lovely vibes and can't wait to come back"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZLS1USmhnRRAB",
            "text": "I been obsessed with this place since it opened a few years back! It’s nice to have a restaurant close to home that offers different dishes and knowing no matter what I’m going to try, will always be good! They have good music .. and isn’t…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZbWF5YXJBRRAB",
            "text": "What is not to love about this little gem.. first off I was there 2 days in a row .. first day for baby shower they hosted and next day for breakfast. Absolutely wonderful and delicious meals ...everyone was very happy at the shower and…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURweTRYRmt3RRAB",
            "text": "Very nice restaurant with polite and quick service.  We ordered pizza and steak frittes.  The dishes were very good, fresh and well seasoned.  My girlfriend was delighted with the food and drinks, which speaks for itself.  We highly recommend visiting Zona Sur!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4c2RMRDh3RRAB",
            "text": "Hidden gem in Sunset park area! Had the Classic Penne Vodka&chicken, came with grilled buttered toast! The toasts are put in small paper bags so you can enjoy it easily. The penne was good, the portion of chicken and the pasta were perfect. The sauce made it creamy and juicy! The restaurant also has a patio at the back. Good vibe!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKLS1MSXlRRRAB",
            "text": "Wonderful, friendly, delicious. Tamarind margarita with tajin 10/10. Guac 10/10. Chicken salad 9/10. Joanna and service 10/10. We were talking about tajin and its uses and she said let's try it on an orange cause some of the people she works with do it. So we did it and it was delicious! Thank you!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoaThDVDR3RRAB",
            "text": "If i could give Zona Sur more than 5 stars I would.  The place is small + cozy but the food, the food is beyond DELICIOUS! Ordered the margarita pizza, which is really like a flatbread.  The taste was no basic, the taste was elevated! Also ordered the Zona Sur Burger, it was beyond juicy! flavors i have never tasted before.  I didn’t want my food to end.  Finally, the drinks. The mojito was just as tasty as the food.  Highly recommend. Will be returning to this spot."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURrbTZDSTNRRRAB",
            "text": "Popped into this place for breakfast, very nice interior with a bar and outside seating in the back as well. I ordered the classic eggs Benedict with prosciutto which was absolutely delicious. The poached eggs were cooked perfectly, and the hollandaise sauce was tangy and creamy, exactly how you'd expect. My friend had their special omelet with spinach, mushrooms, and mozzarella, also cooked perfectly and was very tasty. Service was prompt so whether you need a quick meal or want to relax this could be a great food/drink option. I had a drip coffee which completed the meal nicely. I will definitely plan another meal here when I'm visiting the area again."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKeV9PVWVnEAE",
            "text": "Have come multiple times to this place. Food is always amazing and worth the trip, the drinks are an 8/10 could be better. Recommend the Chicken Paillard or the prosciutto pizza they are so tasty!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSbWFTcGVnEAE",
            "text": "Hidden gem here. A wide ranging menu from empanadas to a New York Strip to mac and cheese to branzino! That’s the regular menu. The brunch menu is even more extensive and creative. Service was A+. The gentleman behind the bar was very informative. There is a backyard here with a patio. The food ranges from Latin American cuisine to Italian classics to modern American dishes. Impressed. I got the Calabria pizza which consisted of burrata cheese, sopressata, and jalapeño. Really good. A good list of cocktails as well. Will definitely be back if I’m in the area. That’s the one thing, it’s kinda out of the way. Other than that, it’s a wonderful restaurant."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhaUt2TXNBRRAB",
            "text": "This is a throwback to my time living in sunset park Brooklyn. This is a gem of a restaurant that although we haven’t visited in a year puts you right back where you wanna be. Start with a Bloody Mary it’s light spicy and refreshing. It’s not overly boozy which I enjoy and trust me on an empty stomach leads to reviews lengthy and lovely like this lol the food menu recently changed we used to be able to get the focaccia pesto pizza with a side of chicken chorizo but no more!! So we ordered the other pizza side of egg and chorizo on side lol yes this will charge me more but the experience is always worth it and so is the food. They even sat us 30 min earlier than noon. The respect and quality of food here is why I keep coming back. Cheers!!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZMmFLSC1BRRAB",
            "text": "This is one of the best brunch place in sunset park neighborhood. They also serve la colombe  coffee which is perfect start for the day! I am a regular visitor here as they serve delicious breakfast with perfect portions and reasonable rates! The staff is very friendly as well!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoczVHODBBRRAB",
            "text": "Cozy, strong margaritas, nice staff and good food. Everything was pleasant here. We enjoyed it and would recommend you stop here and try the food."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3MUxmQ3Z3RRAB",
            "text": "I went there for dinner and we ordered the salmon special which was salmon over mango pico de Gallo and spinach and the lamb special. It was alright. Hoping to go back for brunch and see what the rave is about."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlME9uU21RRRAB",
            "text": "Amazing food and great service, very friendly staff.  The buratta appetizer was amazing.  The herb fries are to die for! We will be back!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURrc2FyTmRBEAE",
            "text": "This food was AMAZING. I got the halibut and mango sauce and thoroughly enjoyed every single bite. Food alone was 5-stars. The service was good, but nothing amazing. Server was nice though... I'll gladly go back."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNbUxHVVl3EAE",
            "text": "Delicious surprise!\n\nWe were in town for a business meeting and found ourselves 2.3 miles away from this place, so it was the reviews that made us drive here in pretty heavy traffic.\nAnd the reviews were right! My 🐔 and my friend's 🥩 fritters were tender, full of flavor and plentiful.\nThe presentation was great, as well, but it took a while to come out even though there were only three or four other guests in the joint.\n\nDecor was festive this time of the year, but in general, the owner has created a cozy, rustic and somewhat intimate atmosphere with some barn-found items on the walls and furniture.\n\nOne other, totally food-unrelated observation about the bathroom - I don't love New York, but since I come here relatively often, I am always in awe and impressed by the ingenuity and ability to use any/all available space. You can only turn 180 degrees in the bathroom and you have to keep your hands tight to your body, but it has everything you need to get the business done - just tiny! The tiniest sink, soap dispenser, even mirror was shrunk to fit the space.\nBravo! You can count on me being back, if I find myself back in Brooklyn."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhejRQN0ZnEAE",
            "text": "Been a loyal customer for 8 years and this is my second review. My last few meals from here have been disappointing and not leaving me wanting more. Ordered takeout breakfast and got inedible burned pancakes that looked thick and nothing like their usually fluffy light ones while the sausage was way overcooked.\n\nTonight I went in and ordered takeout and got creme brulee (I was aware it wouldn't be as good as in the restaurant) but what I received was way over done and not sweet. It was not the right texture at all and rather an egg custard."
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPeF8yRnFnRRAB",
            "text": "La camida es muy buena , excelente presentación!! Pero debo mencionar que el servicio fue muy malo necesitan verdaderos meseros que sepan hacer su trabajo ."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXM3M2elpnEAE",
            "text": "The experience was really nice, the vibe was great and their food was delicious especially Pizza, their personal Pizza. Their cocktails were pretty good and the waitress was really nice to talk to. If in the area I will definitely come back"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPX2FLaEpnEAE",
            "text": "Awesome little treasure of a spot! Food is amazing. Mac and cheese, steak Sammy, steak and chimichurri appetizer, all the desserts….all so good!! Oh!…and the mango margaritas! My new favorite spot when I’m passing through the area. Was there Monday and already going back just 4 days later"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURxMnY3VEZ3EAE",
            "text": "Alexa was our server and she was FANTASTIC. Our party included a 10-month old and this restaurant was very kid-friendly.\n\nWe sat outside, their patio is as roomy and comfortable. The food was delicious and service superb.\n\nThanks, Alexa! Thank you Zona Sur Bar Bistro!"
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURJLXFpcVZnEAE",
            "text": "Amazing!!! The flavors were spot on, pasta was cooked perfect, their deserts were great. Only thing i feel was slacking was the size of the meal.... maybe because in this neighborhood food is usually served slightly bigger but i kept…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURldUsycEJREAE",
            "text": "Very delicious food and great customer service! We got the salmon Benedict and No.1 brunch"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURadnZuWk1BEAE",
            "text": "If you’re in the area this is definitely a go to spot to fill your stomach! I got the penne chicken Alfredo pasta and it was so tasty with the Bread alongside and melted cheese!!! The bartenders were super friendly and the atmosphere is so comforting. I didn’t order any drinks but I seen them make a few and my god they look good and cute! Had a great time 10/10 I live on the same block so I’ll be back!"
        }
    ],
    "reviews_count": 75
}