{
    "name": "Confidant",
    "place_id": "ChIJr9xWar9bwokRP10s3t_iQ3o",
    "grid": "BK7",
    "address": "67 35th St Building #5, Space #05-01-C29, Brooklyn, NY 11232, USA",
    "rating": 4.6,
    "user_ratings_total": 114,
    "phone_number": "(929) 252-0205",
    "reviews": [
        {
            "date": "6일 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOeWJGRnpiMHhCVmtaMVEyOXBXbTV0ZHpsb00yYxAB",
            "text": "We planned on having our team lunch there on Wednesday (10/29). Closed at 12:45. Disappointed.  Fortunately Hometown BBQ is great for a team lunch. The smash burger is excellent. Nice variety of items for the whole party to share."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsSVVERmlNRmhSVm5OU2RWUkVSV0k1T0RKMmRVRRAB",
            "text": "The bread and butte was good, the rest was't. Steak was okay, but the garlic that came with it was 3 days old, the duck most of it was raw, the prawns was the dough was good, the rest is meh. Come here for the appetizers, they were the best of the meal.   Drinks were good and staff as well. Food is trashy. Please upgrade the cooks."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSdkxVRnNVRWhVU0VkYWFrMVBZVFEzWW1ZNU1XYxAB",
            "text": "A vibrant solid upscale culinaryoasis in Industry City"
        },
        {
            "date": "수정일: 2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WVlZqRTJUR2xuUTFwYVJFdFlOVnBwWXpsaWQyYxAB",
            "text": "Amazing meal -- we had the shrimp pot pie, lamb shank, garlic bread, chocolate dessert.\n\nDidn't leave a bite 😋"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGM2NrMWlTRXRaU1Y5bk1YWkNObXREZEZWUlQzYxAB",
            "text": "Cool spot for brunch in Industry City. Both the steak and eggs as well as the pancake were phenomenal and service comes with a smile here. Wish they had more of their dinner options on the brunch menu as well. Would come back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJek5XUnJNbWt0T0MxZlIwZEhhVTV1V2xWV1dGRRAB",
            "text": "Went last Friday for dinner with some friends. Best dirty gin martini I’ve had in a while and the . My definite favorites were the trout mousse and the 25oz steak. Both melted in my mouth that second I took a bite."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psamIwODNXR1ZRVVVOeWNFUTVVMnA2WWtGdk5IYxAB",
            "text": "I really love my experience at Confidant. I originally saw them as the top new restaurant from the Beli app, and this and decided I’d give it a try. I was really impressed with your experimental menu, especially with what was offered at the kitchen counter seating. Aside from the excellent food we had, the service was also excellent. Our weight staff was very attentive and made sure we were enjoying the different course we had. I’ll most definitely be back in the future to try their items that rotate in, as well as enjoy their staples."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWbVRXaEhVMUJhYTJ0c1V6aDFVbDlIYm1GWGJuYxAB",
            "text": "Flavorful and excellent service with a smile!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kwMlRYWnBRMGhaWkdJeFJUUlpVRU00U1U1S1VWRRAB",
            "text": "Amazing unique fun venue. Beautiful French chill atmosphere. Love this restaurant so much and only want good things for it. Had a bit of a Sleep No More vibe as well, like the kind of place they'd create before a show. Love, loved, loved it. Highly recommend shrimp pot pie. They change their menu seasonally with local food."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taR2R6ZFpNemd5U1dOU1JFaEdUVXMwVXpsR2JHYxAB",
            "text": "The snap peas and chicory salads, the red snapper, duck, aged beef, and banana cream pie were all divine. The service and bar program are top-notch."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZOUllZ0F3EAE",
            "text": "Update: I've been for lunch a couple times and I literally can't say enough about the quality of the lunch here. Chicken caesar sandwich, and as of today, the new pastrami Reuben which is not on the menu yet are all completely spectacular.\nGreat new addition to industry city. I'm a regular in the complex and it's nice to have a fancy sit down option. The service was impeccable. The table was wiped down repeatedly during the meal. The food was excellent, particularly the chicken and the house pickled vegetables with the bread. It is of course expensive but not out of league with other restaurants of this caliber. Definitely recommend trying it"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2swd2FFTnFWa1JJWjBsQ2RWcE9la3h2Vm5nMlVrRRAB",
            "text": "Impeccable service and hospitality- honestly 10/10 no notes. The service was on par to some Michelin-level places I’ve been to.\n\nThe space was lovely- def a place you could host a grand gathering. Great details and atmosphere.\n\nFinally the food was delicious. I’d recommend the bread & butter (we got a 2nd it was so good), the kanpachi crudo, and the prawn pot pie. The prawn pot pie changed me. Like- what the hell I am mad at all the other prawns I’ve eaten because they were not in this prawn pot pie.\n\nAlso we got this nectarine black tea dessert that was also like- one of the best desserts I’ve ever had. They have fancy words for what it is but it basically tastes like delicious peach ice cream over a perfect crème brûlée with a black tea icey next to it and it all goes together in this wildly delicious way.\n\nSpecial thanks to the GM, Lucy for the warm hospitality too and answering our nerdy questions about ingredients!! She was lovely!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xTWVIWndVV3MwWVhCTE1HVTBWV3hwVTFGdFVsRRAB",
            "text": "Amazing quality and service start to finish! Will make this a regular stop from now on"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paWE5IUkdNMVpXTFdoT1JqUmlTRmRVYW1kUVRuYxAB",
            "text": "Was so excited about trying this place, but was VERY disappointed in the food. Very overpriced menu and sad and misleading portions, in my opinion. Although, service was amazing, absolute perfection."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvcmZtSzJnRRAB",
            "text": "Another delicious meal at Confidant. They're serving unfussy but interesting brunch dishes. We had the tomato sandwich, the duck hash browns, the cucumber salad, and the Dutch baby.\n\nWe loved dinner here as well. The duck looked amazing and was 😋😋😋.\n\nThe service was much better at dinner than it was at brunch although everyone was very nice.\n\nLooking forward to our next visit."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twQlQxQmxaa3BTU2xwYU5FNXBZMjVhVDJwb1dXYxAB",
            "text": "Sat at the chef’s table - food was perfectly prepared and presented; service was outstanding and the menu choices were innovative and fun.  Excited to make our way thru the menu!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxcmRuaHNOMWhxZUU1SGMyd3dlVVpXTFZwMVpVRRAB",
            "text": "Great food, fair pricing, lovely people, great venue! But waiting 40-50 minutes for your food during lunch time on workdays is not a recipe for success… plan accordingly cause I’ve been there twice and needed a 1h15 break from work. Moreover, the restaurant was almost empty…\nDear owner/manager, please improve that service time cause I’d love to come more regularly for lunch with my colleagues ;-)\n(Experienced July-Aug 2025)"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210VVExcFVjR1Z5VkZFeGNsRTRlRFZKYjNvNVgwRRAB",
            "text": "The vibes are amazing and the food is excellent. Do not skip the prawn pot pie!!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20wM2ExYzRaM1IzV1dWS1VWcDJSMjlsZEV0VWEzYxAB",
            "text": "Such amazing food and service!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kbWMxUnFPRWg2Y0ZFMFpTMTZZblpQVWtaNU1GRRAB",
            "text": "Have dined here now 4 times on dates and with groups of friends. Every time the food has been great and the service has only gotten better and better. Really beautiful plating and fresh and savory dishes. The seasonal cocktails are perfectly balanced- sharp and not sweet. It’s such a large space it’s pretty easy to get a res, but highly recommend requesting the chefs counter."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSSmRGTm9ha1Z4TW5Gc1gzZDZXVXczVFdrd1ZrRRAB",
            "text": "Review is purely a reflection of cost vs. value. Given the premium pricing on the menu, you would expect precise execution, but we saw on the gem salad that the ends of the Romain hearts weren't trimmed off? If a conscious decision, seems odd to leave something inedible in a salad. If an oversight, indicates sloppy QC.\n\nAdditionally for items like the Tuna prosciutto to come with 6 slivers for 19 dollars, without an accompanying piece of bread, felt like a rip off.\n\nFinally the duck feels incredibly overpriced given the volume. Full portion runs $120, but when compared to other restaurants with Duck dishes, say like Cosme that charge 112 for 2x the volume, it seems overpriced.\n\nWant to reiterate that service was excellent, love the look and feel of the restaurant, but in a tough spot like industry city, if the food isnt stellar or feel like a deal, it's hard to justify a return."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWMU5YVmtialJyTFUxclVESjZRbHBLYjI5cE0zYxAB",
            "text": "I've been excited to try Confidant and finally got there for brunch this weekend. I’m so glad I did! The atmosphere was cozy and lively and you can watch the chefs prepare your food from the open kitchen. Everything we had was delicious, but my favorites were the palomas, hot maple beignets, the cucumber and celery salad, and the dutch baby. I can’t wait to get back and try the dinner next time I’m in town."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5U01FWjZXVlZ0ZUc1Q05HUTBXWEpKUVZsUlRWRRAB",
            "text": "Stopped in for brunch and had an amazing meal! The special crossiant of the day was delicious and we loved the dutch baby and cucumber salad. Their paloma was also absolutely perfect. Can't wait to come back for dinner!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1dFptMU1XVE5uTkV4QlFuVlpjSEpyVlZaUVFuYxAB",
            "text": "If I could give an extra star for \"Service,\" I would.\n\nA friendly, attentive staff is ready to serve you thoughtful and tasty dishes in a relaxed atmosphere.\n\nMany reviews will speak of the big hits, such as the trout mousse and the prawn pot pie, which were excellent. However, consider ordering the smoky and creamy Snap Pea and Chevre, or pairing your meal with a bottle of Solidago from Greenpoint Cidery.\n\nThe staff is knowledgeable, passionate and connected every step of the way.\n\nThanks, Confidant. We can't wait for our next meal with you!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oSmMwRTVRM0ZrVTNwSGJqTm5XR0pLWjNBNWJuYxAB",
            "text": "Just had brunch here for my partners birthday, and we are so underwhelmed we don't even know what to say. Other than that! This was a completely underwhelming experience. For some reason we were sat at the chef's counter. I did not request that, but they put us there. I assumed it was because they saw it was a birthday on our reservation and they wanted to give us a little treat. But I have literally never sat at a more boring uneventful chefs counter in my entire life. The chefs were completely disinterested in the fact that we were there. Didn't even say hi to us. And while we can't fault them for the fact that business was slow when we were there, they weren't even cooking anything, so we had nothing to be entertained by. We would have been better off sitting at a table and keeping each others company. The service, while friendly, had zero sense of urgency and just kind of roamed around the dining room, leisurely taking their time to do anything and everything. One specific example: we waited for what can only be described as an unconscionable amount of time for them to bring us water. Again - they were not busy. Over 10 minutes is simply too long to wait for water. And to the important stuff: the food. Mine was better than my partner's, I had the ricotta toast with mushrooms and it was good. Not great.  My partner had the duck hash and it was greasy, difficult to chew, and I didn't realize until after we left, but they did tell me that if they'd felt more comfortable in the environment, they would have sent it back because it just wasn't good. This place does not live up to the hype, sadly. I know that sometimes brunch can be tough on a restaurant, that's usually because of the volume. This was not a volume issue. It was just lackluster vibes, not great food, and really disinterested service. And on top of all that, not that a restaurant owes us this, but I did note in our reservation that it was my partner's birthday, even added an additional note about how special they are and how much we wanted to celebrate, and literally no mention was made of their birthday by anyone. This is not what one would normally expect from a restaurant that touts itself as being fine dining. To quote my partner: we would have had a better time at a food truck."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aclMxVjVZamxaUVdSTFpUVm5OUzFGVjB4VVdIYxAB",
            "text": "direct review from my mom who i enjoyed brunch with today at confidant: “Industry City’s Confidant is confidentially a comfort zone of delicious food, beautiful decor, caring waitstaff and two talented partners on the rise…they got it right…” (she loves her ellipses)"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xcWRYbGxNbVZyVDFGTlRFVmpWRTl3WldOcFUwRRAB",
            "text": "Right off, terrible service. Left abandoned at our table over 20 minutes during brunch when tables were less than half full. Drinks not well mixed and taste nothing like advertised. Ordered ricotta toast. Egg so undercooked it was inedible. And raddicio, radishes, and pickled mushrooms with a soft cheese? Disgusting. This whole concept is not working. 0 stars."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jeldWWXlNbWN5UkZOd1lWSXpYekUxYVRGeFFrRRAB",
            "text": "Madeline was incredibly hospitable and knowledgeable. Every dish was thoughtful, bright, and sophisticated. Can’t wait to come back. Looking forward to trying their brunch menu as well.\n\nPS. Don’t miss the bread and butter"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tZNFVIZzBlREZOYUV0UmIxVmxXWFp6Y2w5NGNtYxAB",
            "text": "Our dinner was an amazing dining experience! From the rotating, unique menu and dishes to the top notch service. This addition to the city’s food scene is a must!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kbVpVWXhWbEZ2VjBGWVpGQkRjVmcyYkY4NFUzYxAB",
            "text": "Loved my experience here. Great wine, great food, great time!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KSE5GWmpSeTFzZHpWSWJuSm9RVGRmTm5sT1pXYxAB",
            "text": "Amazing dinner. Went on a bachelor party and they treated us great. Get the duck and the prawn pot pie."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCSmVHVTNUVVZZZEhRd2R6VTRjMkZWWVdrNFRWRRAB",
            "text": "Really great menus. They recently added a weekend brunch menu -- just as amazing as their dinner menu. I look forward to trying their lunch menu on weekdays."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CbldsUnllRFZ5TmtJeFRGaENNR3RKTmtKVkxWRRAB",
            "text": "Had dinner at Confidant in Industry City and it was incredible. This place just opened and I’m glad we tried it.\n\nThe tuna prosciutto was wild - they cure the fish for months and it actually tastes like prosciutto but still fishy in a good way. Never had anything like it. We also got the little gem salad which was fresh and crunchy, and the crudo had these little orange pieces that were a nice touch.\n\nThe shrimp pot pie was definitely the highlight. Big flaky crust with really good shrimp underneath in this creamy sauce. Felt like fancy comfort food but not pretentious about it.\n\nEverything was well made and wanna you can tell the chefs know what they’re doing. The atmosphere is really cool - it’s in this warehouse space in Industry City that feels modern but not cold. Our server was great, knew the menu well and made good recommendations. Service was on point throughout the meal.\n\nIndustry City needed a good restaurant and this is it. Would definitely go back and recommend to friends. Make a reservation because I think this place is going to get busy."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KV1ZuaFljV293TjNwS1kxZHdkVWgyZDFaaE0zYxAB",
            "text": "Can not recommend enough! The food was delicious, staff was great and the vibe inside is awesome. Very different from your typical NYC restaurant, in all the best ways. Will definitely be coming back."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205Q1FXVkRPVmQ0UWtzMlRtOVlXakZyT1dOTWRtYxAB",
            "text": "Loved our experience here! Unique dishes. Fresh ingredients. Super friendly staff. I LOVED their upside down rhubarb cake OMG"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSMFdEbG5kUzFYT1dkNlVXNWxjR28zYTNGbWNGRRAB",
            "text": "Second time dining, this time for brunch, after dinner when they first opened.  Menu is different than their official website; fewer options and couple of markups.  FOH remains friendly and professional.  French omelette was delicate with a rustic serving of lemon thin mustard greens, marked up ($3 more) duck confit had two high-quality eggs sitting on top of crispy hash (with the duck integrated), and hot maple beignets.  Dinner was the prawn pot pie with a flaky and very buttery crust, monkfish was okay, tuna prosciutto, and tasty Hawaiian kanpachi crudo.  I wish the brunch menu was as imaginative as its dinner counterpart.  We will return."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WTlFsUkNlakZMVkV0eFMwTkVSVWg0Y0VwTVRIYxAB",
            "text": "So much New York and everything that it entities. Excellent food, good service and authentic vibe. For sure worth a visit."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205MVdEUmZiQzE1U0hsTGNsSkJSMHRvUXpsalZuYxAB",
            "text": "I had an incredible dining experience! The ambiance was perfect, and the food was absolutely delicious. It's hard to beat the combination of great prices for such high-quality food. Knowing that the meat is sustainably sourced from End's Meat, a local butcher in Industry city and also Hudson Valley. Being a business owner in Industry CitySo glad this gem opened"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKa1kwNXFka1pEZFY5bk1qRTJhR3BzVlhaTlZXYxAB",
            "text": "Gem of a restaurant. Came here with 3 friends and had an amazing meal. Highlights were the dessert, the ribeye, the prawn pot pie, bread, and sunchoke dish. Cocktails also were excellent.\n\nService was great and the area is spacious which is really nice for nyc. Made the trip from Williamsburg which was worth it. Will be back!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tacVZXMUNhamhRVmpBMVFUVlJOV3BYWDJGb1JYYxAB",
            "text": "An absolutely amazing restaurant, staff was all amazing and food was incredible. Sat at the chefs counter and got to chat with them about the prep, meals, and their experience as chefs. 10/10 would recommend"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOQlQyZzNSekpuZGs1V05WcEROMTlwYWtGd2JXYxAB",
            "text": "The crown of duck was excellent. We made the mistake of ordering two bread courses to start but still found room to finish the duck, it was that good. Good dessert too."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOZlNVcFZPVEZmUkdoM09FSmlPRUY1YzI4NFRVRRAB",
            "text": "My partner and I had really strong hopes about Confidant going in. I want to preface that this is the first time I've EVER left a review of a restaurant, I understand that restaurants have their off days and that impeccable service isn't promised at all times, but it came to the point where the experience at Confidant was so bad that I felt that I needed to write a review in hopes that our experience can help a new BK restaurant continue to improve and offer better service.\n\nWe sat down a few minutes early for an 8pm reservation to what I would say was a not very busy restaurant for a Saturday night. I would guess they were at 50% capacity when we sat down. Our waitress was kind if not a little bit shy at first but we saw no glaring issues. She suggested it was easiest to order everything at once so they could course it out which we happily complied with. After placing our order 15-20 minutes after sitting down, we got our first appetizers around 15 minutes later. After finishing our appetizers, it was another 30 minutes before we received our entree's. Had we ordered these after an appetizer I wouldn't have been annoyed but given we were asked to order up front so they could course it out, we expected that we wouldn't have to wait so long for our food to arrive. By the time the entree's made it to the table, had been an hour and 15 minutes since we had sat down.\n\nOnce the food did arrive, the $70 steak ended up being cooked rare as opposed to medium rare as I ordered. Again, not a huge issue, but after waiting so long for our entree's this was very frustrating. The host (who was wonderful by the way) took it back and it took another 10 minutes or so for it to be brought back out where no one came and told me what was being done to fix it. After it was brought back, I thought it looked a little rare still so I asked the waiter to bring the manager out. The waitress informed me that since the steak was aged it was a little darker in color and I told her that that made sense and that I didn't need the manager any longer.\n\nThe manager still ended up coming around and when asking how everything was, I told her in all honesty that we had been a bit disappointed with how slow the service had been as well as how my meal being cooked incorrectly was handled but still praised them on the fact that we thought the wait staff was very friendly and that the food was good. The manager responded saying that they understood that that could be a \"jarring\" experience for us but made no effort in that moment to apologize in any meaningful way or assure us that they would try to course correct in any way.\n\nFrom that point forward, there was a total shift in the service and our waitress and the manager seemed uninterested in providing us good service anymore. It became difficult to even flag our waitress down for the check and any future interactions were very cold. When we were given the check they told us they had comped the $19 trout mousse appetizer we ordered. In all honesty, I think we were expecting them to comp a little more given how slow the service had been (we'd been there for two hours at this point) and since we had issues with the steak which was a very expensive entree in the first place. As we left the restaurant only a different server (not ours) and the host said goodbye to us while our server and the manager stood in silence and watched us leave.\n\nIt was frustrating to see the staff give up on trying to make the situation better. This doesn't even have to happen with comping items/meals, even just being more attentive or checking up on us more or sending out a dessert or something would have gone a very long way to ensure that guests aren't leaving a $200+ meal very upset like we were.\n\nI'm bummed this restaurant experience didn't pan out like we had hoped and will likely not come back though I do hope that these things are improved upon so that other diners don't have the same experience."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkTldEbHhlV2MwV1RkTWNISXlVVloxZWtGTlpIYxAB",
            "text": "Really amazing new restaurant in Industry City! We sat at the chefs table and it was very cool to see all the food being prepared. Highly recommend the prawn pot pie and the sunchokes. Also really enjoyed the soft shell crab"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kakxUTlRPR1JYTVZWVGJFeGphRUZuYjBoaFFrRRAB",
            "text": "Awesome interior and great food. Sit at the chefs table to watch poetry in motion. I highly recommend the prawn pot pie and the sunchoke."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taSE9HRjRYelJYVm5vMU5FWkJNMmh6YUdGV1MxRRAB",
            "text": "First time here today and it was really great. The service was awesome and the space is beautiful! All the food was delicious but especially the desserts. Shoutout to the talented pastry chef Mariah!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205ME0zbHNka0YyZW5kR1VUVkRXRWRXWkdNdFVuYxAB",
            "text": "Great vibe and music to start\nCreative drinks\nFood was excellent. Open kitchen was great to watch. Simply delicious"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KcVFtaFRiVFpZVTNscVRsbDJSM0Z5ZG5wcGJtYxAB",
            "text": "Confidant NYC completely blew me away. Every part of the experience—from the food to the service to the atmosphere—was exceptional. The menu is inventive without being overcomplicated, with every dish hitting the mark in terms of flavor, presentation, and balance. The cocktails were just as impressive—unique, well-crafted, and perfectly matched to the food.\n\nThe space is beautiful and welcoming, with a cool, laid-back energy that still feels polished. The staff was warm, knowledgeable, and made the whole night feel seamless.\n\nIf you’re looking for somewhere that feels special but still comfortable, where the food and drinks are worth talking about—go to Confidant. Can’t recommend it highly enough."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oSE9GTkZUVzFZY2pGbFVXZG5ZblZOVTI1VVdsRRAB",
            "text": "Service was incredibly slow and inattentive even though the restaurant wasn’t even full. Food was mediocre at best, the prawn pot pie was so heavy that a few bites of the dish is enough to overwhelm your palate. If you’re looking to have a good evening, I’ll strongly recommend looking elsewhere."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pJNFUweDFPR1ZGTVhoRmNuaFZTVmhhYWxFMmJtYxAB",
            "text": "Came here for brunch.   Everything was on point.  I would definitely come back, which is high praise for me..."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOVzNodUxBOEpMT21RRRAB",
            "text": "Wonderful restaurant. Worth the trip from NYC. Loved the Duck!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VLeXV2S0x0LXR2Z1pBEAE",
            "text": "Let me first start off by saying that the service was impeccable. Our waitress, Madeline, was so friendly, warm, kind, and extremely welcoming, which definitely enhanced our overall dining experience. Matter of fact, almost all the staff we encountered were welcoming and warm, where even the owner went around to help out which definitely sets a beautiful example of what exemplary service looks like. The ambiance and service were both elegant and reflective of what fine dining should look like! Hence, perfect score for both!\n\nUnfortunately the food was what detracted from the 5* experience and left a lot to be desired. Let's start with the good, the prawn pot pie. The broth was so incredibly rich and infused with such a deep prawn flavor, that it was better than any other shrimp/lobster based broth I ever had. The crust was crispy, fluffy, and provided a buttery profile that further amplified the creaminess of the prawn broth! By far one of the best pot pie I ever had and I promise you won't regret it! My only minor critique was that the amount of prawn in the pot pie were minimal, and since they were cut into tiny pieces, they appeared even more sparse and didn't provide too much of a textured bite. A bit more prawn or bigger cuts of prawn can definitely elevate the dish to perfection!\n\nNow onto the dishes that I know Confidant can definitely improve and perfect:\n\nThe butter that came with the bread was extremely salty, which Madeline was kind enough to remedy by replacing the butter. The bread had a nice soft interior and crispy/hard exterior, but was decent overall. Personally, I felt the price tag for the bread was a bit high, but to each their own.\n\nThe trout mousse was also salty as well unfortunately. The texture was great paired with salmon roe and the bread, but the saltiness definitely made it less enjoyable for all of us. This aligned with some of the other diners who also found their seasoning to be a bit heavy handed.\n\nNow the star of the show, the crown of duck. The duck was perfectly cooked medium rare and was extremely tender, which was great! Each piece had just the right amount of fat and the sauce that accompanied it provided a sweet and savory balance! Personally, I think if they're able to crisp up the skin some more then it would have been perfect! Unfortunately the duck leg confit and parsnip accompaniment were, once again, extremely salty. We tried pairing it with the duck slices but it just overpowered it completely. The staff empathized with our honesty and said they would inform the chef, which we appreciated. It was just so unfortunate that the star of the show, which had so much potential, ultimately provided a lackluster performance.\n\nI honestly believe Confidant is one of the highest potential newcomer in most of Brooklyn, especially around Industry city. Their exemplary service and beautiful aesthetics is reflective of what true fine dining looks like and they are so very close to perfection. Unfortunately for us, 3 out of the 4 dishes we ordered were overly salty and mediocre, with much room for improvement. I know it's hard to cater to each diners' individual preferences, but under-seasoned can be an easier fix than over-seasoned. I have high hopes for Confidant and I really want to see them show their full potential and truly shine as one of the better, if not best, fine dining restaurant in this entire area of Brooklyn, so I hope my review can help them elevate their dishes and bring them closer to the perfection I know they're extremely capable of. Overall, a 3.5/5 stars\n\nDefinitely worth giving them a try, and if you do, definitely get the prawn pot pie!\n\nThank you for reading and best of luck! (:\n\nP.S. We were also accidentally charged a different table's bill that was a few hundred more than ours, so be diligent and remember to check your final bill after they charge your card!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJVGsyLUNZa0lPQVJREAE",
            "text": "Had been here for dinner before (amazing) but tried for brunch today and it was phenomenal!!\nRecommend ordering a ton and sharing it all.\n\nMust orders: beignets (omg they were insane - pro tip, keep the sauce they come with for the pancake), pancake, ricotta toast, fries and the banana cream pie (!!!)\n\nIndoor and outdoor seating"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VMR1ZndnlfekxuN1lREAE",
            "text": "Food was OK. My favorite was probably the trout mousse. However, the soft shelled crab and New York strip were left to be desired. Maybe we didn’t order the right things? There was an option of the entire duck or ribeye but we were only two people and those were of a much larger portion. Service was slow."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJNktuOWp4OThIWElREAE",
            "text": "Incredible food and most importantly, BEST PANCAKES EVER. This place is still new so I hope word spreads but every seat should be filled for Sunday brunch. We’ll def return to try the dinner menu as everything was fantastic."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJcW96X3ZBRRAB",
            "text": "You walk in and feel right at home. Loved the living room to relax before or after dinner. The open kitchen concept was a fun experience. Just watching the two Chefs and their staff working in a very busy environment is mesmerizing! How do I try to explain how incredibly  fabulous the food is to eat?  The fresh butter is unlike anything I have ever tried. The potato and apple salad was also a favorite. I have NEVER been a duck lover. Well, their duck melted in my mouth. The Prawn Pot Pie was my favorite. I could go on and on about the food. The service was just great. And the Chefs actually leave the kitchen to check on you! I will be back many times. Can’t wait for lunch and brunch!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZLWFITlV3EAE",
            "text": "Came here this past weekend and WOW was I impressed. Between the open kitchen, the top notch food with savory tastes, the staff who was super friendly, this was such a fun place to visit. The owners even came to our table to introduce themselves!!\n\nThe Prawn Pot Pie was a hit at our table and I’m still dreaming of the Malted Mille-Feuille dessert. Legit, the dessert for our table was gone in 2 mins so that's when you know it's good ;).\n\nLooking forward to coming back and trying more items on the menu! This place is going to go far. See you soon"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQM2s2THZBak91a2ZREAE",
            "text": "1st time there. The food was incredible. So flavorful and fresh. Our waitress Madeline was amazing as well as the rest of the staff. Just an absolutely wonderful experience."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3aGVEbkx3EAE",
            "text": "I got to eat at Confidant before they officially opened. The food was amazing! Highly recommend the sunchokes, little gem salad, prawn pot pie, and rhubarb cake. We drove and the parking under the bridge was super cheap and easy (I think $1.50/hr)."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvcHZiZnFRRRAB",
            "text": "Service was excellent and the atmosphere was nice. Food is served family style which wasn’t a big hit with our group but it was presented nicely. Good fancy date spot. Make reservations this place was crowded even on a Wednesday."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3aUxtY3J3RRAB",
            "text": "Service was great, food was phenomenal. Standouts were the prawn potpie and the rhubarb dessert with the olive oil whipped cream. The martini also had something extra nice going for it. Really excited for there to finally be a full service restaurant available in industry city!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNNjctcHJpanVUOVF3EAE",
            "text": "Amazing experience! the trout mousse was so unique and delicious - a must try.  the crown of duck was one of the best duck dishes i ever had. the prawn pot pie was also phenomenal.  the waitress was attentive and always quick to ask if we needed another drink.  our table was in the middle of the room and had a great line of sight into the kitchen area.   luckily i work next door and looking forward to going back to try everything else i didnt have room for the first time around."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvclBmekVnEAE",
            "text": "I came in solo about two weeks ago, excited to try this new fine-dining spot—especially since I live just up the block from Industry City. The ambiance was great, and I really appreciated the old-school '90s music playing, which is rare in a fine dining setting. It immediately gave the space a unique and welcoming vibe.\n\nThe temperature inside was quite warm, even with my coat off. I mentioned it to the manager, and to their credit, they adjusted it right away— A great response.\n\nAs for the menu, I do recommend that some of the appetizers be paired with bread. Without it, they felt slightly underwhelming. For my main, I ordered the little gem salad and a medium steak. The salad came out about 25 minutes before the steak, which wasn’t ideal timing. When the steak did arrive, it was lukewarm—the butter on top didn’t melt at all.\n\nI politely asked the server if anything could be done. The steak was taken back, but when it returned, it was overcooked— over well done, not medium—and lacked the butter and delicious soft roasted garlic that came with it originally. The edges were crisp, and the texture was very chewy. I was disappointed. I never meant for the steak to be recooked beyond what I ordered, just properly heated.\n\nMaybe there was a miscommunication, but for the price point, I wouldn’t expect a dish like that to leave the kitchen. As someone with hospitality experience myself, I would never serve a steak in that condition, especially after a guest expressed concern."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvb1pTdkl3EAE",
            "text": "Confidant is an amazing new restaurant in Industry City in Brooklyn.  The food was spectacular!  I had the in house made sourdough bread and butter, little gem salad,  grilled sun choke, potato and apple salad, the NY strip steak, then the rhubarb cake AND the biscotti tortoni.  Everything was superb and I cannot wait to go back to try more of the innovative items on the menu.  The space is warm and inviting with a lounge area with leather couch and seating.  It's hard to believe this was a former pickling factory.  Service was excellent.  Sitting at the Chef's Counter was fun, watching the two chefs work their magic.  I look very forward to their new lunch introduction in May and especially to the brunch on weekends which will start after Mother's Day weekend!  The chefs Kelley and Grossman should be proud of their endeavors, they have really created an ambitious, wonderful restaurant!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJZWxvZVNBbU0zcDB3RRAB",
            "text": "I've been hearing about Confidant from all of my friends and have been wanting to go since its opening a few months ago. I finally went on Sunday and it lived up to the hype. My favorite items on the menu are the sunchokes with a light ~hollandaise sauce and the prawn pot pie. I'm obsessed with sunchokes now and will definitely get it the next time I go. We also loved the duck and chicken. Shout out to the pastry chef as well, who make incredible bread and delicious desserts. Confidant is definitely worth the trip out to Industry City."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJNy1XY25nRRAB",
            "text": "Nice experience, wonderful ambiance with equally delicious food. The prawn pot pie will keep me coming back!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJaWJPZm13RRAB",
            "text": "Excellent dinner. Really good service, ok wine. Those new wines chilled, fresh, etc.  that lately restaurants feature proudly most of the time are not up to par. Food is truly delicious, prices are more than fare, the menu is very creative. We had 5 dishes for two of us and it was perfect.\nThank you guys."
        }
    ],
    "reviews_count": 66
}