{
    "name": "Parlay",
    "place_id": "ChIJ-fScHM9awokRQQEHMNgrJYg",
    "grid": "BK7",
    "address": "4024 8th Ave, Brooklyn, NY 11232, USA",
    "rating": 4.4,
    "user_ratings_total": 671,
    "phone_number": "(347) 987-4059",
    "reviews": [
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aMFUyMDJVVlZHV0ZRd05HZ3hiMUZHZW1abmFWRRAB",
            "text": "Best burgers in the neighborhood. Solid every time."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jMWFsbG1PV00wWm5Wbk56aEtWVTVXWW05dVZrRRAB",
            "text": "Everytime I come here I go for the Coconut curry with Roti and it’s ALWAYS amazing …… I wish I could give 10 stars & It was my first time trying the chicken sandwich and when I tell you the meat itself was so nice and seasoned they blow my mind EVERYTIME 🙏🏾"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25selNsQjVSbkJXV0ZoYVJDMVBjMDAyU20xWUxVRRAB",
            "text": "My favorite place close to home.  My go to’s are caramel lattes (ice/hot) daily!  The home made dessert by Arlene are killer.  The food is flavorful and reasonably priced along with a wide variety of offerings.  I’m loving the new savory dishes that have been added to lunch and dinner.  The staff is always friendly, knows your name and are very accommodating!"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ZdFJqRlViSEF0Y2xGSWRUTm9iRzVrVjBrd2MzYxAB",
            "text": "Terrible service, food is OK. Very noisy and loud atmosphere. Every single time I have been there, they have messed up my orders (forgot one order or mistakenly canceled) it. This happened  4 times in a row.\nCustomers inside the restaurant are very loud and noisy with no regard for other customers. Maybe the place could provide a peaceful environment for all customers by putting up some signs to encourage the customers to be mindful of each other in terms of noise and having very loud conversations.\nAlso, surprisingly this place does not have plain Croissants. They have chocolate but not plain croissants."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSTFFubzVNWHBuU1dRMU1HMUxTMTlmWVVKWGFuYxAB",
            "text": "Simply delicious"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21NdGNFZFlPRm8xUXpWRWFsWXpXR2hDZG1kalEzYxAB",
            "text": "Great find in Sunset Park and highly recommend for a quick bite or brunch. There is seating outside and limited seats inside. The music was great and at a comfortable level. The staff was attentive and service was wonderful. As an appetizer we ordered the mozzarella sticks and WOW!! They were huge and cheesy and delicious. The food was excellent and cannot wait to return to try other items on the menu!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5SE1XTTROV3BLYkhKWlRWSTVVREIwV1ZkVVYyYxAB",
            "text": "I had a stomachache after eating what was inside, and my service attitude was too poor. I didn't see a smiling face since I entered the door.nanchi cao  taiduchadeyaosi huaiyimeinan duinandexiaoxixi"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCTFkxTlJaWGhYTTJWdkxXUkJUVVp4YVRWSlpHYxAB",
            "text": "Chicken curry is amazing! But the service is exceptional!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GVWNsOW9kRkZEUVUxaGRuaGZWekpyWVdzMWFXYxAB",
            "text": "Great service!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5TFNqWndORkl0V0RSS2JtZEhhWGxJTTBKa2ExRRAB",
            "text": "This place offers good dishes. I sense this is a family business with kind service. I thoroughly enjoyed every aspect of this place! Satisfying cuisine with professional assistance. I found this inviting place through digital platforms."
        },
        {
            "date": "3달 전",
            "language": "fr",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCUGIwSldSR2w0TTJOSFFXeHpibWR2VkhGV2FVRRAB",
            "text": "Bien"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSVVYxcFBUVXcyVmtkeFQwaFROREZvVEVSRldrRRAB",
            "text": "Wish I can keep supporting local business .. I’ve been having my cheeseburger deluxe from the original owners of Parley  since they first opened .   Today, my husband and I decided to go and order a Cheeseburger deluxe meal.   The packaging , the store everything was the same… When he got home, I noticed that the fries were not the original fries that we have bought before.\n\nThey did not look fresh.  I mean, freshly made.  The cheeseburger was OK, but cannot compare to the original owners style .\n\nI called the store and the girl seemed like she really care less.  She did confirm that there was a  change owner’s eight months ago .  She said fries are “ cut “ in the morning .    Truly fries looked like they were sitting there and drenched in oil .\n\nUnfortunately, we lost the original owners 😕.   Lesson learned .\nNever again ."
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toMmVsSlJjbXczZDJVNGNXVkhNVmhqU2twUk9FRRAB",
            "text": "Un bonito lugar en el barrio, un servicio mejorable y la comida podría ser mucho mejor."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWWGVsWTNNM3BDYkc5clZYZHhSSEpGVGxSa1VuYxAB",
            "text": "Mimosas are to die for 😮‍💨😮‍💨 super refreshing!! Highly recommend the hibiscus and lemonade flavor."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPbmh1ckNvb1AtS21nRRAB",
            "text": "Simple. And I mean simple as a complement. A new neighborhood spot with delicious burgers, tuna melt, French toast, and chicken parm sandwich. We’ve tried all of those. Prices are very reasonable. The space is comfortable and the service is accommodating. Check out this great new neighborhood spot for your next casual meal."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VMQ3ktb25ack02WmdBRRAB",
            "text": "Very cute, clean place to grab a coffee or a quick bite. The staff was very polite! We go the BLT with chicken (an add on) and the Thai fried rice. I enjoyed the food just I wouldn’t order the rice again, it was a bit salty for me but the sandwich was perfect!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xjM1pFa3hkMEphYTJ3d2VIRkJOalpMV2pFNVZXYxAB",
            "text": "The server has a nasty attitude towards us. We understand it was a busy brunch on Sundays. But she had no right to give us that type of attitude, when we did not even do anything to her. My partner asked what’s included in the fried rice, and she mentioned “ it’s just fried rice.” ( with an attitude and look on her face).\nI had also worked in a service industry before. We were trained to not show attitude toward the customers, no matter how busy the store is or how tired you are. Mind you, it was only around 11:30 AM. This cafe open at 9 AM. She literally just started her shift. Even if she was frustrated with her own problems, she still has no right to give us that nasty attitude. Leave your own personal problems aside when you start clocking in. No need to lash out onto other people, especially towards the customers. She is just starting the business overall."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VNN19wdnlQbnNMN09BEAE",
            "text": "Genuinely so disappointed with the experience here. This used to be a lowkey spot that locals visited because of the friendly staff as well as amazing food. Now because of the changed management, the food quality has gone down as well as the service. I dined in twice since management changed and that will be the last time dining in. Starting off, me and my partner arrived and asked to sit, the white female server asked us to sit at a small cramped table, and when I requested to sit at a more roomier table, she told us we would have to move if a bigger party arrived? That simply makes no sense considering two (tables that could seat 3-6 people) tables occupied only a singular individual as well as a table that could sit 2 and 3 people were available. To clarify, there was a table (that could seat 3-6) that had only one person sitting there in addition to two free tables (that could seat 3 individuals). The staff later rolled their eyes when we requested for oatmilk in our iced coffee even though we had ordered it as soon as we sat down. The same woman who told us we couldn’t sit at a more comfortable table looked annoyed whenever we requested napkins, ice, syrup, etc. This has honestly been the worst service I’ve received in the food industry (as someone who works in it as well), which led us to tip below 10%. Worst experience ever."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VKcjFyWUNfckozYlB3EAE",
            "text": "Had some great brunch here a few years ago."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VNS3BvLTdNa0ppNW53RRAB",
            "text": "Not the same since it is under new ownership. The quality of the food has definitely been impacted. Frozen burger patties now and the vibe is just not the same"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJX3BfZWVCa3ZlOGlRRRAB",
            "text": "“No laptops please” no wonder it’s so empty all the time"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3dnJpMkdBEAE",
            "text": "wanting to try this spot because it got roti canai & curry which feels hard to find good malay food in BK but damn. it’s $18 for a plate of curry and just roti??? and then $22 for the delivery price. that’s robbery.\n\nedit. was able to swing by and try their chicken sandwich. wasn’t too shabby. but the prices here are similar to some places in Manhattan and Williamsburg. i read the owners have changed, so probably the prices surged as well. this is pricey for sunset park area"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQNnJrNFc4Z3ZMMm53RRAB",
            "text": "This place is wonderful. Good food, excellent service. Owner is very friendly and accommodating. Food will not dissapoint!\nWe especially like the “no laptop” policy. This makes it easy to get a table quickly.\nWe have been coming here since they opened and will definitely keep supporting this small business!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPT2hpNWZfMHNUeTZ3RRAB",
            "text": "Though the food is a bit pricey, it tasted pretty good! We ordered mozzarella sticks and mushroom and onion omelettes with home fries, and we absolutely loved it. Mother keeps raving about the eggs benedict served here, and my brother loves and always orders curry with chicken from this place. The service was nice and friendly as always, and the atmosphere was cozy and wonderful."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvbGVyRk5REAE",
            "text": "Some guy who might be the owner here said no laptop or iPad as soon as I took out my laptop. I was getting ready to order a whole meal and take a meeting at the same time before he said this. If this is the policy they should make this clear on their website, storefront, and on the Google webpage. If spending too much time is a concern they should place a seat time limit. I walked all this way to get told this and have to leave. Would never come back.\n\nEdit: Look at how this establishment responds to people who were dissatisfied. What a miserable man."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMeTg4Y0RCbHAtQlFnEAE",
            "text": "Love this place! The food is so good and affordable! And it’s such a cute spot! Definitely coming back!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvbkxQMENnEAE",
            "text": "chill neighborhood brunch spot, great coffee , food is average"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvazgtUW9nRRAB",
            "text": "We are tourists from switzerland and came to NY for 2 1/2 weeks. One morning we were too late for breakfast in our Hotel and searched up a place to eat brunch. As we came there, it looked very beautiful from both outside and inside. The service was very kind and we had the eggs royale, the bacon egg and cheese, banana pancakes and the mozzarella sticks. Everything was DELICIOUS and we are coming back FOR SURE and try everything else on the menu. It was worth every cent."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJdTlmbE5BEAE",
            "text": "Wow yum, the pancakes were so good and I don’t even like pancakes like that normally! Staff was kind !! Thai sausage plate rocked my world"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3ay02REdBEAE",
            "text": "Hidden gem near Maimonides hospital in Brooklyn with a Noho vibe. I ordered the Salmon. Cooked to perfection with nice crispy skin! Decadent creamy mashed potatoes with gooey cheese and asparagus. Nice drinks and friendly atmosphere. The chef/ owner was very attentive. Definitely stop by if you’re in the neighborhood."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3a0tyQjJnRRAB",
            "text": "DELICIOUS FOOD ! I ordered the salmon garlic plate and omg soooo good! My son has the hand cut fries which was super fresh and also ordered the fried chicken…. The chicken was a little over seasoned for us. We also ordered a fruit salad. I will definitely come back !"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3aVllOVVBEAE",
            "text": "Gtrst place in Sunset Park"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3cG9LUkt3EAE",
            "text": "Get the curry!"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMybUpYRElBEAE",
            "text": "Good quality food ,cheap and delicious Coffee"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRN1BUMTNnRRAB",
            "text": "What on Earth! Emma and I were starving so we jumped in the car for a Sunday brunch and went to Parlay in the middle of Boro Park of all places. Charming corner bistro, cafe seating, warm sunlight, crazy good coffees. We started with the Fried Oyster Mushroom Snack, a tempura treat with unbelievably good siracha aioli. Emma had an amazing sandwich extraordinaire - grilled cheese with siracha jam, avocado and a fried egg. I had the fried chicken sandwich with wasabi aioli and side salad - TO DIE FOR!!  We were happy and stuffed but we had to try the Dominican guava cake with white icing to go… well, we are dying and going to cake heaven. I have a o applaud, but also don’t want this place overrun next I come… a line around the block ain’t no fun!  Bravo! Best Foodie experience this visit to NY."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnbjREeVV3EAE",
            "text": "Parlay is amazing especially since the new owners/management took over. Food, and drink quality is still as good, but the staff attitude changed for the better makes you feel welcomed."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBMW96WmNnEAE",
            "text": "The place starting off good because our waiter was kind and on the task and the food was delicious but after our waiter left and another took over it all went downhill, she was very rude with how she just grabbed our good and forcefully moved us to another table for another family before we could even blink and when the other family tried to apologizefor the inconvenience the waitress snarked \"it's ok\" while continuing to grab oir plates and move us. She acted as if she could not see us when we tried to wave her down for our bill and her attitude wasn't very pleasant either so Needless to say if you are of darker skin toned DO NOT come here!"
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1dUluQU9BEAE",
            "text": "This place is a gem in the wall! The atmosphere and space are so cute and the staff are super nice and friendly. The food was delicious and really fresh tasting! Got the Egg BLT and a lemonade 😋 this place is a must visit when you're in the area!\n\n**Update** they got a new owner, and the menu has gotten bigger, but the food is still as tasty. The steak is very dry tho"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfblBmaU5BEAE",
            "text": "Our second time here and it’s absolutely wonderful. The food , the service and the cozy environment makes my wife & I want to stop here every time ..over our other usual spots. Definitely recommend."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmdlB5Z3VBRRAB",
            "text": "Exceptional curry and roti! Worth traveling for. The curry has a nice warming spice, perfectly cooked chicken, and pairs so well with the fluffy and hot roti. The restaurant itself is cute, and has a good amount of seating. The coffee is good and the chrysanthemum honey tea was delicious. Go here!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmaGFIOF9BRRAB",
            "text": "very nice and bougie place to hang out, the price for the malaysian curry was kind of a lot. the other options were good, the staff were nice but their system of ordering was a bit strange since you had to go up to order but they bought the food to you so these kinds of places confuse me in terms of tipping. otherwise, good place with good food"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2djZmQlpREAE",
            "text": "An absolute gem! Their coffee is rich and perfectly brewed, the service is impressively fast, and the staff goes above and beyond to make you feel truly special. A warm, welcoming spot that’s as much about the experience as it is about the food."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2NnU2NWl3RRAB",
            "text": "I waited more than 25 minutes for an order of pancakes, when I asked the server she never entered my order in their POS and instead of apologizing she started arguing with me telling me that they didn’t order any food, when obviously I ordered my food and coffee at the same time \"so I only got my coffee.\" This happens because they are clearly on the phone and not looking at the customer in order to provide better service. New employees, bad service.\nIt’s been more than 6 years for my grab and go coffee but this is absolutely a bad experience."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2MTVyamV3EAE",
            "text": "Had a great time getting brunch at Parlay, not too busy on Saturday afternoon. We got the Malaysian curry which was delicious with very strong flavor and spice. I’m glad they give two pieces of roti, feels worth the price. I also got the French toast which was so good, glad to have a reliable brunch spot like this in the neighborhood!"
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3bWFEc0lREAE",
            "text": "Love all the food on the menu. The best burger and fries, the best chicken curry. Something for everyone at cheap prices. Breakfast is great too. Staff makes you feel so welcome. Dont forget - Cash only!\nUpdate- as of nov, they now accepts credit cards and Apple Pay"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQZ29xbTNRRRAB",
            "text": "Old ownership is what made this place special, welcoming, and warm. New ownership has diluted the energy and the coffee. Go to Liebre or Internet coffee. Final note: No longer lgbT friendly."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzM1kzTnFRRRAB",
            "text": "Outstanding"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzM2F1TWpBRRAB",
            "text": "Excellent breakfast. Excellent coffee. Excellent experience."
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWcDdfOW5RRRAB",
            "text": "We keep coming back for the yums!!!!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzeGFMQmRBEAE",
            "text": "Food was great, and our server was very charismatic. One of the ladies behind the counter put a very sour face and responded to us with an attitude because my mother who’s diabetic asked for sugar on the side, she’d like to put her sugar herself. They didn’t have any individual sugar at the time so they gave her a bit of sugar on the side which worked great! I think because of that request the lady with glasses caught an attitude, after spending over $100 in this cafe.\nLady with glasses, Ima give you heads up if you don’t like to work with people you’re in the wrong business or stay in the back! Your face tells customers to stay away, greet your customers and smile and go that extra mile so customers want to come back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzdXFMSWZnEAE",
            "text": "The atmosphere of this restaurant is warming. Especially the food was delicious. Came with my girlfriend and we loved Parlay just before walking in. The glass is clear and can easily be seen a block away. The seating was comfortable. We both ordered omelet and caramel lattes. The new owner is very respectful and brings joy into having a conversation with. the waiter was very nice. Overall if I could give a 100 star  I most definitely  would. Most definitely will be back soon again."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6cVpIWGx3RRAB",
            "text": "Love the food here (but it’s cash only!!) The place is a little small so it’s probably not ideal for a big group but ideal for a brunch or afternoon snack. Fried chicken sandwich is my favorite but the Benedict’s are good too! Would recommend to everyone!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlLThHRldnEAE",
            "text": "This is literally one of the cutest and most underrated cafes I have ever been to. Just walking in made me feel so at peace. My friends and I came here for brunch and our expectations were met. The cafe was nice and clean, staff members were super nice, and the food was great. I really recommend their iced caramel latte. It’s cheaper and tastes better than Starbucks. We also didn’t wait long for our food to come. We spent around $15 per person which I find pretty normal for a meal when living in NYC. Overall, our experience here was a 10/10. The only thing that bothered us was 2 flies flying behind us near the window but of course, that is not the cafe’s fault haha"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtdm9LclFREAE",
            "text": "First off I just want to say this place is an absolute gem! The prices are unmatched and quality and presentation is surreal. I think I’ve tried everything on the menu and haven’t been disappointed. If you are unsure of what to get, mama’s…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUemJ6MXd3RRAB",
            "text": "Cute little gem on 8th Ave. I’ve personally been here before but never came for breakfast or brunch. The cheeseburger and fries are amazingggg 👌🏼. This time we went for some brunch and it did not disappoint. Service is always fast and friendly & you get good portions for the price."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwaExyYjV3RRAB",
            "text": "Place is cute. Not bad to chill out with friends for brunch. Food price is average but I think the coffee and expresso are overcharged. Customer service is good but definitely can do better. Overall the food are okay. Doesn't hurt to try."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBX2ZPU3BRRRAB",
            "text": "Great place for a quick and simple brunch! Everything we ordered was delicious. Made with fresh ingredients. Service was quick, friendly, and accommodating.  Interior is bright and airy. We had a large party of 8, and they happened to be able to accommodate us, but seating is somewhat limited. Dine outside of normal meal times to ensure you can dine in. However, they look like they do a significant amount of carry-out business, as well.\n\nThis place is kid friendly. The three picky 4-year-olds we went with did not fuss at eating the food, so they enjoyed it, as well.\n\nOverall, everyone said we would return to try other dishes."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIbHZ6ckdREAE",
            "text": "I want to like this joint—cute vibes, popular with the locals—but their coffee is a disappointment. Ordered a cortado w/soy. Was too hot, milk was overheated and foam was bubbly and loose. Espresso tasted burnt. Server had it remade but I hardly tasted a difference. I wish I could remember what I thought the first time I went there to compare on the off chance I just had an inexperienced barista. I must not have had a bad experience if I came back. Looking at other Google reviews, it looks like maybe there are baristas who can make better drinks and I got a lousy deal.\n\nNo vegan options."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPd0tiX2lnRRAB",
            "text": "It is a good place to relax and have a afternoon tea time with friends. I really like their hamburger, but I didn't take pictures of it. Their French toast is good and the drinks are great too. I like that they have bathroom and nice…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNM3BlNXFnRRAB",
            "text": "Cute little brunch spot. They don't have alot of tables but the wait is not bad. We went on a Sunday morning and the wait was less than 20 minutes. Service and Food was excellent. Can't complain. I wanted to try everything on the menu, must…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1bHUyTFVBEAE",
            "text": "Stumbled upon this little corner gem of a cafe.  The drip coffee was good, but the black sesame latte is the special to order!  I ordered the bacon, runny egg and cheese with arugula.  It was served on a twist bun.  It didn't disappoint in terms of size and price!  The cafe has both inside and outdoor seating. The bathroom was clean. Friendly reminder that it is cash only and there's no ATM."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxLWQ2aDVnRRAB",
            "text": "Fantastic experience. Delicious Food.\nWe had the BEC, and French Toast and the drinks were fabulous. Love the cute atmosphere. Feels like a coffee shop but more. Will definitely return."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3ejVXbmZREAE",
            "text": "It’s a nice spot in sunset park for brunch. Prices are reasonable and portion is good.  Would return to try their Malaysian dishes too."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREbThXbTFBRRAB",
            "text": "Good cafe in the neighborhood. Went here twice and tried the pulled pork bun and egg benedict. Food and drinks were decent for the price. Overall a chill place to get brunch in the neighborhood on a weekend."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMwbE9TQkt3EAE",
            "text": "Cappuccino is amazing here! Super strong and great presentation. We waited a few minutes for a table. Beware, this place is small, only about 5 tables, but you can eat at the bar as well. It's also cash only. There's an ATM a block away with a 99 cent fee, or a $1.25 fee inside this restaurant. They sell brunch and breakfast items all day! Every item is under $10 which is really nice. My boyfriend ordered the Eggs Benedict with smoked salmon and he loved it. We both ordered grilled cheese with tomato and avocado. It was perfect the way the bread was crispy but not burnt and not too greasy either. I also ordered the cheeseburger with spicy hand cut fries. What a great spot. Very small, comforting, local feel with more of an artsy feel. Highly recommend and would come back next time in Sunset Park."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyMzRQX25RRRAB",
            "text": "An absolute oasis. Great food, fantastic atmosphere, really cool events! If you're in the area, stop by and get those spicy fries...omg so good."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURza09qbGdRRRAB",
            "text": "Great service and delicious food. I love their fried chicken (thighs) sandwich with honey wasabi aioli. Served on a brioche bun of course. Their sweetened iced tea is good... Not too sweet. My son loved their hibiscus lemonade which was very sweet"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNycF9pUHlRRRAB",
            "text": "Parlay Coffee Shop Review: A Gem in Sunset Park, Brooklyn\n\n⭐⭐⭐⭐⭐\n\nIf you're ever in Sunset Park, Brooklyn, you absolutely have to visit Parlay Coffee Shop! This place has quickly become my go-to neighborhood spot for breakfast, lunch, and dinner. The food is always fresh and delicious, and the service is nothing short of amazing.\n\nThe family atmosphere at Parlay is incredibly inviting and makes every visit feel like a warm hug. The menu is packed with a variety of must-try items, but two of my absolute favorites are Mom's Curry and the burger. The curry has this perfect blend of spices that feels like a homemade meal, and the burger is just the right mix of juicy and flavorful.\n\nNot to mention, their breakfast options are the best way to start the day, and you can't go wrong with anything on their menu for lunch or dinner. The only downside? They’re closed on Tuesdays, so plan accordingly!\n\nAll in all, Parlay Coffee Shop is a gem in Sunset Park that you don't want to miss. Whether you're looking for a quick bite or a leisurely meal, this spot has you covered."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2c2JlTy13RRAB",
            "text": "Favorite weekend lunch spot in the city! Get the curry! Curry and pancakes are a common combo for us but the burger is also great, plus the fries are great to dip in the curry! Their café drinks are all great, sweet vibes and music inside and nice patio seating outside for when the weathers nice."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMweDlHZFJnEAE",
            "text": "Nice and cozy brunch spot. Ambience is cute. Nice music, and chill vibes. The food here is great. Nice selection of IPAs & homemade/seasonal drinks. If you like a sour lemonade try the Hibiscus Lemonade! I love it. The fried chicken sandwich is delicious & a huge portion. The wasabi sauce is a nice kick at the end of the bite. However, I'd definitely ask them to put a little less of it. It kind of gets too intense as you eat. The fries were crisp and delicious. The eggs Florentine was delicious! Amazing hollandaise sauce and tasty home fries! Eggs were made beautifully. Now, for my own fish. The Sriracha Jam Grilled Cheese *yum* it's the most unexpected jam but it works so well with the richness of the Mozzarella and Munster Cheese on the sourdough bread. I can't wait to go back & try their Brisket Sandwich & Malaysian Curry!\nParking around here is decent."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlcF9fLUd3EAE",
            "text": "I had Egg Benedict here before Covid but now they don’t offer anymore which is sad to me .\nTheir Malaysia curry chicken absolutely amazing.…"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBX3JxUjhRRRAB",
            "text": "Everything is a 5/5! The food, the customer service, and most importantly the FREEE wifi 😱 I came here twice and it never disappoints me. I ordered the pull pork burger and it's super delicious - very juicy and tender. The second best dish is the spicy hand cut fries with sirarcha mayo - VERYYYY GOOD (highly recommended)!!! The Eggs Royale Benedict is very good as well! Honestly I feel like everything on this menu is probably really good!\n\nOh this place is very affordable too 👍🏻"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM2dm9YaVhREAE",
            "text": "Great burgers, and fries! There are other food on the menu we haven’t tried! It’s a good place for Breakfast and lunch!! My new favorite spot now!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaM3NpWkRREAE",
            "text": "Great service and food - Cash only (ATM inside).\n\nWe ordered a Black Sesame Latte, an Ice Coffee, and both were great.\n\nFor food, we tried a cheeseburger and a pulled pork sandwich, both were flavorful, the term of the meat in the meat was on point and they were fulfilling."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqeUxLTTB3RRAB",
            "text": "This place is sooooo good! Love the outdoor seating and the service was up to par with the quality of food 👌🏻\nCappuccino: 5/5\nEggs Benedict w/ Bacon: 5/5\nTotal: $17+Tip\nI wish I lived in the neighborhood cause I would come here more often!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMdzlhdkJ3EAE",
            "text": "Parlay is a rather underrated and unknown coffee shop that puts out  the best burger in Sunset Park and Curry. They occasionally have after hours with visiting chefs. A cozy spot for a nice lunch or date. It is cash only though and they have an ATM."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtMG9MVS1RRRAB",
            "text": "A cute little cafe in Sunset Park, really close to the D train station. Decent menu and really good prices for the food! No coffee refill was about the only downside. Cash only."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwblppb3VnRRAB",
            "text": "Loved the food here! The atmosphere was great, the food was delicious, their matcha tea and omelettes were awesome! The perfect bunch place for a small group. Just wished they served a bit more home fries with the omelette. Another…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1a2NibVFnEAE",
            "text": "This is the spot to have breakfast and brunch in the neighborhood. Interior is great and it’s very relaxing when I’m enjoying my food. Had the French toast and it was great. Props to the workers here, it’s busy and they make it work!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHb2R1LW1BRRAB",
            "text": "We had the burger and bacon egg and cheese.  The food was so good! Definitely better than I expected. I wish I knew this place was here sooner...i will definitely be coming back."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXbnRpejJnRRAB",
            "text": "I was initially really excited to try this place having traveled to Malaysia prior to the pandemic and seeing that they had Malaysian curry on the menu. I wish I had read the reviews prior to coming here. The customer service was some of the worst I have ever received. The man working at the restaurant was incredibly unfriendly and didn’t seem to like women. I was there for two hours with a friend. He refused to allow my friend and I to sit at one of the larger tables because he said we were only two people. However, over the course of my time at the restaurant there were other people that came in and not once did he tell male customers that they were not allowed to sit at one of the larger tables (including men that came in alone). This actually felt rather discriminatory. I will never come back here based on the service that I received."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSURRODZBTxAB",
            "text": "Had the fried chicken sandwich, french toast and bacon. Presentation was nice. Overall the food was just okay - not something we will be coming back for. Small menu is served all day. Nice interior. Prices are reasonable. Friendly staff."
        }
    ],
    "reviews_count": 82
}