{
    "name": "George's",
    "place_id": "ChIJW8J9NLNawokRJ2ze_3cmrG4",
    "grid": "BK7",
    "address": "5701 5th Ave, Brooklyn, NY 11220, USA",
    "rating": 4.2,
    "user_ratings_total": 1011,
    "phone_number": "(718) 439-1403",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOcVpESmxPRkZ0ZUhaWk5EQlRRblkzYlRsSlJrRRAB",
            "text": "I visited this diner for the first time and was really impressed! The food was delicious — everything came out fresh and flavorful. The service was also great — friendly staff and quick to check in. Overall, a really good first experience. I’ll definitely be coming back!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCVVNTMU5PVFZOV1hKNGVYRTNVMlp5ZFMxb2ExRRAB",
            "text": "The wrap I ordered was burned to me."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GYWFVTkpWRTVXYld4UWRIZHFObXR1VVd4dlYxRRAB",
            "text": "Great food. Atmosphere is nice, can use an update, but decent"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuMzYtWmF3EAE",
            "text": "Affordable and delicious diner with a large menu and great portions. Maybe a 4.5/5 in quality but 5/5 in quantity and value for money.\n\nOrdered the honey fried chicken but did not taste the honey at all. Guacamole was great. Home fries had a satisfying crust and a soft texture. Honestly my meal for $32.50 could have fed two people. Would go again.\n\nService was a bit unorganized, but I went for Sunday brunch so it’s understandable."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtN19mSTJ3RRAB",
            "text": "Delicious broccoli soup 😋.\nDepending of what you order, it takes some time, you have to be patient."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xZM1lsWnFNbUZhWWs1YVRXczBjbXgzT1Rkc2FuYxAB",
            "text": "Tried so many things , didn't like the taste at all"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CV1VsUnFaRm8yUm5jd1lWWjBMWGxEVVRCUFdtYxAB",
            "text": "Nice place...good food.\nOnly problem. The wait  is a little too long"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wSFZXSnVYMDF1Wmpjd2JFOTBaM2xPYUY5U1FYYxAB",
            "text": "1000th review. food is good and service was nice"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkbVowSm9XbXBaYVdrNVpVWTVia3BEWldWTFFVRRAB",
            "text": "Very nice"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oRVpHcFNjWFowTkZWbGFtUk5XbHBrYVU5NlFrRRAB",
            "text": "Very friendly service\nThe breakfast here is good !\nHighly recommended!"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyLS0tV3F3RRAB",
            "text": "Poor service"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wT2JHTmpObTU1WkRVMGNYSTJORVZCYkZJMVZWRRAB",
            "text": "I have loved this places since I was a kid it's been the neighborhood diner for as long as I can remember and I am 42 years young ...I still love coming here the only thing I wish they would bring back those delicious hand made mozzarella sticks that was always my must have  please 🙏 bring it back"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VLYmdpUHFMNWViSGpnRRAB",
            "text": "Service not so great. Good food."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VMU0xtXy04NjUtbDZBRRAB",
            "text": "Walked in and was greeted by a friendly old man who told us we could sit anywhere. My sister and I ordered the pancake deluxe and waffle deluxe and found both dishes extremely filling! The portions were quite generous and the pancake deluxe had 3 massive fluffy pancakes that were very buttery and soft! Each plate came with several pieces of meat — 2 bacon strips, 1 sausage, 1 ham tucked beneath everything. I found the bacon strips and sausage very salty and could’ve been toned down a bit. As for the waffle deluxe, I was hoping there would’ve been more fresh strawberries that could’ve been added to the massive waffle given that it’s almost a $3 add on. I wish there were options for additional sauces such as whipped cream. Loved the simplicity of this meal and definitely enjoyed this experience as a newcomer around this neighbourhood."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VONlAwT2pKaU4yWGt3RRAB",
            "text": "Food was  alright I’m not hating on that part filled me up n everyth.\nI’m js chillin eating it my water is empty my mouth is burning im dehydrated 😔 empty for atleast 30 minutes the waiter supposed to keep an eye out for ts bad service. AND what made it worse is that they manually added the gratuity for me and my 2 friends this was like 2 weeks ago but it just crossed my mind rn and I wanna do smth abt it. nah I was actually boutta press the staff n shi. I’m nowhere near broke not gonna cry over 10$ but the service ain’t deserve nothing imo ain’t never going back ion recommend it idk if it’s automated gratuity for everyone but I ain’t like it how you going to judge how good you’re own service was and also put the tip on manually yeah we younger n shi but that don’t give yall permission. Woulda flipped that whole restaurant if I really cared abt the money im js informing others. yeah this review got mistakes n written wrong but im just letting yall know."
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPbUlqNExmdXM2THpRRRAB",
            "text": "Compré una pasta Alfredo con camarones muy deliciosa lo recomiendo"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VOZU04NkhfMF82RERnEAE",
            "text": "George's has been in the neighborhood for so long. The restaurant is clean and the menu has all the diner classics we look for when we want comfort food. They also cater to the flavors of the community of Sunset Park by serving a delicious Dominican mangu (smashed plantains with egg, fried cheese and salami). They also serve huevos rancheros, but the mangu is the best I have had in the area.\nThe only item on the menu I didn't like was the cheese pizza. I know, why order pizza at a diner, but my kids wanted pizza and we ended all disappointed. Other than the pizza, the other classics are delicious. Even the cocktails are great."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNveWRMblRBEAE",
            "text": "Delicious burgers"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURnOGFMNi1BRRAB",
            "text": "Miss bklyn and miss Georges...every time I'm in bklyn I stop by....everything is always top notch"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBaDhiTTdRRRAB",
            "text": "Good service!! And traditional morning breakfasts."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3NHEyY2VBEAE",
            "text": "Basic food is almost flavorless"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRbjVfR1h3EAE",
            "text": "dry bland food but the coffee is good. i wish the food was better"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRekppbkx3EAE",
            "text": "It has been many, and I do mean many years since I dined here, so since I was in the neighborhood, I stopped in for a quick bite to eat.\n\nI don't remember much about this place from my last visit, other than that it served good food, but after my recent visit I could clearly see that it didn't change.\n\nI really liked the atmosphere and service of this restaurant. My server was friendly and attentive, and my food came out pretty quickly in spite of the place being super busy during the breakfast rush.\n\nThey have a very inexpensive menu with great items, which includes alcoholic drinks. The restaurant itself looks small, but it is very spacious inside and kept very clean.\n\nI was pleased with my latest overdue visit, and I will definitely stop by again in the future the next time I am in the area."
        },
        {
            "date": "수정일: 8달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2dDhQbFRREAE",
            "text": "Me encanta es el restaurante de mi hija y mío."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnN3JQZEdBEAE",
            "text": "My 19 month old recently ate the spaghetti and meatballs with my fiance and her sister. He's had explosive diarrhea and her sister has had diarrhea and vomiting."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBbFBXSEhnEAE",
            "text": "Good classic diner. Wrap and fries were on point."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3dWVQcktBEAE",
            "text": "Waitresses were kind. Diner is so attractive looking and cozy. Food is  fair."
        },
        {
            "date": "수정일: 9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5MEl5aWxnRRAB",
            "text": "Great place"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURma3B1WFRnEAE",
            "text": "Everytime i go there is for my french toast even thouht i cook a better french toast myself cause am a chef but this guys are the closest to my flavor,so if you visit george's Dinner do it early in the morning around 9am cause it gets busy,bon apettit."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmeTR6TGpRRRAB",
            "text": "Best diner in Sunset Park! The coffee is very good and the breakfast is delicious. The staff and ambiance are nice and the service is great. I keep coming back."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmellXR3N3RRAB",
            "text": "Great breakfast foods 30 minute wait fresh atmosphere Good for birthdays"
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNbHN6YXhBRRAB",
            "text": "I've been coming to George's since I was a teenager. My kids were raised eating at George's. Every chance I am back in Brooklyn I make it my business to visit and order a meal. The son of the original owner is one of the most amazingly friendly human beings I have had the honor to have met in my life!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQaG9hTkhREAE",
            "text": "Amazing people and good food. 🇬🇷"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzdDRqTEVREAE",
            "text": "We ordered crab cakes cheese burger deluxe and cheese steak platter cheese burger was good cheese steak was good crab cakes was burn on top and mushy inside no good"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzX3Ruc0lBEAE",
            "text": "Food plentiful. Service excellent. Overall, pretty good diner."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuNXMtUGpBRRAB",
            "text": "Excelente servicio, se come rico."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuNG9TdHB3RRAB",
            "text": "they never pick up the phone ."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIeXZUV29nRRAB",
            "text": "Las mesa con chicles"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3MWVuWW1RRRAB",
            "text": "I give this restaurant such a high rating because I was born and raised in Sunset Park Brooklyn, and this diner right here is to me basically a landmark that is setback in time and still to this day. Also has survived all these decades and still serves the best food has the best service and the atmosphere is just amazing as always I remember as a kid coming in here and always being treated with the most respect and, and they get along with the family and make it like you’re part of their family I remember one of the famous soups I call it that they make there is turkey soup the creamy one it’s one of the by far best creamy turkey soups I’ve ever had in my entire life and I haven’t been there in a while, but I am planning to go back there very soon. The service has never changed and neither has the food. Bless you all for still being here and still going strong so many years you bring back such good memories thank you. ♥️♥️🙏🏻🙏🏻💪🌸🌸"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCdEotY2h3RRAB",
            "text": "Updating my 1 star to 5 star review. Georgey is back and things are running much better the food is good. The only thing I can critique are the fries just wish it was little less salty. My childhood place and happy to return."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUNiNkxabhAB",
            "text": "It's the worst place they never answers the call. all his history they are there doing nothing. like scarecrows there without doing anything and they never answer the call.\n\nThey are always there talking without doing anything!\nand the phone never answers,  it they don't want to take an order."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0dWRDbWRREAE",
            "text": "You definitely have a good time alone or with family. The staff are friendly, the owner is very nice. I ordered Home fries, and they didn't come a lot for me. I can eat, I asked and they gave me more. So I think they listen to you."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSOVpxMERBEAE",
            "text": "I waited more than two hours for my food. so that when the pasta arrived it was hard (poorly cooked). cold nuggets with excess fat. bad experience. I wouldn't have minded the waiting time if my food had been tasty and good. but both were lousy."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaclpfTlRBEAE",
            "text": "We popped in here for breakfast before the ferry.  We were warmly welcomed by the waitress.  The food and coffee were very tasty and the portions were large.  The gentleman from the staff also asked if everything was OK and poured some coffee.  We recommend."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMteTRxVVRnEAE",
            "text": "Have been coming to George's for so many years, actually since I was a very young girl. The food has always been the best diner food around, the coffee is a hit or miss bit I can deal with that when the food is yummy. George's is always super packed for breakfast so waiting can be lengthy at times but clearly shows how good the food is."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtbW9uTjJBRRAB",
            "text": "If you are in this area, please have some breakfast at this place. The breakfast was soooo good. Place was very clean and wait staff was friendly. I liked it so much, I am thinking of getting some dinner sometime soon."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMydXFYeUN3EAE",
            "text": "Ordered a Mexican GRILLED cheese sandwich and got a cold sandwich on toasted bread.  I was expecting my sandwich to have hot gooey cheese but that’s not what came.  The sandwich was yummy with fresh cheese and perfectly toasted bread.  The…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHNGNPNW9nRRAB",
            "text": "We came in for a bite to eat. Service was horrible!\n\n1. Our waitress (after taking our order) came back not once, not twice but three times because she forgot to tell us about our choice sides.\n\n2. Over 20 minute wait for our order.\n\n3. Appetizer (Calamari) came at the same time the entree came.\n\n4. My girlfriend ordered her steak medium it came back well done. There was nothing Cajun about my Cajun chicken and I never got the soup (that the waitress had to come back and remind that my meal comes with)\n\n5. The guy there not sure if he was the manager, came to take our plates and did not seem to care that we left most of the food on our plates. Didn’t ask how it was only if we needed boxes and we told him no thank you.\n\nHorrible customer service and even worse food. I do not recommend this place to anyone."
        },
        {
            "date": "수정일: 3년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1MUpXd1FREAE",
            "text": "Los mejores desayunos que hemos disfrutado acá en Brooklyn muy satisfechos mi familia y mi persona una atención agradables Dios les bendiga a sus propietarios y personal 🙏"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM4bHVhcUd3EAE",
            "text": "Nice outdoor seating, and decent food. Far from the best, yet they cover all the bases: pasta, pizza, pastrami, even t-bone steak."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6aHZQTEJREAE",
            "text": "Went with the kids today. Service was good for a busy Sunday morning. We all enjoyed our food. Grilled cheese, side of bacon, pancakes and spinach and feta omelette. Parking was easy and price for the quality and amount of food was good. We will be back"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURsNEpYb2d3RRAB",
            "text": "i order food that i add ketchup too and they literally only sent me 3 packs, i specifically asked if they can add more packs and they even sent me a side of home fries when i asked half egg and half home fries and still send me 3 packs"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyXzRIUEN3EAE",
            "text": "Traditional diner and an awesome spot to hangout at anytime of day. Food is serviceable at worst, and really good at best so you really never need to worry. Their cakes and desserts are amazing. I would definitely recommend their home fries and omelettes."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREOG9udXV3RRAB",
            "text": "Just finished eating at this establishment. Extremely horrible experience! The seating experience was great, the host was very nice to us. The experience went left after we ordered our food. The server expressed that one of the appetizers we ordered would take a long time (baked potato). We then proceed to order baked clams for an appetizer which she did not let us know would take a long time. We also order regular breakfast items ( mangu and French toast). We waited over 25 minutes to get our food. We saw two tables sit after us and get their food RIGHT AWAY! My girlfriend and I are of African American descent. We were the ONLY black people in there. The other people were of Hispanic descent. I felt extremely discriminated against. I myself am in the serving industry for 7+ years. I also work for the Fire Department for 5+ years. So I KNOW AND UNDERSTAND HOW SERVING AND CUSTOMER SERVICE WORKS! The manger that I spoke to tried to explain that the server was probably tired from working a double shift. I work for a company where I do double shifts all the time and treat every customer the same! The server never came back up to us , she acted as if she was afraid of us! She was all laughs and giggles with every other table but us! I ended up feeling so uncomfortable in this establishment we just wanted to leave right away and we didn’t finish our food. Overall this experience was terrible, would not recommend coming to this establishment if you are not of Hispanic descent. You will definitely get your food whenever they feel you should!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlckxDTDVBRRAB",
            "text": "It was good and quiet and the waitress was professional and Nice. I had a good time. She was nice to my son."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURobGM3Mk93EAE",
            "text": "Great food and great service 👍🏻"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5dDZpTHpRRRAB",
            "text": "Great location, awesome breakfasts and amazing service! George’s may be a small chain, but they capture all the elements of the typical all American diner and exceed far above the gigantic national chains! As a visitor, I absolutely enjoyed my 2 visits to George’s very much!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWMjlQanBnRRAB",
            "text": "We've been going to George's for over 30 years, and it has always been a great experience.  It had been a while since we stopped in before our recent visit, but it still felt so familiar.  Great memories,  great times,  great atmosphere, and great food!  A Brooklyn classic.  We're looking forward to our next visit!"
        },
        {
            "date": "수정일: 8년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBOV9TanZnRRAB",
            "text": "A retro style old-fashioned diner that has attentive and friendly servers along with a big menu that has delicious selections!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSbWFIeTBRRRAB",
            "text": "It is crucial to establish a rapport with the establishment's management to ensure optimal service. Regrettably, our seating arrangements were compromised due to preferential treatment accorded to patrons with personal connections to the owner. Consequently, we were left with an unsatisfactory table and were denied access to a high chair, while other guests who arrived after us were promptly accommodated."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNENzgzT2tBRRAB",
            "text": "Very comforting meals. The decor is really giving main character vibes without even trying. Best, most real and reasonably priced diner left in Brooklyn. Only diner I go out to for cornered beef hash meal."
        },
        {
            "date": "5년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzX2FDamFBEAE",
            "text": "Demasiado bueno, buena atención al pagar la señora es un poco mamona si no eres blanco ni siquiera te mira pero todo lo demás muy bueno"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoc2RlRkVREAE",
            "text": "Tiene un ambiente muy agradable muy familiar, la comida es sabrosa y nos atendieron excelente 👌 muchas gracias"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSNE5DTW1BRRAB",
            "text": "A great old school diner/restaurant.\nThe food is generous and delicious.\nPrices are very good in today's inflationary Joe Biden economy. Service is very good too. It's in a wonderful thriving neighborhood! I'm not Hispanic, but you can't help but appreciate the neighborhood, and the restaurant. Be sure to try the cheesecake, it's the best!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUa2RTVXBnRRAB",
            "text": "Muy mal servicio, la mesera no sabía responder a una pregunta simple del menú, después que nos tomo la orden nunca llego la comida  , estuvimos esperando por más de una hora y alo último cuando pregunté que donde estaba lo que aviamos ordenado ,  la mesera nos dijo que el cocinero se avía equivocado de orden y que nisiquiera la avían puesto a cocinar . Me parece una falta de respeto que en lugares como estes jueguen con el tiempo de las personas ."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2dktyMlR3EAE",
            "text": "I like this place. Good food, decent prices, charming atmosphere. However, service is pretty abysmal whether they’re busy or dead. They’re inattentive and extremely slow. I’ve been five times, and the food has taken over 45 minutes each…"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKb2RhaENREAE",
            "text": "No es tan caro, tarda un poco la comida, y es regular."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtM0wtRFZREAE",
            "text": "This place has a nice variety of foods. They usually don't take too long to get your order ready but they are a little pricey for what it is. The waiters and waitresses are mostly really nice to us everytime we go. I like that it has sort of a vintage look to it and a homey feeling."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqbTdqZ19RRRAB",
            "text": "Used to be ocasional customer but the experience is getting worse, waitress needs a better training, it looks like they just arrived from their countries and don’t even look the customers needs, Prices are getting terribly high for a simple breakfast.\nI’ll never come back again."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyNTlYOHZBRRAB",
            "text": "We had a great time. The best part was that all the French toast eggs and bacon all came on the same plate. Love it, just like home. The coffee just kept coming and water only came when asked for. Most of we were not rushed out by putting the bill on the table, they waited until we asked for it"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsZ0lDVlZ3EAE",
            "text": "Crowded and the service was just meh. Any time we needed something (like the syrup for the pancakes or refill the coffee) we had to flag down a server that looked at us like we were the problem. Basic diner minus the service with a smile."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHM2RpTkR3EAE",
            "text": "If you like things fast- this isn't the place for you. Service is slow and everyone knows it. But if you like to hang out at a diner on a lazy morning, chat with staff, watch some football- George's is the way to go. I love the honey fried chicken and fries. Affordable with large portions."
        }
    ],
    "reviews_count": 72
}