{
    "name": "Sahadi's",
    "place_id": "ChIJL_QZ8pBbwokRcKbs9r49iOo",
    "grid": "BK7",
    "address": "52 35th St, Brooklyn, NY 11232, USA",
    "rating": 4.5,
    "user_ratings_total": 581,
    "phone_number": "(718) 788-7500",
    "reviews": [
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxVGFVUmFSek4yYzJsd1pEVjZVRVpETWw5WVRYYxAB",
            "text": "Right near my favorite artists 🎨 supply store,  Artists and Craftsman. I love to shop for my olive oil here. Know where your going because it can be a hike to find out how to get access into these buildings. There is street parking but too is metered unless your parked in the residen which then it will be alternate. Great place to chill, shop and eat. Very Urby!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OdFZuaFBhRmxSZG1oZmVXSkpkVFExTlV4RmNXYxAB",
            "text": "Great place to have a lunch. Quiet."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWTWNtOTFWRXhRTTJwbFZ6WjNlblIwVjFCamVuYxAB",
            "text": "Me gusto la experiencia"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOYUxVaEJjM0ZXV1ZadGFuWjZkemRNVVhSbWJFRRAB",
            "text": "great vibe and great food."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwS05uaG5RVjlWZFcxV2RDMUhNVjlSU21JeU1XYxAB",
            "text": "This is for the marketplace not the restaurant. If you want authentic middle eastern groceries go to the one on Atlantic Ave, this one does not cut it. Overpriced items that go bad quickly."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OTlRVTkdXVEpSYjNrMWVsRjNYMUl5Vm5ScWFHYxAB",
            "text": "Friday nights w the salsa band is always a good time."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCYU5sa3dPV1pmTFdsWFRIRXhiVFJLUzFkalprRRAB",
            "text": "Had the short rib hummus and the whipped tahini espresso martini. It was delicious."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GQ2RFSllZM05MTWtwRFdtZEhaVGN4YkVsTVgwRRAB",
            "text": "Very fun night good drinks service and live music love it here"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSWVZVTm5TMVo0UkhGeVFsYzNWM290VVhRMGRWRRAB",
            "text": "Its a nice market with relatable middle eastern products BUT the HOURS are UNREALISTIC. 11am opening? 11am-7pm may be convenient for your elite brooklyn residents but not really for the working class. I know industry city already has…"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xUmFVRkhkbFpIZWpSV1UydDROblkxVWs5Q2FXYxAB",
            "text": "This is a restaurant and grocery store.  I love the grocery store.  I've only bought ready to eat food at their Atlantic Ave. Location.  Love, love, love, their spice selection!!! And great quality. Always stop in when I go to industry city."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWNFRTMWlaSGhEUWxOMFYyWkNkRVpHVG5GUWQwRRAB",
            "text": "Tasty food, good wine, a fun environment with good music. I thought the service was good and it was a nice indoor/outdoor location."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKMmVsQkpUVEkzT1ZoamFWTXRUV1U1WVZwU1pFRRAB",
            "text": "Excellent dinners"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkV2FXSkRRVjlYTm1NMmRFWlpZM0ZHYzFoc00zYxAB",
            "text": "Great place with a few to many Karen's shopping along side me."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWMWMzTnhPRk5IUVdwaFlsZFJhVmR5V1dOc1NVRRAB",
            "text": "We were at Industry City for the night market which had been canceled, so we were looking for food. Someone recommended Sahadi's restaurant. They make fresh foccia served with Taziki sauce. It was really good. We also order the harissa salmon & steak kabob. The salmon was really good the kabob was under season. Overall, we left happy"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toVVVHcEJkekV5TmtKak9HaFRRVzlQZW5ZeU1FRRAB",
            "text": "Really nice fresh food and good service."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xd1IwZHBaR1J4WVZCc2VHRlpSVXROVG1WT1RXYxAB",
            "text": "Spent over $15 for a tiny salad at the deli counter - they skimped on every single ingredient (even the lettuce) and took absurdly long to give my food.\nIf at least it had been great - but the kabob was burnt.\nVery disappointing given the reviews"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5QmFsWklRazUyUm5NeVkwUmlVemN3WTFBek9VRRAB",
            "text": "I’ve been going to the market for over a year, they used to be so great, but for the past two months I’ve been threre 4 times, out of those 4 times twice the hummus I bought was rancid. I couldn’t really go back for a few dollars hummus but it’s really disappointing as I purchase everything else around the hummus. Hope they improve again"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pScmNVeFdibmRvWjB0b2FUUjRXSFk0WW5oZk9WRRAB",
            "text": "Best grocery ever. I get the fresh hummus whenever I go -- All their prepared food is high quality and they have a wide selection of international pantry items including many products that aren't Mediterranean (their specialty)"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsT2NtcEZaM1pXVWs1dk16ZGhUelZ4Y1hwUWJYYxAB",
            "text": "Food was just ok but music and atmosphere was top notch. Service was friendly as well."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sTmVrUm9kWEpKVHpKWVdHNVBURXBOYlhKWFFtYxAB",
            "text": "Industry City Sahadi's is ideal. You can sit outside and eat in good weather. Sit inside when it's cooler. And get groceries for the week. This is the best hummus on EARTH."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwSVgwcEVUbWxXWWpNNVNVNUpjV3BmUVY5VFpIYxAB",
            "text": "A very wide variety of about anything and everything Middle Eastern and Mediterranean food and drink to enjoy. Breakfast, Lunch, Dinner, drinks with friends or even if you're looking for a quick snack this place has it all. That being said take your time when you're here there is a lot to find."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VQX2s3ZWF3OTllVWV3EAE",
            "text": "We came for the live salsa band on a date night and arrived right on time, only to find them still setting up while EDM music blared through the speakers—not exactly the vibe for an audience expecting salsa.\n\nFor dinner, we ordered Lebanese falafel and a mixed grill. The falafel was over-fried to the point of being too crunchy, and the meats were dry and tough, making them hard to eat. We barely touched our food and would not recommend eating here.\n\nThe band finally started playing over an hour late, and while the two songs we caught were great, the overall experience wasn’t enough to keep us there. We truly wanted to like this spot and stuck around longer, but with their fans blasting on a windy night, it was just too cold to enjoy.\n\nIn short: Go for the band, but plan your night wisely—arrive late, and have dinner elsewhere so you can fully enjoy the music with a drink."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQclMxYmZWa0ktalZBEAE",
            "text": "Lovely friendly  place outdoors   live music friday  it's salsa nite.\nLots of area to sit .n eat."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPeWV2ci1yMi0tamVREAE",
            "text": "The goat of middle eastern food. Nothing but absolute love. My basket always has olives, hummus, and labneh (all best in town), but I always find myself adding some random things here and there."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kcFZqWXhSazVOVGt0Nk9UVk5WV05uYWxkV05sRRAB",
            "text": "Great specialty market with a huge selection of gourmet cheese and olives. They also have an extensive dried herb section with some hard to find spices and herbs. Prices are moderately high but usually worth it."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VPcWc1ZkRJM3V5UWxBRRAB",
            "text": "I love that you can just order a latte at the window bar. The grocery store has everything you need including Madagascar vanilla beans and Lebanese olive oil. They even have Moroccan beer and they’re getting Lebanese beer. Everyone is super friendly here and they have the best breeze and trees that you can sit under."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ4emR5cXl3RRAB",
            "text": "I paid 15 dollars for a mojito water down and alot of mint so disappointed"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKS2N5ZUdWeWVhUlVBEAE",
            "text": "Nice outdoor sitting area and great cocktails. I had the pistachio baklava mojito and sauvignon blanc."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3OHN5WXZ3RRAB",
            "text": "If you want fresh groceries and a great lunch while you shop this is the place to go, the best hummus I ever had, a huge variety of coffee, nuts and so much more, they make their bread fresh, I think I made a mistake I went to the one in Atlantic Ave in Brooklyn, it is the one I always go to..."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvLWNHb3VRRRAB",
            "text": "Was just at Sahadi.\nWhere food safety is but a myth, a ghost of a notion.\nThey wear gloves, sure,\nto caress the food, to scratch their heads,\nto scroll endlessly through their little glass screens,\nto slap stickers on bags,\nto adjust their crooked hats,\nthen to fondle the food again, now seasoned with a little bit of everything.\nMight as well be barehanded,\nmight as well be honest about it.\n\nAnd the checkout?\nAh, the grand theater of neglect.\nThe “Line Starts Here” sign — a forgotten relic, standing guard over nobody.\nCustomers gather like lost sheep, waiting for someone, anyone,\nwhile the cashier, when he finally decides to appear,\npicks people at random,\nlike plucking unlucky stars from a weary sky.\nFirst come, first serve? Only if you understand chaos as an art form.\nThis is no bueno.\nThis is a slow, soft sigh of standards dissolving."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJXzZYZUhnEAE",
            "text": "Large assortment of various items and spices. good deli section in the fridge. the coffee bar is also a nice touch though the menu is a bit small"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJak1lcHN3RRAB",
            "text": "One of my favorite places in the city to grab some authentic middle eastern food. Their selection of spices is unmatched! The fact that I can do my groceries, grab a bottle of wine and eat lunch in one place is phenomenal!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJMk5TS0JREAE",
            "text": "Great grocery shop and good prepared food too."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBbTVTd01nEAE",
            "text": "Great supermarket! The homemade food is top tier. The labneh and the muhammara are delicious! Portions are generous in the take out area.\n*\nJust wish they offer matcha or a unsweetened chai latte at the coffee shop! After 3pm is impossible to get matcha in the area."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBanJPWVhnEAE",
            "text": "Have been going to the location on Atlantic for years.  Stopped off at the Industry City location - Halzelnuts are rancid.  Disgusting.  Unacceptable."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmNXY2RkpnEAE",
            "text": "Great store; glad they opened this location. The spirits selection is also excellent and includes some great local picks."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmcExYYkVBEAE",
            "text": "Wonderful fresh hummus, spicy breads and baklava."
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQwOGEzcDBnRRAB",
            "text": "Amazing selection"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2M2ZMTElBEAE",
            "text": "At around 4:00 P.M. on 22-12-2024, I was at Sahadi's buying food. Everything was going well until the cashier, & this is how it went. I was greeted with a cashier that just came back from somewhere, that had wet & slimy gloves on. He starts handling out food with the gross gloves. When it comes to the coffee, he asks, \"which coffee is which?\" (we had 2 bags.) We tell him, & takes one glove off. He starts handling the bags with the other slimy glove. Then, he takes it off, & finishes checking out the food. As a customer with an employee with gross gloves handling this food, it is honestly very unappetizing. Especially considering, that this is my first impression of the cashier that had gloves on, if this is how he handles his gloved hands, how does he handle his actual hands? I'm not trying to be mean or anything, but it's just basic hygiene, & was very unappetizing."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2amNEVzN3RRAB",
            "text": "In the grocery: the bulk coffee beans are left out months past being palatable. Product on shelves sometimes expired.\n\nRestaurant has tasty enough food and nice atmosphere but service is stultifying slow."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2MHEzd1R3EAE",
            "text": "I always find the best products and gifts. Great little specialty grocery store. I was able to find all my stocking stuffers for my adult children."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5anRxeHdBRRAB",
            "text": "AMAZING food. We had the most delicious brunch. Truly outstanding. Love everything but their labneh & everything Lavash flatbread crackers are something I always make a trip to buy. Today we had a special treat because there was a jazz trio playing there & they were just great too. A few weeks ago I had the opportunity to meet the owners at an event & thanked them for their food in person. Well, I’m thanking them again for what they bring not only to IC, but to Brooklyn. If you haven’t been, then you MUST go."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYNWFuek5REAE",
            "text": "Great prepared foods and Mediterranean sandwich/wrap/shawarma counter. Good prices. Friendly service. Could have a larger assortment of to-go bottled beverages."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYcnZxRjZ3RRAB",
            "text": "Live music on Friday and Saturday.  Very enjoyable to sit outside and enjoy the vibes and food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYaHEzUkNnEAE",
            "text": "Had an incredible experience Friday night w/live salsa with a group of friends! Wish we could’ve stayed longer. Bring a friend and dance the night away. Plenty of people even before the social started dancing away!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuNTVURDBRRRAB",
            "text": "Went to an event on friday with my family thinking i would have a great time . The food was cold , rude staff and when i spoke to the manager he was dismissive and showed he didnt care . When i ask for his name , he said my name is prince you can speak to whoever you want , nothing will happen. The food is disgusting, this manager was the rudest manager i ever dealt with . I left the event and just went to another place . DO NOT COME HERE , overpriced, chaotic and incompetent management!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNucXBuUUN3EAE",
            "text": "Great place to enjoy cheese and wine, and awesome service by bartender Nick! And Luna I will be back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIejZMNXNRRRAB",
            "text": "Salsa nights on Friday! Also hummus is five stars 🤩…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNINnFIOW9BRRAB",
            "text": "Restaurant offered live music and that attracted us. The 5 piece band was great and we were all moving to the beats. It was lovely weather and it was good to dine outdoors. The spicy margaritas were great. Service was slow and there was a mix up (we were told a computer glitch) as we noticed 2 tables that arrived after us had their appetizers and entrees before we got our appetizers. They did take it off the bill. The main course was just a protein choice with 2 salads (hummus & tabbouleh with more pita) which we already had on our platter of samplers. I wish we knew this before so we could have selected different starters. The drinks & music made up for the poor service & mediocre food. I guess I should have noted the word “cafe” in their name. I gave 4 stars as I would actually return for the music, drinks and light fare."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNINnVUOWlRRRAB",
            "text": "Went today to grab some lunch after my last visit 6 months ago and it was bad, so today I waited for 30 minutes and no one came over , i went in and asked for the server and he said in 5 minutes, waited another 15 minutes and I left, terrible customer service second time, definitely will not come again back, there is better places around."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxbk9pNDNnRRAB",
            "text": "This is an excellent grocery store that offers Middle Eastern, Mediterranean, and Lebanese food. This includes freshly baked pita bread, manakish, sweets, kibble, tabbouleh, and a lot more dishes. Their dried fruit selection is also big and delicious."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGc0tXb3FnRRAB",
            "text": "Excellent food, exceptional service, relaxing vibe, reasonable price.\nBeing a New Yorker you’re somewhat used to people being impatient and indifferent. That’s why I couldn’t believe what I heard after I made the reservation call: it felt like telling your grandpa you’ll be visiting for dinner and he said he couldn’t wait to see you. From the call to being served in the restaurant, Sahadi’s customer service is exceptionally warm and genuine.\nEveryone is happy with their food: so tasty, flavorful, and well-displayed. I had chicken shawarma, orange blossom coconut flan, pumpkin ale, and I can’t wait to come back and try more. Their handmade pita is a gem and you can get it from their store just next to the restaurant.\nSahadi’s is now my favorite restaurant in Industry City. Thank you for making our Friday night so memorable!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwdGJQSDNRRRAB",
            "text": "Been shopping at Sahadi at least 40 years - food is great.  This time in Industry city, Met friends for a light, outdoor dinner, under the tent.  It was quiet and lovely.  I imagine the weekends with music and the fire pit would be awesome.  Limited bar menu.  Wine was very good. We were a bit rushed at the end as they were closing."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyb1kyckVnEAE",
            "text": "We had happy hour drinks and appetizers on the patio. They were easily able to accommodate a large group with no reservation. Great ambiance - live music, patio overlooks the courtyard. Service was relaxed (a tad slow) but really accommodating."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwN29yVHB3RRAB",
            "text": "One of the best unplanned experiences I've had in a long time.  The food which is middle eastern was superb.  The staff was very friendly and attentive.  The outdoor seating and atmosphere was fantastic.  Add in the FREE live music makes Sahadi's a classic NY scene.  Highly recommended."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwNnR6QTBRRRAB",
            "text": "We heard the jazz music and saw that a live jazz band was playing at  Sahadi's. The menu looked good and so we decided to stay. What a gem of a place. The food is delicious. The iced coffee delicious. The jazz band was amazing (no exaggeration).  The waiter Victor was very good and pleasant. We ordered so much food and liquor.  The manager came over and gave us a treat.  This is a new spot for us in Brooklyn.\nI give this place 5+!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "ja",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXam9QSENnEAE",
            "text": "オリーブやnuts類の品揃えが豊富な中東系のスーパーです。テイクアウトのランチセットはメインとサラダを選んでパックしてくれるとても美味しいセットです。スーパーの売場の外側にライブ音楽も楽しめる系列のレストランが有ります。"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNTNkstOFZ3EAE",
            "text": "If you love grocery shopping at Sahadi’s as much as I do, you will be as exuberantly thrilled to discover their new retail shop at Industry City. Spacious & modern, this shop carries the same wonderful goodies, and more, Sahadi is so well…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtMHZLZnZ3RRAB",
            "text": "***Tldr: fantastic select goods store in a prime location with a surprisingly powerful dinner selection. Pictured below is the soup of the day, a slow cooked beef  shoulder stew and the grass fed steak kebab, with cherry tomato and a well seasoned eggplant.***\n\nSo, Sahadis at IC fulfills an incredibly interesting niche and should 1000% be considered as your next go to destination.\n\nThe selection at Sahadis covers your bases in terms of seasonings with a plethora of options spanning across the Mediterranean as well as northern and western African. Some items here are pricey but keep in mind that you come to Sahadis for select items you can't grab anywhere in the area. Their selection of sodas are also very affordable and fun. Their nuts and cheeses are always fun to gander and gawk at. The bar is lively and the drinks are top notch. I've heard the brunch is also fantastic though I've never had it myself, my friend says they have a potato hash that is slamming! The cheesebreads and foccacias are a no brainer grab you can't go wrong picking these up.\n\nWhat's really improved at Sahadis in my opinion and has really impressed me has been the food. I have personally seen and tasted the monumental leaps and bounds of the housemade food, such as the harissa mac and cheese, the steak kebabs (they changed the meat and portions and it's SUCH a gamechanger), even the hummus beats out most bayridge restaurants now. (Bold, yes). So truly, hats off to the production team and kitchen!!!!\n\nThey are clearly intent on expanding into the dinner service scene as not only is their menu revamped and thriving, but they have live bands and shows and are catering to the potential of industry city. Don't sleep on Sahadis IC. They're very much in a position to thrive and become the ME food mecca of South slope and Sunset Park."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1X2I3d0RBEAE",
            "text": "Got the charcuterie plate. It had one meat (salami) and three bland tasting cheeses.  3/4 of the plate were nuts and dry fruit all for $18. Very disappointed with the overall quality of the cheeses given the long standing reputation of Sahadi's."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNLXJpZDFBRRAB",
            "text": "Same amazing quality as their original Atlantic Ave location, but with more space! And more grocery items. Bright, open, airy atmosphere. Space to order and eat lunch. Best addition to Brooklyn!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhLV9HeHR3RRAB",
            "text": "Had such a blast at the live salsa event they put on every Friday! Drinks are cheap ($7-8 a glass of wine / beer), and the food is tasty! Overall, a great time on a nice summer evening."
        },
        {
            "date": "5년 전",
            "language": "ja",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNcUlXQ213RRAB",
            "text": "その場で作られるピーナッツバターの機械があったり、スパイスのお値段も良心的です。見ているだけでも楽しい店内です。"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlNUlUYmlBRRAB",
            "text": "An amazing place to be. You can shop great food products for home, let the kids play free outside, enjoy the outer deck and don’t forget to prefer the fantastic halloumi with Sahadi special recipe 😊🌟"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLLU96WXlBRRAB",
            "text": "Great selection of all kinds of foods and spices and a wonderful Sunday brunch with live jazz on the terrace! So good that I just made my reservation for tomorrow making it two Sundays in a row!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlaFlTSnhnRRAB",
            "text": "Take out food is horrible. My egg was raw.\nFirst there was no egg, I spoke to the waiter, who was really nice and helpful. Then they gave me one raw egg. $19.50"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPMkthazRBRRAB",
            "text": "Ive been here before (salsa and bachata events) but first time trying their food.   I got fries and falafel (after 4pm on weekends).  The fries were yuuuuumy!!!!! Definitely getting those again. The falafel is ok but I had better. Ive read other (negative) reviews on portions.\nAnd I think the portions are fair especially today.  I left my table stuffed!! The drinks are nice as well. Staff is wonderful and very attentive.  Looking forward to another evening here def getting those fries again and will try the shrimp kebab"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN5c1B1WGRBEAE",
            "text": "Great store with great design. Love the products and go hungry as they have some really great choices for a quick bite."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5MEozV2RREAE",
            "text": "I remember going to Sahadi's on Atlantic Ave as a little kid in the 70s, seems like we've both grown up. Love that they are selling booze at this location...and the sandwiches and bowls are awesome. They now have a huge tent set up in the…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtNHVTNmV3EAE",
            "text": "There are a lot of gourmet items available here. This is the only location in the city that I know of that has Aleppo soap."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPa3M2ZjZBRRAB",
            "text": "Went here on Friday they were playing Spanish music and it was really great. everyone was having a wonderful time. Older crowd but it's for everyone."
        }
    ],
    "reviews_count": 71
}