{
    "name": "𝗦𝘂𝗻𝘀𝗲𝘁 𝗣𝗶𝘇𝘇𝗮 (Brooklyn)",
    "place_id": "ChIJHxALM2dbwokRs0j284HSMmM",
    "grid": "BK7",
    "address": "4704 3rd Ave, Brooklyn, NY 11220, USA",
    "rating": 4.6,
    "user_ratings_total": 174,
    "phone_number": "(718) 576-3017",
    "reviews": [
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OS2JYbGtXV3BhZVVneU5GSkdSSEJUVWpkZlVWRRAB",
            "text": "Favorite local pizzeria staff is great and pizza is better"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWQlFWUTNiWFF3ZEZvdFowWklVRlp3WlVsUlYyYxAB",
            "text": "Great food  very friendly staff."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJeFlteG9RV3RqTVVZMGJteHdSWGRMY1dSeWFWRRAB",
            "text": "Good pizza! Keeps me coming back for sure"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toV2NYQjVjbUl6VDI5VWNWWlNWRWxITVVSRmNVRRAB",
            "text": "I love this pizza place and the pizza is very good for a good affordable price unlike others like papa John’s and domino where they charge 18$ for small slices meanwhile sunset pizza give you big slices for the same price"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkek1XNXpObTF6WlZwaVRqRXljV2syUm1jM2NWRRAB",
            "text": "Slices were very good Great service definitely will be back"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCTFJHTjJieTF4ZUVVekxVcE9NMjB6T1Vsb2IyYxAB",
            "text": "Amazing food and very friendly people i 100% recommend"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMdmx6OWUtNDQyUnJnRRAB",
            "text": "2 slices $6.50 free soda   cheese pizza slices were ⭐️⭐️⭐️⭐️⭐️"
        },
        {
            "date": "5달 전",
            "language": "de",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VOeS10N3ViMlpTLW5nRRAB",
            "text": "Pizza normal"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvMm9LRGVBEAE",
            "text": "Eversince i moved to sunset park i have been looking for a satisfying pizza place. I tried a bunch on 5th ave(closer distance to home, about a 5-7min walk) but didnt like it for one reason or another and never ordered from again. This place on the contrary, I would order from again! Its a bit further away from me, but its so flavorful. I got the margarita woth marinara sauce and it was amazing!!! I ate before I could take a photo, but here is most of the pie."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvb3R5T2JnEAE",
            "text": "Come check them out"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBcV9mTmFREAE",
            "text": "The pizza is the best. Thank for coming back to sunset park."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBbzVXVzZRRRAB",
            "text": "The pizza tasted amazing, workers were super polite, the service is great, all in all it's a great place to get pizza"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBOXFiTFN3EAE",
            "text": "Pizza aint good. Its not fresh. Crust is not thin and needs to be burnt a little. Crust should be crispy. Mediocre pizza."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfMC1EYlZREAE",
            "text": "I got the chicken calzone and spinach calzone, the chicken was very fresh and tasted really good. The spinach with the mozzarella was a perfect mix, that one is definitely my favorite. Benito ringed me up and served me with great customer service and a great smile. 10/10 recommend this place any day."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfMFlqOG1BRRAB",
            "text": "Pretty average"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfMGZ2UzJ3RRAB",
            "text": "Called for a delivery. The delivery man was incredibly rude and nasty. He refused to bring my food to the door. When I called the pizza shop to speak to someone, the person taking the orders stated that because I didn’t tip for a previous order was why they had refused. I didn’t  because I had no cash, only card. I’m not obligated to tip and me not doing so doesn’t justify having a vendetta against a customer. This place has disgusting service and deserves to be shut down. Complain to your boss if you want more money."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQbWYzcUl3EAE",
            "text": "Sunset Pizza strikes the perfect balance between a laid-back vibe and gourmet-quality pizza, making it a must-visit for pizza lovers. From the moment you step in, the friendly staff and cozy decor set the tone for an inviting dining experience.\n\nThe menu offers a delightful variety of pizzas, from classic Margherita to inventive combinations that showcase fresh, locally-sourced ingredients. Their wood-fired crust is a highlight—thin, crisp, and slightly charred for that authentic flavor. The Truffle Mushroom pizza, in particular, stands out, with its rich earthy flavors complemented by a perfectly melted blend of mozzarella and parmesan. For meat lovers, the Spicy Sausage pizza delivers a fiery kick balanced by the sweetness of caramelized onions.\n\nSunset Pizza also caters to diverse dietary preferences, offering gluten-free crusts and vegan cheese options that don’t skimp on flavor. Pair your pizza with a crisp craft beer or a glass of wine from their thoughtfully curated drink menu.\n\nService is prompt and attentive without being overbearing, and the staff genuinely seems passionate about their food. The restaurant's ambiance is casual yet stylish, making it a great spot for a date night or a gathering with friends.\n\nWhile prices are slightly higher than your average pizza joint, the quality justifies the cost. Sunset Pizza isn’t just a meal—it’s an experience. Whether you're a traditionalist or an adventurous foodie, this place is guaranteed to leave you craving another slice."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQX28zeDB3RRAB",
            "text": "Nice people. Delicious pizza and pasta.  Great prices! Fast delivery! I love this place!"
        },
        {
            "date": "11달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzeUpQM19nRRAB",
            "text": "Excelente toda la comida en especial las pizzas 🍕"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzdnB6bDRRRRAB",
            "text": "A bit disappointed by the pizza. We got a mozzarella pie with vodka sauce for delivery. Although the sauce was seasoned well, more could’ve been added and the dough was extremely dry. Hoping this was just a one off"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzbnJTU0hnEAE",
            "text": "Very ordinary. The pizza is bland"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYaVpmMUt3EAE",
            "text": "Great pizza and chicken wings."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuMDVMZ05REAE",
            "text": "Perfect"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURucm82dWdRRRAB",
            "text": "THIS IS MUST BE THE WORST PIZZERIA I HAVE EVER DEALT WITH, THE WAITING IS HORRIBLE AND MOST OF THE TIME THEY ROBBING CUSTOMERS OUT OF THEIR ORDERS AND THE DELIVERY MAN OVER CHARGES FOR EACH DELIVERY AND THE DONT CALL BACK TO LET YOU KNOW IF THE ORDER IS ON THE WAY, THEY ARE JUST BAD BAD BUSINESS. THEY ALSO HAVE THE BALLS TO CANCEL CUSTOMERS ORDERS WITHOUT THE CUSTOMER'S PERMISSIONS. THE PIZZA ALSO TASTES LIKE A NIGHTMARE."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3MUlDWTN3RRAB",
            "text": "They make for me every single day my favorite pizza-sandwich"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURicTZ6cVJ3EAE",
            "text": "Excellent customer service and good quality pizza. The prices were also reasonable. I am impressed with the customer service. Keep up the good work!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURicVlYT3hnRRAB",
            "text": "Great please love it"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiNTR6VG9BRRAB",
            "text": "The food was excellent"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMXzUyOVl3EAE",
            "text": "Customer service was legit until tonight. I ordered the same salad I’ve been ordering for months and then all of a sudden the restaurant call’s and say’s they need to charge me extra for the same salad..? I will no longer be a customer at the restaurant and I would order delivery on average almost 2x/week for the last 6 months. I’m pretty sure they’ve taken enough of my money so save yours."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6MExtbnJRRRAB",
            "text": "Best pizza ever !!! Italian flavor New York best"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNULWJ2cEdBEAE",
            "text": "Good crunchy pizza 🔥"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqeTZqRUN3EAE",
            "text": "Their pizza is delicious - highly recommended! 👍"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqNkpXR3ZRRRAB",
            "text": "Very friendly staff.. pizza was enjoyable 👍"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSOFlTUEl3EAE",
            "text": "Best slice in Brooklyn and affordable! My only gripe is the small venue.\nThe guys really started working with the small space and made a little more space to sit and I love it!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkcVBlVmp3RRAB",
            "text": "Hole in the wall shop. Super friendly service with phenomenal affordable pizza!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0bk5HTUF3EAE",
            "text": "Great place for quick bite, very friendly people good taste"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWLUlpSTd3RRAB",
            "text": "The bbq chicken pizza was terrific!  Staff is super friendly."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4dXB2UFJBEAE",
            "text": "Best pizza in Brooklyn."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaNnRxNjV3RRAB",
            "text": "Nice local restaurant with amazing pizza! Purchase by the slice, or whole pie. The Heros look amazing! And the staff is welcoming and helpful."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURac3BiUnFnRRAB",
            "text": "Great pizza, great delivery, just the best. Muy rica pizza..."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNac0s3djBRRRAB",
            "text": "It's bread and cheese. Wow, the prices are going crazy. $20 for bread and cheap cheese."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwOGU2Um9BRRAB",
            "text": "No me gusto el sabor"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwZ0x2UlBnEAE",
            "text": "I order 2 hero’s they came hot and fresh. Meat was fresh and bread was fresh. The person who took my order was very professional and patient with me as I kept changing what I wanted. Delivery driver very professional and quick. All around great restaurant. Would definitely recommend. You won’t regret."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwdnJ6S3ZnRRAB",
            "text": "This lil hole in the wall joint has the best authentic NY Pizza. I found this jewel looking for something to eat on the go. Sunset Pizza is small but clean and they had an A rating.The staff was very friendly and the pizza is made fresh. I had the greek chicken salad pizza, pepperoni and cheese slices. Hands down they were all very delicious. This is not your typical eat in pizza spot as it is super small with only 3 tables. They do offer lunch specials and can sodas that were $1.75 which is pretty cheap. If you are passing through this is a great pizza spot!! Highly recommend. and they serve more that just pizza they have a nice menu and prices are reasonable!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKd1lmNXdRRRAB",
            "text": "Delicious fresh pizza!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4dnJiRndRRRAB",
            "text": "This place is a gem, simply the best pizza in sunset park. The prices are excellent, and the crew working are so professional and respectful."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4eXN2eWRnEAE",
            "text": "It's a solid neighborhood pizza shop to grap a slice of pizza or fill your stomach. Pretty much that's all. The pizza is okay but nothing too memorable. Seats could be limited in busy hours. A 4.3/5.0 would be a more appropriate overall score compared to other pizzeria in Sunset Park in my opinion."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSdl9tRU1nEAE",
            "text": "Super friendly service and a great slice of pie."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURobmRHTS13RRAB",
            "text": "Delicious!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNocGRMVzl3RRAB",
            "text": "Really friendly amazing food."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ4eWZ2Z3d3RRAB",
            "text": "This spot has been my quarantine MVP! I have ordered from here several times via the slice app as it has become my go to - their extra cheese pie is HANDS DOWN the best extra cheese pie I’ve ever had and definitely the best in Brooklyn as I’ve had time to search hah. Just look at my pics, and you can tell they actually put on another layer of cheese not like other spots where it seems suspect as if it were only a dusting more of cheese- the first time i got the EC the delivery guy must have had a rough ride because it was a bit of everywhere but it still looked soo mouth watering (see last pic)! The baked ziti rocks too. Any time I need a reliably EXCELLENT quality pizza i order from Sunset."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxeF9tUXJ3RRAB",
            "text": "We ordered for delivery , because we were stuck here again in Brooklyn, for the night. We needed a Father’s Day dinner so we got some real NY PIZZA!! The order was delivered on time and the Large Pepperoni and sausage and mushroom with…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXcW8yU2N3EAE",
            "text": "Saw good Google rating. Obviously it’s a lie.\nWorst margarita pie I’ve ever had. Won’t be ordering again.\nSee image. Chunks of sauce. Black brown basil.\nI added mushrooms and they’re canned mushrooms. Lack of cheese."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhNF9qSnVRRRAB",
            "text": "Amazing freshly made Pizzas. Very tasty and authentic. Good staff and great price.\nHighly recommended."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXdUw2WjN3RRAB",
            "text": "That was an excellent delicious pizza that is thin, crispy, and filled with heavy toppings. Highly recommend it to everyone who wants to grab something to snack on before heading to the beach."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN5dDliVktnEAE",
            "text": "I have been ordering from sunset pizza Corp since the pandemic began and I can say it’s the best pizza In Sunset park!!!! Delivery is super fast, pizza is always hot and so delicious. Tonight we ordered the margarita with fresh tomatoes and oh my god! The sauce is perfect, so fresh tasting. Highly recommend!!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtdXNLZ3BRRRAB",
            "text": "I’ve been a fan of this pizzeria since they opened up. Absolutely amazing food!!!! I used to come here everyday for my lunch break when I worked right around the corner at the electrical supply. Amazing owner!!!! I haven’t been here in some…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHZ3FYa0FnEAE",
            "text": "Their lobster ravioli is terrible, I even sprung for the dollar extra for it to be baked and got noodle ricotta soup with extra cheese on top. It has a weird aftertaste. Only reason I didn't give it 1 star is because I should've known better to order that from a pizza shop."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ4aFB1Wk9REAE",
            "text": "I was riding my bike when I passed by this local pizzeria place. I went in for a slice and ended up taking TWO plus got a free soda thanks to their 2-slice free soda $5 special! Honestly the pizza was amazing guys. My respect for this place! Thanks guys 💯 keep it up!…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQteHBfZWVREAE",
            "text": "We can not wait to go back! The dough is perfect. Super crisp and airy! Perfection! Pepperoni pinwheel was amazing! I wish we lived closer"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhLU9pWVNnEAE",
            "text": "Really great pizza! Have been ordering here since moving back to Brooklyn and they do not disappoint! Definitely recommend!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNlOHEzd1BBEAE",
            "text": "This Was The Best pizza I tried in a long time i love pizza and when i look for pizza this is the taste i looking for It took me to my childhood when I was 9 years old there was a pizzeria place in 90th and rosavelt Ave in queens NY  just like my younger years 20 years ago I really enjoyed this pizza I highly recommend it try it today you'll see what I'm talking about"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURDMmJMb2tRRRAB",
            "text": "Had breakfast here and it was tasty. Really fresh like home coming not processed tasting. The only problem was I was not giving utensils in may bag...but I had  plenty of condiments.  I will be returning."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtdzZ1XzVnRRAB",
            "text": "Ordered baked ziti and the send baked penne. Asked for a sauce for my chicken roll and never received it. Such a disappointment. If your ate going to represent Sunset Park represent full force. Won't be ordering from here again."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5ajZTbXFRRRAB",
            "text": "One of the best pizzia in New York\nSauce is perfection\nCheese is nice\nMade it fresh\nWent there with my grandpa and we had a family reunion and there we were short on pizzia so we baught some amazing!! I slice is enough to be full"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNhaW95XzJnRRAB",
            "text": "Literally the best pizza in Brooklyn. Pizza is crisp and fresh wonderful basil and rich sauce this pizza ROCKS will only order from here out of Bay Ridge period. Thank you!!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1NFlHd2R3EAE",
            "text": "Pizza wa ok but there is really no room in there , even when you get a seat, people are all over you on line. Between the line and tables is like 2 foot distance. Can't really eat there"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyeU1yRUxREAE",
            "text": "Margherita pizza delicious. Price is good. Best pizzeria in around that side. And sauce is not burn your stomach."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQya3FtbG9BRRAB",
            "text": "Great little pizzeria with reasonable prices. One of my favorite places when I'm working. Awesome menu..."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtcHJha2lBRRAB",
            "text": "Great New York pizza. Fairly priced and well made. Very good experience. Would come back."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXN1BlX3NnRRAB",
            "text": "Pizza always fresh. 😋 always good too. Everything they make is way better than most pizza spots in neighborhood. On point."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpdHYzbjFnRRAB",
            "text": "I want to thank the family at Sunset Pizza for making our event the best with great food. Definitely will be back! Thank you from the Lopez family 🥰…"
        }
    ],
    "reviews_count": 72
}