{
    "name": "The King Of Meat",
    "place_id": "ChIJW9zq08tbwokRK2vbYUc7Qws",
    "grid": "BK7",
    "address": "4408 5th Ave, Brooklyn, NY 11220, USA",
    "rating": 4.9,
    "user_ratings_total": 921,
    "phone_number": "(718) 489-9084",
    "reviews": [
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25nME1tOVJOM2xxWTNWd05sOTJSbmRsVFVGNlJuYxAB",
            "text": "This place gives locals a reason to stay close to home. This place combines visual appeal and good vibes. I'm repeatedly impressed by their attention to detail. The workers paid attention to every detail. I honestly believe this place deserves recognition."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xocmNTMU5aV3RYTmxaRlgxbGZUME5JT0U5d1FtYxAB",
            "text": "The King Of Meat was overall a great experience. We had a pretty mean Chips and Guacamole for our appetizer. Then I ordered the King Cheesy Hamburger which was very good. Than I had a cheesecake for dessert which was a little plain but at the same time it was good. The only thing I have to complain about is that when I asked one of the waiters for a shot of a soft drink I never got it. But other than that the King of Meat was very good and I'd be more than happy to come again soon!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201RVRrUldZVm81ZFdObGFHUkxYMHBEYlVZeFFtYxAB",
            "text": "Fantastic Service from the Kitchen and Bar! The Sauce for the Steaks was impeccable. If you cut steak, rub on salt rock, dip in sauce, and get a little mash potatoes with each bite it will literally melt in your mouth!"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WSE9HazNUSEIyU1dVMVFWbFdVeTFqVjJaSGFGRRAB",
            "text": "We walked in on a friday, shortly after they opened. The establishment is cozy, dark, and moody. Beautifully decorated for Halloween. The food was amazing, absolutely delicious and portioned well. I ordered the filet mignon rare and that's exactly what I received. The cocktails were delicious. I could go every friday, just for a cocktail. My only complaint was the music, it was OVERWHELMINGLY loud. I could barely have a conversation with my partner across from me. It was still quite early in the evening, 2-3 tables of two people, with no running events (karaoke or live music) so I was surprised about the volume. This is a local establishment and I would love to visit regularly, but I can't if it is always this loud. Aside from how loud it was, I really enjoyed the music playlist, food, drinks, and atmosphere."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0cFpIZFZkRVJSVkRoVGFtSmpXVWh5VG1sRlVYYxAB",
            "text": "This place defines excellence. Employees delivered service that aligned with the place's appearance. Their food shows imaginative yet appealing choices. The costs remain fair, choices aren't overwhelming, and food tastes good. I found this comfortable place while searching reviews."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1MWRtY3daRTl3Vkd0RlkydHhaMFJVVlUxblZrRRAB",
            "text": "Great steakhouse in Sunset Park, Brooklyn. Everything we ordered was delicious! From appetizers to desserts we were all pleased! Their steaks will not disappoint! I had boneless ribeye on Himalayan salt! Wonderful atmosphere, cozy and great music! Service was fantastic! Rowin was put waiter and he was great!\nCheck them out, you will not be disappointed."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xORlIzUmljVXN3WjE5NFIzUlVUWGcxZUMxdE0wRRAB",
            "text": "Was recommended this place by a friend and needless to say this place lived up to it! Great food and atmosphere but above all exceptional service."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WRGMyUkxVRVZQTTBFM1FXZHFRVnBXYzJreFMwRRAB",
            "text": "The food was absolutely amazing, full of flavor and beautifully presented on a Himalaya salt board. The drink was delicious, perfectly balanced and refreshing. The atmosphere made the whole experience even better, with a cozy yet vibrant vibe. The decoration is instagram worthy. Can’t wait to come back!"
        },
        {
            "date": "4주 전",
            "language": "es",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOQ1JGTnhhVFptTmxCYWVubHlUa1JoUlRSTk1XYxAB",
            "text": "Un poco \"no se cómo\" jajaja parecen enojados."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xCS2EwMXVjR1JLWVhoV2FVZEpjVk5ITmxFdGEzYxAB",
            "text": "Very friendly staff, welcoming atmosphere, and a very cute place. We had quesadillas, nachos with cheese and meat (highly recommended), and a boneless ribeye steak (very juicy and accompanied by a delicious sauce). Highly recommended if you're in Brooklyn and want to spend an evening with friends, with good music and good food."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2enNlQ3VRRRAB",
            "text": "Quality food and wholesome service. Ronnie was very attentive, funny and made the experience even better. The Himalayan salt platter really makes a difference in the dining experience."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSamNXbGhUekV0ZGpWbVpXZGhXVnAyWW5kSlpuYxAB",
            "text": "This place is amazing. The atmosphere was chilled and vibe. The food was delicious and tastefull. Our waiter sosy was great! And attentive! Definitely will be coming back"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKNlVUWlRlbUprT0hkMWNqVnNXa295UjNkWmFWRRAB",
            "text": "service was TOP"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1dlNHcHdXalpHVkZaQ1lqVk1OWGwwVEMxNlNsRRAB",
            "text": "Really good drinks and people. 100% recommend"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taRVFtaFFXWFZ4TUVSNk0wUnBVVFpPVGxaek0yYxAB",
            "text": "Amazing experience steak is delicious I will\nDefinitely come back. Tacos are so flavorful and good portions. Steak is a big good size so if you eat a lot order the side if not don’t bother."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFdGIxcEtTMk5rV2poTE1qQXRUekJ5ZW1KUmVYYxAB",
            "text": "went here to watch a soccer game :) amazing drinks definitely worth it and can’t wait to try the food out next time !!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25vdE9FUm9aMEprYW1FMk4yazRkVVpTVDJFM1VFRRAB",
            "text": "Sosy is our server and he was sooooo amazing and super duper friendly. We got a tomahawk for 2, fries, and mixed greens and more! It was great experience and it was phenomenal. Everything that we ordered was 10/10. I'm very happy that my husband found this place. We both enjoyed it so much"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGQ1dFeEpSMGh6ZURsaVZYTkhVVVkyZG5GSlVtYxAB",
            "text": "Amazing place, amazing food, the steak is super! Even the music in the background. Rowen was very welcoming and kind with all of us. Highly recommended."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OU1JGZzNlVVJXY1RZMUxWVkxPSHBSWVdKZmFVRRAB",
            "text": "Didn't eat in the restaurant, but did order for takeout. Staff was extremely welcoming and kind. Unfortunately, that was the only good thing here. I had a simple order of the garlic baby potatoes, what they gave me was a standard potato sliced, and covered in cheese with what looked to be some other ingredients maybe parsley or whatnot. Regardless, not close to what was ordered.\n\nNext was the quesadilla that I specifically asked for it to be plain which normally would mean no toppings, sauces, or other add-ons. This was not the case as it took was covered in what I will guess is sour cream. So again, not what I ordered.\n\nNice looking place, just double check everything to make sure any of your requests where heard, or if the food you got is what you asked and paid for.\n\nSo I'm going to get nuggets and fries, and try to forget incinerating money at this place."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCM1FXOTRMV3hLTjFoS1ZrTXljVzlPVWxocVlWRRAB",
            "text": "King of Meat was a great spot to bring my mom for her birthday. I was able to make a reservation for a big party using google assistance and a staff member also called me to confirm. In addition, they asked me about any needed accommodations. The food was great! I suggest getting the melted cheese dips for appetizers and the steak quesadilla! The chicken wings with fries is a good meal for the little ones. My sister said their burger was delicious and the steak was cooked to perfection. Lastly, the cheesecake was amazing as well. I was able to ask them to make it plain. But this review is going out to our server and host! He was amazing, attentive and accommodating. We had kids 6 and under in our party, and he brought out bubbles and finger puppets to entertain them. I’m glad we chose this spot for my mom!\n\nP.S. they only take cash or payment through Zelle! It wasn’t a problem for us though! But just a FYi."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201SFMxcHlWbk5xTTJGa2NGSmZTbGRJTVV4UlFsRRAB",
            "text": "If you want to have the best tacos of New York, It's here, don't miss the chance to try the hippie taco. The smash burger is so tasty and the quesadilla of T-bone blows your mind.\nGood beers, good service and amazing waiters!!"
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEdEpuVUZREAE",
            "text": "The best meat in town 💯 and best mezcal Zama 🔥"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsbk9FUXpWV1kwV1dkSWVHSXRaWHBwY1RkU1RWRRAB",
            "text": "Just the music. They need more latin music"
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25reFZubENWR281ZUdkalZXNUlNRTA0Y2psQlNsRRAB",
            "text": "Esta buenísimo las margaritas"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25FNWRtWjNaamR6T0VSd2MwaFBMVFJJZFc5U1kxRRAB",
            "text": "Came here around 5:30 on a Friday night. Asked about happy hour and what was included, they said there was no menu and after the bartender and server conversed we were told only beers($5) and certain liquors ($9) the only food available was guacamole for $10. We ended up ordering beer and appetizers while waiting for friend (he got stuck with work and came about 20minutes late)\nWe only had 4 people (can check cameras if don’t believe all the other tables were only parties of 2, we were the only party of 4) and had automatic gratuities added to the check, was told either cash or Zelle & when I asked about happy hour beer pricing after we got the check, I was told it was only available for the first round(was never informed)\nBeef carpaccio was good, came with a little salad in the middle, only issue is that it also came with a piece of clear plastic wrap\nSteaks were bland, was told because it came on the salt piece they don’t add additional salt/flavoring..but then comes the question. Is the salt piece washed or cleaned in between guests? Each piece had to be purposefully rubbed/smeared on the salt piece to get any flavoring… the tomahawk was 30% fat pieces and overcooked. Asked it to be medium rare (more on the rare side because lots of reviews said overcooked)\nThe pesto pappardella was bland; tasted like they only used the paste and no additional salt or flavorings.\nSteaks took about 20-35minutes to come, after appetizers were cleared, we saw the table next to us get their steak; finish it, pay and leave and we were still waiting…\nServers were very good at clearing the table of food and drinks, even if there’s stuff left in or on the plates and cups. My beer had a good inch left inside and it was removed, the potato croquettes had one left (out of 5?6?) and we were asked if we still wanted it…don’t know why he was rushing to clear the table when the steaks and food didn’t arrive for another 20-35min. Water was not refilled until asked & the “large lemonade” was just a regular cup with lemons squeezed inside, friend said there was no sugar added (for $7 dollars?!)"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0aVJ6aG5Va1ZWV1dsNFVWWnFSbWQyZGxkU1MwRRAB",
            "text": "We stopped by late at night for dinner after a long day. The bartender/server here was an absolutely delightful human being, and the food was phenomenal. Cannot recommend this place enough."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SSFFWZDNNRk50YWtSME9HRkZSMWxIVjNGaU4zYxAB",
            "text": "Sosy was the best! The food was also AMAZINGLY DELICIOUS!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toNlgyNTVaME5vWVVOWmNqQTViWE5hU1dseE0wRRAB",
            "text": "Sosy was amazing!!"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SMlgydzNiMEYzZFV3d04yeDJWVEZzWldKV1FYYxAB",
            "text": "Really amazing beef, that’s for sure"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210VlgwdEpPVkIxZUVkV1VrdExZV05yYkV4c1JVRRAB",
            "text": "Food was excellent, Service outstanding, All around Great Place."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aaFNqaFNPVEI1ZWtsdmRtWnpZM05uZW1nMmJHYxAB",
            "text": "Best Bourbon Drinks, Tomahawk was amazing!!!! Great service!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJUEJ6X0RBdmRTcWd3RRAB",
            "text": "Vibes were great !!! Steak was perfect!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsQ1lsVkxiMDV6TVZKWGJWOXRNVUZCTURaTVMzYxAB",
            "text": "Loved it all ! Drinks and food were great ! Thanks for the great service"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0dFkwSnRaMGRLWHpKUGVEZDVYekI0YlZwTmMzYxAB",
            "text": "Had a great experience for Father’s Day . I had the short rib and it was amazing also potatoes with cheese was amazing ! Service was amazing and kind very friendly made it seem like you were part of family"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toZk9XSjJURkZ4ZDNKek1YUllhVlphVFRoU1drRRAB",
            "text": "Impeccable service the meat was top-notch came for Father’s Day left so happy as a mom!!!! 5 STARS!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLaTlxZXU1eXFyclFnEAE",
            "text": "Great STEAk and drinks!! Service was fab!!!!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VLcTRfcFN4dlB5YzdBRRAB",
            "text": "Amazing experience, would definitely recommend."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wVmIyTjJjVloxVlV0VFVGcGlTWGwxZFhGcFQzYxAB",
            "text": "Sosy was the absolute 💯 bomb.com waitor. He moved around like he was protecting his establishment. He was amazing serving and hosting. I love this place because of him ❤️ will be back"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxMkxWVXlXVlozZWxnd1pWaHFMV1JzY3kxNE1IYxAB",
            "text": "Me encanta el servicio que ofrecen son muy atentos en en especial.  Rowin☺️"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OTE5rTlZWMlpxVFY4NFNYcE9PVVIwWWpadlJsRRAB",
            "text": "Awesome service, great atmosphere and great food. our bartender was awesome super charismatic and funny! Look for Rowin he’s the life of the party."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJV185NFhkaC1tNUpnEAE",
            "text": "This place is dope, good DJs, food is sooo good, owners are amazing. We did the brunch & The waiter seemed overwhelmed & wasn’t happy when I kept asking for another drink but it was busy. The bartender was the absolute best, such a vibe here we stayed all day and had dinner. This dinner I’ll be dreaming of it, it was sooo goood omg. They served steak on a salt block I never had anything like it so so so amazing."
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNVzYzS2JYdXQteG5nRRAB",
            "text": "Me encantó el lugar, muy acogedor, la comida muy bien y nos atendió Sosy , muy amable y buen servicio ❤️"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNneGF5QzFnRRAB",
            "text": "Stopped by on a random week day and had a wonderful time. Love the atmosphere, the staff is so friendly and they have a great selection of drinks.\n\nUpdate May 2025:\n\nCame in for dinner to try their stakes. The drinks as always were delicious and so was the service. They didn't have all the stakes available so we went with the boneless and bone in ribeye. The boneless ribeye was cooked to perfection delicious, the bone in ribeye was supposed to be a M but was more of a Well-done, and unfortunately had a lot of fat, the flavor was good and enjoyed the idea that it's on a Himalayan salt block (a little too salty for me but still delicious). Overall a good experience but will probably come back for the drinks and not so much the steaks."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJVFRrc0dnM00zSGV3EAE",
            "text": "Bartender corrected me when I called him over by saying “hey bro” and corrected me as he should after that he said I should say excuse me instead. I then proceeded to let him know that he made my drink wrong I had ordered Tajín on rim instead of salt because of my sodium intake he then proceeded to tell me twice I didn’t say Tajín and I corrected him and told him I did because I never order salt also I didn’t want the order fixed I was just informing him. He then proceeds to talk to the customer next to me and says multiple times with an attitude “customer is always right” obviously he was being sarcastic and rude. I got my check and left because after that I couldn’t enjoy my drink. His name I believe was sussie. I was there for like 15 minutes total and had the worst customer service ever. Also they don’t take cards just Zelle or cash ?"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2enVldEhREAE",
            "text": "Celebrating my husband’s birthday and was looking for a special place. First time here and it was great. Our server Ronin was very attentive and made our birthday boys celebration special. Food presentation was on point. They served steaks in pink Himalayan plates which give the steak lots of flavor. Will be back."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURveElqa1FnEAE",
            "text": "Great atmosphere, great food and the servers are very knowledgeable and attentive! (Rowin is amazing!!)....This place is 10/10 can't go wrong. Also amazing music!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJaE1pUmtRRRAB",
            "text": "so yummy. bartender was so sweet"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJXy1TTGhRRRAB",
            "text": "We had a Great Dinner at this s location our Server Rowin was the Best!!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJdjlxODZBRRAB",
            "text": "The food and atmosphere was incredible! I will be coming here every Saturday for the lady’s brunch!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJOTdxVHZnRRAB",
            "text": "The food and atmosphere are okay overall. We found the steak slightly greasy.\n\nThe Service was friendly and alright.\n\nThey don't accept credit cards, which is weird. They only accept Zelle or cash."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3cE5UWFNnEAE",
            "text": "I was there a few nights ago to celebrate my sister's birthday. We ordered Ribeye, at least 4 different tacos, a burger, and ribs. The meat was good, but the boneless ribeye had a lot of fat, which I didn't like. The tacos were not tasty at all. They lack seasoning and are very dried. The salad was very good and well dressed, but the avocados in it tasted like fridge. I highly recommend their burgers. The atmosphere was good aside for the fact that the music is loud, making it feel more like a bar than a restaurant. The service was good, but took a long time to come to the table (maybe because it was a big order?!) . The staff was very friendly and attentative to our needs."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzMTlfakRnEAE",
            "text": "I recently celebrated my birthday at King of Meats and it was an experience I’ll never forget! This place has hands down the best tacos in all of New York— the flavor, freshness, and presentation are unmatched. And if you’re a steak lover, prepare to be blown away. The steaks are cooked to ABSOLUTE perfection!\n\nThe owner, Roger, is incredibly hospitable and made sure everything ran smoothly for my event. His attention to detail and warm personality made us feel like royalty. The waiter Rowen was so friendly and attentive, making the entire dining experience even more enjoyable.\n\nBut wait, the real hidden gem is the speakeasy downstairs, which is out of this world! It’s the perfect spot for parties or a unique night out. The ambiance, design, and overall vibe are unbeatable. My guests were raving about it all night!\n\nIf you’re looking for amazing food, top-notch service, and a space that’s ideal for both intimate dinners and special events, King of Meats is the place to go. Don’t walk—run to this incredible spot. You won’t regret it!!! Trust me on this one guys…"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaek1QdkhnEAE",
            "text": "I recently had the opportunity to visit this new steakhouse in Sunset and I must say it was an exceptional experience. A place like this in the area has been missing for a long time and I greatly appreciate the investment and ambition that has been put into this project.\n\nThe concept is really interesting and ambitious, which makes it even more attractive. I'm sure this place will be very successful. We definitely plan to return soon, especially because of the delicious beef soup we tried, which was perfect.\n\nAlso, I was pleasantly impressed that the price of the tomahawk steak was reasonable and the idea of ​​serving it on a Himalayan salt stone was really cool. This added a unique touch to the dining experience.\n\nAll in all, this steakhouse is a welcome addition to Sunset, and I'm excited for what the future holds for it. Keep it up and much success!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmcnFUUUNnEAE",
            "text": "What a gem! We've eaten all kinds of steak around the World, including A5 Japanese Kobe and Wagyu steak; I can honestly say that the Tomahawk Steak from The King of Meat, was the best steak I've EVER had! The Short Rib soup was to die for, especially on a rainy chilly night. My wife had one of each of the Tostadas and the Guacamole and chips. She enjoyed the entire meal and ate everything. Wonderful people and service as well. Great atmosphere and excellent music too. Love this place and we will be regulars."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6c3R1WTZnRRAB",
            "text": "This restaurant offers amazing service, delicious food, and a cool ambiance. My experience there was outstanding. The customer service, led by owner Roger and waiter Rowin, was incredible. They both went above and beyond to make my dining experience unforgettable.\n\nThe food was spectacular, with everything being fresh and high-quality. I highly recommend the carpaccio appetizer, the unique Weirdo quesadilla with its steak and cheese mix, and the perfectly cooked ribeye served on a Himalayan salt block. Their signature burger is a must-try, especially with added bacon.\n\nThe restaurant also offers a great selection of drinks. I particularly enjoyed the Passion Fruit Margarita. The atmosphere at The King of Meat is unique and chill, with excellent vibes and music that allow for conversation.\n\nTo complete your experience, don't miss trying the Coconut Homemade Flan from their sister restaurant, The King of Fish. It's absolutely divine!\n\nAlso, if you visit after 10:30 pm on weekends, make sure to check out \"The Jail\" downstairs, a trendy speakeasy lounge with a live DJ.\n\nOverall, I highly recommend The King of Meat. It truly impressed me in every aspect!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4d1lyZDRBRRAB",
            "text": "Loved the atmosphere and choice of music. It is great to have a nice diner or just to hang out. Roger was funny and attentive to our table the whole night. Will definitely go back again. Both the food and drinks were amazing."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWbllXOGdRRRAB",
            "text": "Food was on point. My friend said the potatoes were missing some salt but I found them pretty good. The steak was cooked perfectly(we asked for medium to medium well), dirty martini was the best we’ve had in NY. Servers were super nice and helpful. The atmosphere was chill with great music."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiNXF6Z2VBEAE",
            "text": "Great atmosphere! The potato croquettes and wings were good for appetizers! For dinner the Rib eye, garlic mash and asparagus were amazing! Pesto Ravioli pasta dish was delicious! Definitely, a great place for dinner!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURocllXSFJBEAE",
            "text": "Amazing place to eat and have fun! From the drinks to the desert, the environment and quality of the food makes this restaurant a unique experience! The meat is serve in Himalayan salt blocks and most of the plates are real volcanic stone! Just perfect! 🤌🏻 10/10"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYeXIzQmhBRRAB",
            "text": "We went to eat this restaurant because of the name and expected high quality meat. We ordered ribeye steak, and it was the hardest ribeye we’ve ever tasted. It was also served on top of a block of salt. A few minutes later, the ribeye was very salty. We ordered deserts, which were 3 brownies. The brownies were very hard, and they were as hard as the school bread they give to the kids. Not worth the price."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURodTRLZlVBEAE",
            "text": "New Hot Spot Alert!!! New to Sunset Park Brooklyn! Stopped in for lunch and Wow!! Food was on point. James was killing it at the bar. Drinks were phenomenal. Not too strong. Not too sweet. Just amazing. Come check this place out. You're welcome in advance!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKd1B2dWV3EAE",
            "text": "Roger was the best. We were looking at the menu from outside, he came out and greeted us. We tried the chilaquiles and the Mexican French toast and I gotta say they were absolutely delicious! Highly recommend this place!  Definitely try it out if you’re around the area of Sunset Park."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURsdGJXN0tREAE",
            "text": "The food it’s awesome, the place it’s pretty nice and the cocktails are on the point! If you live around here it’s a good restaurant for spend a nice time!\nWe came back cause now they have brunch and I’m a little obsessed with the caramelized French toast it’s so good the use some condensed milk in the top!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUclBXeXJ3RRAB",
            "text": "food was excellent.  garlic mash potatoes were really good.  the guac appetizer, super fresh and tasty.  i had the filet,  presentation was nice.  served on himalayan salt block.  you cut too much in to it can get a little bit salty but overall still really good steak.  i recommend"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUOF8zTTJRRRAB",
            "text": "Struck gold with this one! I enjoyed every second from meeting the charming bartender on arrival to the waiter Rowin who was very attentive and accommodating. The food is PHENOMENAL. The decor is very masculine and trendy, Music is 10/10. Couldn’t have asked for better service.  Don’t think twice!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwX1BLdFJREAE",
            "text": "The tacos, Guacamole, and huevos Rancheros were amazing. I haven't had beans this flavorful in a long time! The tortillas are fresh and homemade, the meat is amazing and seasoned well, and the presentatuon od the food is beautiful. Its all very fresh. And the cocktail menu is extensive and unique, my mezcal cocktail was smokey and delicious. We also love the open aired windows and ambiance of the beautiful space. I cannot wait to come back and to try the steaks. The owner Roger was wonderful, kind, and has great energy. He was so lovely to our kid, who was enamored! We had a delicious meal, great cocktails, and our toddler loved the food and the vibes! Will def be back to this is new gem."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkb3JIdV9RRRAB",
            "text": "This was truly one of the BEST places I’ve been to here in bay ridge. The food is incredibly fresh and authentic. Drinks are aesthetically and tastefully crafted with TLC. The atmosphere is very pleasant and staff are very attentive and kind. You will not be disappointed!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURybUtTRl9RRRAB",
            "text": "If you’re in New York and have a craving for top-notch meat dishes, The King of Meat is an absolute must-visit. From the moment we walked in, we were welcomed with warmth and genuine hospitality. Our server, Rowin, was incredibly attentive and made sure we had everything we needed throughout our meal.\n\nThe entire staff exudes friendliness, creating an inviting and relaxed atmosphere. To top it off, the owner, Roger, made a special visit to our table. His down-to-earth personality and genuine interest in our experience added a wonderful personal touch to our evening.\n\nThe food itself? Simply outstanding. Each dish was crafted with precision and a deep understanding of flavor. The King of Meat truly lives up to its name. If you’re seeking a memorable dining experience with exceptional service and a welcoming vibe, look no further. This place is a gem!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNScVB2MnZBRRAB",
            "text": "This restaurant was amazing! All the meat experience was so different and unique, they brought the stake is a humongous peace of Salt!  So flavorful and good.\n\nIf you are looking for some good Meat Restaurant, I DO RECOMMEND YOU to come here."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkbG8zdDd3RRAB",
            "text": "THE KING OF MEAT IS AN UNDERSTATEMENT. This place is unbelievable. The atmosphere is great, food is outstanding and the staff go above and beyond. I’d highly recommend taking a look at the drink menu, it’s super unique and will blow you away with flavor. The food will have you more than satisfied and will have you coming back for more without a doubt."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5N29qQ2FnEAE",
            "text": "The place was excellent. A bit dimly lit but not a real problem. The service was exceptional and attentive and the food was excellent. As well as the drinks. Me and my gf enjoyed every minute."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3bnVHeUF3EAE",
            "text": "This place has a great vibe, great music and food. The food was delicious. Presentation was superb. The staff was extremely kind especially our server Rowin. We celebrated my sons birthday and they made it very special for him.  I would definitely come back in the future."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkbUlmTjBBRRAB",
            "text": "Great place to come for a drink and snack, the taco was good and the cocktail was delicious. The staff were sweet and friendly. A nice place to hang out with friends or families"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREczZteUp3EAE",
            "text": "We had a great meal. The steaks were great. Cocktails were delicious. Service was delightful."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnbkpDZWZ3EAE",
            "text": "Staff service was very warm and pleasant.  An inviting atmosphere, filled with antiquated decor.  Very original.  Located in, Sunset Park,  Brooklyn, I would have never thought to find a fine quality steakhouse such as this one.  The whole menu is freshly prepared and the meals are exquisite.  Fine dining and less expensive than your traditional Manhattan restaurants."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNScTZfSl9BRRAB",
            "text": "Took my girlfriend here for her birthday, this was a hell of an experience, started off with an appetizer of Melted Cheese w/ Chorizo and some chips, it was soo good, presentation for all the dishes were great.\n\nMy gf has the NY strip and I got the T-bone steak, both were served on a huge quartz stone that probably weighed 5+ lbs, was not expecting that, but solidifies the presentation 😅\n\nSteaks were juicy and practically melts in your mouth. We also got some mash potatoes and Parmesan potatoes, great add-ons that enhances the rich flavors. Can't wait to go back here to challenge myself for the Tomahawk steak."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRbGZTQ2d3RRAB",
            "text": "Went about a week ago, and it was wonderful! The food was great and presented beautifully, and everything tasted delicious! I'd say some of the dishes are a tad bit overly salty for some people, but I didn't have too much of an issue with it. The cocktail and taco names are a hoot, I love all of the style this place has! And the bar had a fun crowd as we watched the Oscars during dinner. Would definitely recommend for a dinner with friends!"
        }
    ],
    "reviews_count": 77
}