{
    "name": "Judy's",
    "place_id": "ChIJKYq5lSpbwokR9bPB0okP-54",
    "grid": "BK7",
    "address": "4022 5th Ave, Brooklyn, NY 11232, USA",
    "rating": 4.6,
    "user_ratings_total": 367,
    "phone_number": "(929) 337-6252",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGMlZsRmZZblJwZG1wUFZFUnBSMFYyVVdkbFZXYxAB",
            "text": "this place is the shit"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxVlpIVjVSbk01YzFSQ0xYcE9WazF2TVVnemRFRRAB",
            "text": "This is a cop bar. A cop sat at the bar explaining how Black people in New York City  do not experience police brutality and denied stop and frisk. After being asked to stop speaking to a Black patron, the cop stormed out of the bar and the bartender came back in to defend the cop and tell the Black patron that everyone has to be welcome at the bar, no matter what hatred they are spewing. After being asked several times to stop trying to lecture a Black person about navigating an aggressive police officer, an argument ensued. The Black patron is no longer allowed to drink at the bar but the cop is which isn't surprising given the owner doesn't allow hip hop to be played in the bar."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSd1ZsSnJiVzF4T0dvdGIyZHdiVzFGVnpkWVgxRRAB",
            "text": "fantastic drink selection at great prices, chill vibes, and friendly people!! It was our first time in brooklyn and nour made us feel so welcome the evenings we came by for a nightcap 💛 also there are a lot of sharks. 10/10"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsblZYbzFaRzB0VWpSQldYaFBZMkp2VjAxSWEwRRAB",
            "text": "Kennedy, Nour, Sam, Hernan, Cilla, Edwin, Zainab,  Matt, Keren are incredible. Amazing atmosphere, great drink selection, a beautiful neighborhood establishment."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGRWNrSkVYMlV0WVVSMU9GQTBla3RaYjBScFQyYxAB",
            "text": "Cool little joint, friendly staff, nice outdoor seating as well"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KVU5FRlBkVWN0YzBGSFltb3RNbG80VGpSNlRWRRAB",
            "text": "Really cozy neighborhood bar. Love the vibes and the outdoor seating."
        },
        {
            "date": "수정일: 2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuX2ZTb0l3EAE",
            "text": "The truth is, it’s such a gem that we in the neighborhood don’t want you to come here unless you add to the vibes. The staff and owner are top tier humans and all the wines and beers are delicious. BYO food"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201S0xYTnRaVzVVTkZoVlIxcG9OblYyY2s5cVEzYxAB",
            "text": "I love grabbing a coffee here in the mornings and getting some work done. Vibes are great, pumpkin loaf is great, music is great. When evening rolls around, I grab a draft drink and relax. Love Judy’s."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwcFpXcEVMVGxwZHkxelVrZENiMjVxY1VoRFVVRRAB",
            "text": "This place has always had an amazing atmosphere! Perfect place to take your friends and chat, plus the staff is super amicable and loves to strike up conversations. Couldn’t recommend this place enough!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOSFRsZHFUMFZVVWtSWWJXRllSVEZoZFhGSVNrRRAB",
            "text": "Cool whimsical atmosphere and super friendly service. Good beer selection. Loved the vibe, will go again.\nBonus points for the giant shark in the bathroom 🦈"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5U05VbzRRWEZVUm5BeFdWcGlkR1EwUjJOWmFuYxAB",
            "text": "Very hospitable neighborhood spot. Literally my shelter from the storm this weekend and what a sweet retreat it was. Good wine, great people."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GWlZtcEhWakl6YVdkb1JIcHVWRlE0YkUxbmNrRRAB",
            "text": "Awesome people, vibes, and surprisingly various coffee drinks. 10/10!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SdlJUbHhlbFJaVm5WTlRXUTJNRkJsWjFKMFowRRAB",
            "text": "Great cold brew"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toeFRUSkhkbkpLZWpabmVsaDZiVE5NWVd4R1RGRRAB",
            "text": "Noor, the bartender, was great!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tod05HSkhSMUZ1TVd4ZmQyTm5kRTlWY2w4M2RrRRAB",
            "text": "I don't remember much about this place but it was the first place my wife and I went on a date after walking through the park so it gets five stars."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SdGFFTjZkSGRTTWxoRlRsVjVUVkl3UWtaM2NtYxAB",
            "text": "Judy’s is a warm, welcoming neighborhood coffee shop and wine, beer, and sake bar. As a local, I have met several locals there and forged genuine friendships. Sam, the owner, is a lovely human who chooses wonderful, smart people to work for him. It creates an environment where folks of every demographic are welcome and likely to strike up a conversation if they’d like, or be left alone! (I used to read there alone for a couple hours every Sunday until I fell in love with a man who spoke to me there.) I love this place and am very grateful for the community it fosters!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCTVFsOUtaRmMyTkMxaFZFSnJNakZxT1RGSVRWRRAB",
            "text": "This has been one of my favorite places for 3+ years! Great selection of wine, the staff are incredible and sweet. I've also made some great friends just by sitting at the bar and chatting. Would recommend that everyone in the neighborhood check it out!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jMWNGcDJSbll3WTBacFFXVm5jRGwzVFRBMVVrRRAB",
            "text": "Although Sam tells me otherwise, I'm 92% certain that I am the reason why the coffee prices went up 25cents. I'm sorry! But not sorry for spending easily 16 to 24 hours a week at Judy's. It's clear that this coffeeshop and bar is my favorite, not just in Sunset Park but across Brooklyn.\n\nJudy's stands apart in an age where every coffeeshop looks like the same IKEA showroom and every bar has more TVs than tables. People say it's the hipster bar in town. Idk, I guess for Sunset Park standards it is? But I could roll out of bed and into Judys with my PJs with no shame. And in the evenings, the bar has that familiar flair of late nights in your high school best friend's attic.\n\nThe other thing I appreciate is that Sam is not a absentee owner. Having worked in food service, it's rare to find an owner who isn't lousy, but Sam makes himself visible by spending six days a week (trust me I know because I'm there too much) taking care of the place and making his staff genuinely happy.\n\nThanks Judy's! Cheers 🦈🐅"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0SVJqQXhRbFpoZEdKTmJGWkNhbmxDTmpnMU5rRRAB",
            "text": "Judy’s is a lil local institution. Delicious wines and beers, welcoming atmosphere, friendly and competent staff. My partner and I met here and regularly spend time with other neighborhood friends. We all need a Judy’s."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wTFVURm1jSEl5VDJoUmRrZHhVM1pzTFRSeFQzYxAB",
            "text": "The bar tenders are all gems and the vibe is really nice. Afternoon crowd is the best"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aRGFrNUpRMmxwYldsNVIzWkJTVmhyVFhZeFNYYxAB",
            "text": "One of my favorite wine bars in Brooklyn! Incredibly friendly staff, super laid back vibes, and byof (food). Their wine selection is banging and their prices are a steal. Also best bathroom in Brooklyn!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sV2JtNDJNM1ZmYVRWeVV5MHpaa2haYUZOVmJYYxAB",
            "text": "I have been coming to Judy’s since they first opened. The coffee is perfectly made with love, and the service is so attentive and the bartenders are helpful in guiding people to get the beer or wine that best suits what they’re looking for! They’re so knowledgeable. The atmosphere is so cozy and I always feel at home here. Location is perfect! Highly recommend coming for a date night, group of friends, or after watching the sunset in Sunset Park right in front!  I love this place, it’s the best bar in Brooklyn!!!! ❤️❤️❤️❤️❤️❤️"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tVMk1HNXFkSFZHTjJoU05WQTVRak13ZFRFMU5tYxAB",
            "text": "Judy’s is hands-down my favorite coffee shop and bar in Brooklyn. The coffee? Always a 10/10, with baristas who master the espresso machine like artists (some of their latte art is really impressive!). The drink menu keeps things fresh with a rotating selection of craft beers and wines that never disappoint. I do wish they had spirits/cocktails, but you can’t have everything.\n\nSam, the owner, is also just a great guy. His kindness and community spirit are infectious and it shows - many of the staff have been there for years."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4V1pqbGxjazV4WWprMU5rdGZNV1kzVG1SdE5uYxAB",
            "text": "Love this local spot so much! Great selection of coffee, wine, and beer as well as good vibes inside and outside. :) 10/10 recommend!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205TVZVOWFNRVJwU0ZWMGRVZzBaM0o2VWsxU2NVRRAB",
            "text": "This place is such a vibe. Best afternoon spot to sit and people watch or read or journal. I like to come in the afternoon and start with the lavender latte and switch to whatever glass of white wine they recommend."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kMVdHUTVObXhFYzBOeVduTjFRVUZvTjFSWVJsRRAB",
            "text": "Judy’s is a rare place that feels like a cozy neighborhood spot (not pretentious) but has reallllly amazing wine at reasonable prices. Also every person who works there is extremely kind 🥰 LOVE Judy’s 🫶🫶 fyi they don’t have food but are down for you to bring food in"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sUlFqZElOR2Q1TFhaamJVNTJOV0ZZYzFKTVYxRRAB",
            "text": "After reading through other reviews, it’s hard not to notice the passive-aggressive tone the owner takes when responding to customer concerns. I recently visited this place with a friend. I didn’t have my ID, but my friend did. The bartender suggested that my friend purchase the drinks and give them to me outside. However, in response to another review, the owner claims they “do not serve minors.” That raises a serious concern: if I had been a minor, encouraging someone else to buy me a drink would still be illegal, and that suggestion came from their own staff.\n\nOn top of that, we weren’t even provided to go bags for the drinks, meaning we were left walking around with open containers. For a place that claims to follow strict ID policies, their actions suggest otherwise. Instead of addressing these kinds of situations with clarity, the owner chooses to publicly make assumptions and shift blame in their responses."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25BelRXZEthMGszWVhWSVQydGFSbmhEUTJKQ2FtYxAB",
            "text": "Extremely dis-respectful staff. I Was asked if the drink was to go and said yes. We ended up noticing there was open seating outside with plenty of empty seats (it was raining) so we took a seat to have our drinks. About 10 minutes later the server at the front came yelling at us telling us it’s a different price to stay. (This wasn’t mentioned or shown anywhere in the establishment). Me and my friend were being very quiet and not causing any disturbance. If I was asked to leave in a respectful manner I wouldn’t be leaving this review. But I’m shocked at how someone can start screaming at two people sitting minding their business without being antagonized. I’d recommend this place if you enjoy being treated like garbage. If not go somewhere else."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWalQxZHVVbVZhTXpSUlJFcDFiVGhEVlhOaFgwRRAB",
            "text": "Vibes are immaculate."
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzOE1ibEpREAE",
            "text": "The problem I had a long time ago was solved, the owner attended me spectacularly and thanked me for solving and returning."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJcng4TmlpMktQYXJRRRAB",
            "text": "“This place is beautiful, it really is.” Welcoming to all, charming as could be, and extensive knowledge of delicious wines, beers, and coffees!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvMjhqSlFREAE",
            "text": "I've been meaning to visit Judy's bar for a long time, and I have not been disappointed. The atmosphere is impeccable, there are no annoying sport TVs, the playlist is fire. In the morning, you can get the best coffee in the neighborhood, and in the evening you get the best bar in the neighborhood. In such places, a right bartender matters a lot, and Nora is working above and beyond to turn just great experience into the best one."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURJLWFYakR3EAE",
            "text": "Since day one Judy’s has been a great for am easygoing atmosphere. Great vibe and really great wine!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3dF9YTXRnRRAB",
            "text": "My favorite local spot, gotta get there early on the weekend for a decent spot. Coffee and alcohol what more do you need? Also extensive happy hour times."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3aE9ELTRnRRAB",
            "text": "Love their coffee, beers and wine, and snacks. Great vibe all around."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURncmVQS0hBEAE",
            "text": "Love this place. Go here all the time. They have welcoming staff, an amazing selection of beer, wine, and coffee and a cozy atmosphere."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfdjRQNGxBRRAB",
            "text": "Great spot! Absolutely love it!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfcV9hZ2ZnEAE",
            "text": "I just love this place!\nIt's amazing"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfaHNxdGlBRRAB",
            "text": "Love the décor and vibes of this laid-back joint. The bartender, Nour, was super chill and made excellent beer recommendations. Will def be stopping by again."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfa052dXdnRRAB",
            "text": "The best vibes. That neighborhood spot to grab a beer and take it chill."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQcUx6Zk93EAE",
            "text": "I don't really like how the lady made this last call she said if you're  not my fried and you don't give me tips, you can live.\nI think if it's  not the best way to say go home.  November 20 /24.\nThanks"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzbllDdXRnRRAB",
            "text": "Only come here for their coffee in the morning, compared to last year & now the new barista makes the iced latte so yummy! Definitely recommend the oatmeal cookies w chocolate! They also have a stamp card for the coffee,so definitely get one!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzN2N5ZzRRRRAB",
            "text": "I love the different options of beer. The service is amazing. The person on charge offers water and recommendations according to your tastes."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQza2FQQnV3RRAB",
            "text": "Favorite local gathering spot. Amazing bartenders, wonderful wine selections and homey environment ✨️"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvM1llS0JREAE",
            "text": "I have been associated with Sunset for 40 years, and I am so pleased that Judy's is part of the neighborhood.   Saturday night was vibrant and fun. Great vibe, great crowd, and super friendly staff. SAM and MATT really make a Saturday night evolve from good to great!   If in sunset park, check it out!! Think you might be a \"regular\" here as well."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYdU91TjBBRRAB",
            "text": "Best 🎉🎉…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURudjZPTFlBEAE",
            "text": "Shout out from Maryland. Our favorite Brooklyn spot! We’ll see you at Christmas!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuczlEYVR3EAE",
            "text": "Not as LGBTQ friendly as I thought. OK but slow service. Decent drinks. Expensive."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuLWVfeGh3RRAB",
            "text": "Dan, noor and all staff make Judy's one of the coolest bars in brooklyn 😎.…"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIaXVlbFB3EAE",
            "text": "Hands down best baristas in Brooklyn. Quality coffee, good atmosphere, fun tunes, great owner."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURsMDhtSG9RRRAB",
            "text": "Amazing bar, with the best vibes! One of my favorite, go-to bars in all of NYC. I'm soo happy they're around.\n\nTheir selection of beer and wine is excellent (although I come for the beer). And I love how they're always updating their extremely well-curated menus - always a good variety of new, unique, tasty beers from microbreweries across the country. Seriously, come back a few days later and over half the menu will be different (attaching some random pics of the menu from the past few months).\n\nAnd then the people..awesome bartenders! Cilla and Kennedy are the abs best 😎🍻"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOcV9ieTdRRRAB",
            "text": "We stumbled across this spot to get out of the cold and came across a complete GEM! The selection is great, but the service is what makes this establishment stand out. My husband and I had the BEST time with the help of Nour, guiding us through the best wines and beers. She was friendly, personable, and professional without making us feel “needy” or her being “pushy”. The atmosphere, and selection were great, but the service was top notch."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEd0p6ekpnEAE",
            "text": "After trying many coffee shops around the area, this one has become my favorite one. The inside is very cozy and warm. They have really good coffee and the barista is a nice and friendly person. I wish they had pastries available to sell because I'm always craving for something sweet."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWdVphbXhnRRAB",
            "text": "Great beers. Craft beer is the best here.  There's a place to sit outside or inside. The staff is friendly and will help you out even if you're not a regular. Asked for a beer which I didn't know the name too and they helped figured thing's out. Great place to sit down and unwind for a bit. Would go again 10/10"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwZ0pXYjNBRRAB",
            "text": "This place is the epitome of AWESOMENESS! Chill vibe, great selection of craft beers, and even coffee! They offer pizza or...you're welcome to bring your own food! Great service, not pretentious, what more can you ask for?!?! It's the hidden GEM of Sunset Park!!!!! I also read some of the other reviews and felt the need to comment on them. First of all, the owner is one of the kindest individuals I've ever met. I've seen him show kindness to some of the most difficult people.  If you feel Sam was unkind to you, you're a COMPLETE moron. Sam is kind and patient to a fault! I've been coming here for years, he's spot on amazing!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJNDZiX1l3EAE",
            "text": "Lovely new coffee and tea spot in the area! The coffee was excellent (and well priced for good espresso drinks). Love the decor and friendly staff. They also sell La Colume coffee by the bag if you're sourcing a spot for some good beans. And the pastries looked excellent (they said bagels are coming soon). I can't wait until they open for evening wine and beer hours."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3a3R2eE5BEAE",
            "text": "Stopped here after going to Thomas VanDyke art gallery and exploring Sunset Park for the day.  Amazing matcha lattes and delicious chocolate chip cookie."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSZ09DTzFRRRAB",
            "text": "Great little spot to relax, get some work done, or meet a friend or two. They offer a great rotating selection of beers, wines, and sakes, and for those looking for non-alcoholic options, they offer a great “IPA” and a Phony-Negroni."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURZNy1Ec3hnRRAB",
            "text": "The best, seriously.\n\nEnvironment is hands down the most chill ever.\n\nPerfect spot to grab coffee in the morning & drink in the afternoon.\n\nOwner takes an active interest with his customers, provides top notch service, & provides the best atmosphere.\n\nAnytime I come to New York, this will be my forever spot"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLdjZMQXJBRRAB",
            "text": "Unassuming bar with a short but good tap list, and a great selection of cans and bottles. Indoor and outdoor seating. Great service."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpc01Mcm1RRRAB",
            "text": "Good and varied selection of beers and wines (conveniently sold by the glass). Nice seating and polite staff which help you out with the menu."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNscGJhT093EAE",
            "text": "Neighborhood gem! Great selection of craft beers, drafts and wine… chill atmosphere and Nour is the coolest bartender ever!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZcDlXWXJBRRAB",
            "text": "I first went in for coffee, which was very good. Then I saw a sign saying find could be brought in. It was great to be able to bring my lunch from the Deli on the opposite corner and enjoy it with my beer - or three. I will probably go back there for my evening meal. The internet is also very good."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4bnJlZkdnEAE",
            "text": "Here are a few things why i love this bar:\n-Drinks are great.\n-Beer selection rotation is often and always a nice surprise.\n-Staff actually super nice. One of the nicest around Brooklyn for sure.\n-Small and cozy space.\n-Spacious outdoor area (even in winter with space heaters)\n\nBest bar in the area hands down"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWc1pHMXFnRRAB",
            "text": "I was staying in Sunset Park and found this cozy bar, went two nights and both were really nice, the beer, the wine and the hot chocolate were perfect! The whole atmosphere was comfy and warm.\nIs the perfect place to go for a drink by self or accompained.\nThe music selection and the volume were also perfect and Sam (the bartender and owner) specially kind and funny (:"
        }
    ],
    "reviews_count": 65
}