{
    "name": "Luigi's Pizza",
    "place_id": "ChIJV__HFOZawokRBgRgfCsQ28I",
    "grid": "BK7",
    "address": "686 5th Ave, Brooklyn, NY 11215, USA",
    "rating": 4.6,
    "user_ratings_total": 2266,
    "phone_number": "(718) 499-3857",
    "reviews": [
        {
            "date": "12시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kSExVZHlaV2RMVFhoR1VrWkRSMVpMZG5oMmVVRRAB",
            "text": "Honestly, if I could give 6 stars I would. Great pizza. The dough is light and crispy but not burnt, the sauce a little tangy but again, not overpowering. It's basically the quintessential New York slice done well. No fancy gimmicks or wacky toppings, just a solid slice.\n\nAnd the price! At $3.25 a slice it's the best pizza for the money. You will not find a slice for less than $5 that will compare anywhere in the city.\n\nOther than that the staff are incredibly friendly, it has that old school Brooklyn charm to it you can't really find anywhere else. And no lines! Great place, I really cannot recommend it enough."
        },
        {
            "date": "19시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVNWF6bFFlWEJHUzFKWGFtdFdkMUEwYUhaMlZXYxAB",
            "text": "Top three favorite slices I’ve ever had and best grandma slice around!! Highly recommend"
        },
        {
            "date": "1일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pWcFpuZDRORmg0U25oWVIwUjRkRFpPUzFaVGJsRRAB",
            "text": "One of the best pizzas in the world probably"
        },
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxelozbERjVmxaZW05bVJrOHhiRVJ3VVhZM05tYxAB",
            "text": "Been waiting to get to Luigi's for months and finally made the trip yesterday!  Met Gio, who is literally one of the nicest pizza guys in the biz.  I had my heart set on a cheese pie but he recommended that I get half cheese and half margarita.  He was right!  Before our pie came out, we had 2 vodka grandma slices.  Oh my gawd!  They were the best slices we had all day!  Thank you so much Gio, I can't wait to come back!!"
        },
        {
            "date": "4일 전",
            "language": "ko",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkemRuUldjVGxEWkZObk5HOVdNak5FVmtJNVdHYxAB",
            "text": "여행 기간동안 3번왔음\n숙소주변이라 찾아왔지만 너무 싸고 맛있어서 계속 방문\n\n여기가 그리울 것 같은 맛\n\n한국인 입맛에 딱임 신선하고 따뜻한 피자"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKelREQmpkR2xZYjJoVU5XbG5NaTFMUzA1VWNsRRAB",
            "text": "good pizza just a little on the thinner side"
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xrNVltRlhiMHRXTUZNM1dHcEdVSGd5YTNKV2RHYxAB",
            "text": "Somewhere along the ragged seam of Brooklyn where the old world still clings on by rusty nails and weather-faded storefronts, there’s a place like this Luigi’s Pizza. A joint that doesn’t give a damn about influencer angles or sourdough crust dissertations. It’s not trying to reinvent the wheel. It’s the wheel and a damn good one.\n\nYou push through those scuffed double doors and you can almost hear the ghosts of every after-school hang, every construction worker’s lunch break, every late-night slice consumed under flickering streetlights. Inside: the smell of tomato sauce that takes zero excuses, mozzarella that melts into the cracks of memory, and the hum of a fridge that’s probably older than half the neighborhood.\n\nThe slice arrives on a metal tray, no fuss grease glistening like a promise. The first bite hits you with that primal recognition: this is the pizza you grew up thinking all pizza would taste like. Before your palate was corrupted by artisanal nonsense and “elevated” cuisine. This is New York doing what New York does best: feeding you, quickly, honestly, beautifully.\n\nPepperoni curls like tiny meat chalices filled with rendered fat the holy water of the boroughs. The cheese stretches just long enough to make you look ridiculous, but you don’t care. Because somewhere in that molten pull, you’re eight years old again, feet dangling off a red vinyl booth, convinced that pizza was the greatest invention in human history.\n\nThe Coke? Served in a paper cup that sweats like it’s been working all day. No craft sodas. No imported sparkling mineral bullshit. Just cola, cold enough to sting a little.\n\nOut on the sidewalk, life moves past you impatient, loud, occasionally absurd. But you sit there with two slices and a drink, and time slows for a moment. This is Brooklyn the greatest country in the world as the sign proudly reminds you.\n\nLuigi’s isn’t nostalgia. It’s continuity. It’s the taste that refuses to grow up just because you did.\n\nAnd goddamn that feels good."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205M1JqWTNjV1ZGZW5rdFgzWkViM2syVDNKRVdXYxAB",
            "text": "Went here to try a new pizza spot the pizza taste was good but personally it was too overcooked for my liking. The atmosphere was nice just an old pizza place with limited seating and listening to the owners stories about the area was nice. Seemed to have a lot of people that watched Dave Portnoy in there but me personally don't like my pizza extra well done but I guess I should of specified but over all a nice place, nice experience."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKZlNscDRTRU5rVjA1cGQxRnNiR1Z3UTB4a1NWRRAB",
            "text": "It’s okay. Nothing crazy, we had the grandma pie and fresh mozza.\nGrandma pie squared and was overbaked, it was hard and crunchy.\nThe other pie was better but tasted pretty bland."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tvd0xWVjJiRE5XVmpJM05XaHdTRVJqTURGaVJIYxAB",
            "text": "Jeremy Allen White said this was the best slice in NYC soooooooooo"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ScWRGVXlkWGxXV213M1dsbFFha052WTNKa1pWRRAB",
            "text": "AMAZING pizza--- completely lived up to the hype. Our pepperoni slices were the perfect crispy/chewy combo. 💪🤟🤟🔥🔥I also had a chance to talk to the owner, and he was so funny, gracious, and kind. We'll definitely be back on our next NYC trip."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xBMGVqSnhSbGR6WkZCNFozaHFTMWR3V2tOQlpuYxAB",
            "text": "I just tried this place and all I have to say is that it was amazing the pizza is just phenomenal I well come back soon"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214WE0ycExPSGxwVEhsNWVUZHdWazV1V1d4TlZFRRAB",
            "text": "Gio is a Brooklyn treasure. He could be a rich man, but he’d rather feed the neighborhood. The only way he can make such a quality product that affordable is by keeping his hands kneeding the dough."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oYWJ6SXRjWHBxVEVsTFIybGhaVTFIWDBSSk9IYxAB",
            "text": "The best pizza place you’ll ever go to. Luigi is always there with the greatest stories! Try the grandma and the plain !"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5S1kwSjZWVWhPVjFSMVdXVXRhVGQ2ZDJaRFVuYxAB",
            "text": "Luigis is the number one when it comes to NYC pizza. Gio the owner actually cares about his pizza and his patrons"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201YVkxaEdRM0JzWmtkaGJIVktja05STjBkRE4wRRAB",
            "text": "Best pizza in Brooklyn hands down."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xwMVdqVklMVzl5U1VKdlIweG1TemhmVjNRNWNuYxAB",
            "text": "Old school NY"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oclkwTldSRmRFVkRadVRHeE9hREJ2TTBsU1RYYxAB",
            "text": "First time trying Luigi's pizza from this location. The slice was thin and the crispy. Perfectly cooked. The cheese and sauce were delicious. Overall a great Brooklyn slice. The square was little oily. Other than that. It was a great experience. The owner is cool guy."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pGTVpFUk9XRkZCY0ZFeGVsWjFNQzFOWjBsSWFGRRAB",
            "text": "Perfect NY pizza. This is the standard all should be measured from in my opinion.  10/10"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CR1dVMTNYMEUyUkdrM1lXRkdWVUpVWHpoalZGRRAB",
            "text": "I’ve been to nearly every iconic pizzeria in New York, from John’s of Bleecker Street to Lucali in Carroll Heights, but Lugie’s was a refreshing reminder of why New York pizza is special. What Mozart is to music, Lugie is to pizza: classic, balanced, and eternally delicious.\n\nWatching the owner work the dough feels like witnessing an artist in motion a quiet devotion that you can taste in every bite. Sitting by the oven on a chilly New York evening, you feel that same comforting warmth of an old family kitchen.\n\nLugie’s pie strikes the perfect chord: crispy yet chewy, tangy yet sweet, and rich with just the right amount of cheese. It’s the standard all New York pies should aspire to."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205VlUzVXRYMUZWU2pneVkwVnFjM1oyUVcxRVpWRRAB",
            "text": "Excellent pizza 🍕🍕 exactly what you would expect and the best in Brooklyn\n\nCrust consistency was spot on. Cheese was delicious and the pepperoni was extremely tasty."
        },
        {
            "date": "수정일: 3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tneWVIcHFZV0Z3ZGpBeWFXaFpkRnBSYkdoQmVIYxAB",
            "text": "Luigi’s, one of the best pizzas in all of NYC. If you want great classic NYC style pizza, this is the joint. Grandma slice is excellent too. Fresh slice is my fav. Best chicken rolls I’ve ever had."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WU00zbHNWVXhwVEdWaWVGbDRPVlZoVTAxNFNHYxAB",
            "text": "Gotta be 5 starts I grabbed a pepperoni and a cheese flat . The cheese was my favorite slice of my life ."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25OUk16UlFkMUoyVlY4eVJWVmFXbVV4YzFGdlgyYxAB",
            "text": "Luigi knows how to make a slice…nice crispy pizza with great sauce. Will be coming back"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkbWFTMDFPRU5aZGxoRGJVdG9jRTl1WWtwNGIyYxAB",
            "text": "Just an absolute classic!"
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1MlIwOHliSFZYY2pseE9DMTZZbkoyVkRReWFsRRAB",
            "text": "They only take CASH! So be ready before you go if you usually only carry a phone like me.\nThey have an ATM there but you’ll need a card"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SYVJGcDVNRVJvYTNsWGFVNVpUa0pJVUhoVmNGRRAB",
            "text": "delicious pizza!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSSldrUjBibTgxUmtJME9YaGhTR3R1WlhsclRuYxAB",
            "text": "Good pizza"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxMGRqSm1iRFk0Y200eFptdGpZVk5XZHpsR2JGRRAB",
            "text": "We visited Luigi's today and the pizza was amazing and lives up to the hype. We tried different slices and all were great! Gio the owner was so kind and took the time to speak and have a picture with us. Great experience and recommend 100%"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURueGFlY21RRRAB",
            "text": "Very nice and cozy Place. Fair prices for a really authentic nyc slice of pizza. Owner super friendly and down to earth- had a quick chat . Support this one - they use the best ingredients possible and an institution in NYC !"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzMU5sUTVObVJRVFdoaVFXcFJNbEV0TlRsQ1ZFRRAB",
            "text": "My slice was burnt Had a very high hope it was gonna be good and long wait."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwdk1DRE1REAE",
            "text": "Luigi's pizza is some of the best in NYC. As of 7/30/23, a slice is still only $2.75. This is what all the crappy pizza places should strive for. It's worth a visit from anywhere.\nOctober 2025 update: A slice is now $3.25."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sSE0yNWFVVkJHZEhkdldWaFBURWh4V21JeU5tYxAB",
            "text": "Top 5 slices in Brooklyn. Very impressed with the quality of the pie being served here. Great crust, amazing flavour! Worth a trip, bring cash."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wSU9EbEtNR0ZHWWpCTldFaHZXbWxVTjNWelVWRRAB",
            "text": "I’ve been to Luigi’s Pizza before and the food has always been great, which is why it was so disappointing to have such a negative experience with the customer service during my most recent visit which was on Saturday September 27th\nWhen we walked in, we politely asked the people in line if they were waiting to order they said they had already ordered and that they were just waiting . We went up to the counter and asked the woman in the blue shirt about a specific kind of pizza. She told us it was in the oven and that others were waiting for it as well. So we decided to go with something else on the menu instead.\nHowever, she never asked if we wanted to place an order or even acknowledged us again. We stood there waiting until a kind Hispanic man asked if we were ready to order. Just as I began to respond, the woman in blue cut me off and said, “Just because you tell him doesn’t mean the pizza is gonna come out faster.” In such a rude and disgusting tone\nWe were shocked not only was her tone unnecessarily rude, but we weren’t even trying to order the same pizza others were waiting on. We had  decided to order something different. Her attitude made both of us feel extremely uncomfortable, especially with other people around.\nI turned to the person I was with and said I didn’t want anything anymore. We didn’t argue or raise our voices, but she still made a final comment, saying something like, “OKAY, just because you want to skip people ahead of you...” which again, was not true at all. We had asked everyone if they already order and they all said yes which is why went to the front\nIn the end, we didn’t order anything and chose to go to another pizzeria. The food at Luigi’s has been great in the past, but the way we were treated by the woman in the blue shirt was unacceptable and completely changed our experience. Hopefully this was just a one off situation, but customer service like that really makes a difference in whether people want to return."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWVGJGRlFkbTVEUTFKSFluUjFTelZyVkd4NlJtYxAB",
            "text": "Best Pizza ive ever had, staff amazing, beyond reasonable prices"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pRd1lWYzJWWGRRU2tkV1NrMVhkRE5aZFcxTWRFRRAB",
            "text": "Great pizza!"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0S1JFNHhjMk00VURodFJqTlZhemhMVFY5Q1NuYxAB",
            "text": "Great slices, thin and crispy, great sauce. Nice old school pizza joint 🍕"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ONGJ6VllaWEJpU1RoNU9GWnRSRWczWkZobmJWRRAB",
            "text": "My new favorite pizza!!! Im kinda mad tho cause you've ruined regular pizza for me nothing will compare lol"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSNVVVaGFjSFJrY1RaQ2VXVlZiVU5YUm14bk9XYxAB",
            "text": "Heard about it online from tik tok being the best pizza in Brooklyn, NY. While visiting, we decided to go give it a try and it did not disappoint. The best pizza I’ve had hands down. So simple yet so delicious."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KcE5ETjFTVmh0TVY5M1NUUlpNRTlSVkRoeVRIYxAB",
            "text": "The owner Giovanni was so friendly to me. Him and I had a great conversation about other pizza places in NYC & Philly. We talked a little bit about football & he gave me a Sicilian slice with pesto sauce for free while I was waiting for my plain pie to be done. That slice he gave me was a lot better than the plain pie. I Gave the plain pie a 9.3 and the Sicilian slice a 9.6. If anybody is ever in New York City or Brooklyn Queens, any of the boroughs, you want a great pizza, GO TO LUIGI’S PIZZA!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tJM1NXVlRja1poWVRVM2VHZFdSSFJhVURaa1pGRRAB",
            "text": "Cash only. Grandma slice with vodka sauce on top was fantastic. Great slices all around."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21FM1VIWXlTalpwYTBweGVqaFFjMmcyU0Y5NU1tYxAB",
            "text": "Simple classic and authentic. The legend himself was making the pizza so was great to see him in action. Only downside is the seating situation. Me and my pregnant wife had to stand and eat outside. But i guess I understand the new york city space life is not the best."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWV1owSm9PRmRwWlRVeWJVTkRhV1J2ZVdaa1kzYxAB",
            "text": "Amazing food and amazing people\nFamily oriented\nVery respectful and beats prices of alot of places\nHighly recommend eating here\nOne bite gave this place a 9.3 for a reason"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pOMWFVbE1hRFpPVkdzMVVqbEtNblZzVXkxVlpIYxAB",
            "text": "Drove one hour only to find out that they don't accept card, should be a good idea to  make a big  banner.(No card, only cash) outside of the store."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ReU5XVTVhbWhKVTI0MGVFdDJibmxtVkd3MVEwRRAB",
            "text": "Solid slice. Classic New York slice. Ok, customer service. Long wait times. Limited seating and can get crowded at times. Street parking only."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOUVVUUTVOWG8yTUhWSFRIcDFlSE00VldoVU5XYxAB",
            "text": "Best pizza of all time"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKSlRURmtUekpLWWkxYVdWUllPVWxRYldWQmIyYxAB",
            "text": "Small Size Pizzeria Dive. The slice I had there was ok. Felt the crust was too hard. Took a pie home and it was much better. The taste was good. Would not give it the rating David Portnoy gave but not bad overall."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pVMk9WUmhNRGhtVkVKUldUbFlXRXBDU1dJeVlXYxAB",
            "text": "I loved it."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21Wek1IRjJWSGh4VVVKMlQxRnNkR1ZUWkRGVlRrRRAB",
            "text": "I will come back was a fresh Brooklyn style pizza."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OZmNGZHZjMHBFWDAxTlYzcDJVRjlpWWxkSU9GRRAB",
            "text": "Super friendly staff. Great pizza. Gotta eat it hot. Great atmosphere"
        },
        {
            "date": "2년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4OWV1UnRnRRAB",
            "text": "맨하튼에서 브루클린으로 와도 될 정도의 피자"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toTGRXMUxkV1JYUkhSeFdVSkpjVFpYWXpobFJsRRAB",
            "text": "One of my dreams was to go to NY and have a pizza pie! Definitely the best I've ever had! Giovanni was a very kind soul and i talked with him just about the whole time i was there about 40 mins. I showed up early for the atmosphere which I was immediately warped back to 1973 days that I pine over and about and witnessed them working hard to get the slice pies together as alot of \"Yorkers\" prefer a slice and a Coke. I myself bought a whole pie sausage and pepperoni my personal favorite! I absolutely recommend this place to anyone going to NY for the first time. Cash only establishment adding to the \"old school vibe\". ❤️ An amazing experience and a dream come true for me. I ended my visit with a handshake and a taste that I won't soon forget!\nThanks Again Giovanni! \"How you doin\"? 🤌 I'm definitely coming back one day and hope to see you again!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xGdVdubElRM2haWTE5bFYzSkZRMFZQWlV0Rk9GRRAB",
            "text": "Place was small and looked authentic with its own character.\nThis was my first NY pizza experience and I went by the good reviews on Google maps. The pizza might be an authentic NY pizza - I have no idea honestly.\nWhat I can say is that this kind of pizza doesn't seem like a good quality in comparison to any proper Italian pizza such as Sicilian, Neapoli or Tonda Romana style pizzas.\nI was really disappointed, both of ours mouth hurt from how hard it was for almost a week - and we only had about 5 slices between us.\nIt might be just the fact that I don't like NY pizza, but in my personal opinion it was terrible. I'll continue trying NY pizas and make an update later."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KR1QxazRWM1pmYW5oeFdtWnZkbFJGYkhkeVoyYxAB",
            "text": "Must stop when in the city and worth the trip. Pizza was amazing and the inside is a time capsule to simpler times. Not much has changed over the last 50 years including the pans, cash register and much more and I love that. A+"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWaE0ybHFlRjlpYnpsME5HcEJUa3hJTjJGWVQwRRAB",
            "text": "Had 3 slices, margarita was my favorite. Just so good. The staff and owner were so friendly and accommodating. I will be coming back  most definitely."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wNFNEaE5URmh0ZGs5cVNuRmlTREpPYW5wa1VHYxAB",
            "text": "In New York for vacation I sought after the best pizza in the city. After many TikTok videos and recommendations I ended up at Luigi’s pizza. Walking in we were greeted by Giovanni (the owner) Brooklyn native and pure Italian, I told him we came all the way from Florida to try his pizza and he went back and made the pie himself. We sat in a small cozy dining area in the back of the restaurant while waiting for a freshly baked pie. We got the half regular half margarita which was recommended by Gio himself. When the pizza hit the table truthfully it wasn’t there longer than five minutes. The crispy airy crust, fresh mozzarella and marinara made it unresistible. They even gave us complimentary square pizza slice for us to try. Amazing experience. Thank you Giovanni for the hospitality, I can’t wait to visit you again."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmamVpQXVBRRAB",
            "text": "Old school pizza shop with groovy disco music playing outside 😂. Charming neighborhood decor. Reminds you of Brooklyn from years ago The line didn't look too long but I waited about 40 minutes to order and about another 40 for a pie I really just wanted a few slices but after waiting so long decided on a pie. Obviously the place was really busy. Luckily I was able to sit down in the back as it was pretty cold out. The Pizza was very good and while I don't think I would wait that long again if I'm in the area and it looks like I can get in a quick order I'll definitely try it again. Met owner, very cool guy! The pizza was really crispy and has a distinct taste. Tasted great, if you find yourself in the area check it out"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmbjVLUmZnEAE",
            "text": "Luigi’s Pizza has been a staple for 52 years, and it’s clear why: it’s absolutely phenomenal! We wanted to try a little of everything, and they kindly cut the slices in half so we could share and enjoy a bit of a “pizza tasting.” Every bite was incredible, but the fresh mozzarella stole the show — it was hands down our favorite.\n\nWe even took a whole pie home to share with family because we couldn’t get enough. Luigi himself was there, and meeting him made the experience even more special. It’s very much still a family-run establishment with a warm, authentic vibe.\n\nIf you’re looking for true Italian pizza, this is it. One of the best in NYC, and we’ve tried plenty of the city’s hyped spots. Luigi’s is the real deal! Highly recommend."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t3NVduazNaMVJCVjFWVVFsZFZUamhNWlhCVFowRRAB",
            "text": "The true definition of the best pizza in all of New York hands down and what’s even better than the pizza is the owner he is a truly awesome individual"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURneXJUTlpBEAE",
            "text": "Old school vibes pizza place that was on Big Daddy and Barstool! Loved how the man himself was still back there making pies! Family owned, good prices, laid back setting! Definitely worth a slice stop if you’re in the neighborhood!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJV3owNVhxbWRKRRAB",
            "text": "Got the grandma slice, pepperoni, and mozzerella slice. The crunch of the grandma was pretty addicting, but the pie slice was mint. Would love to order a fresh pie."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuemJyVF9RRRAB",
            "text": "Wow!!! Like father like son. Quality, taste, sauce, cheese and the crust was so light OMG epic. It was a 10/10 pizza for me. The owner was such a humble person, offered us Sicilian pizza pie for our whole group and we ended up ordering 3 more. Talk about real legacy. What an amazing place and beautiful people.\nIf I am never in NYC again and ever craving a PIZZA, Luigi’s pizza is the place for me.\nLast but not the least the business accepts only cash and if you dont have cash they have an ATM machine 🫣😂 you are WELCOME 🎤💧."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSRGVHaFlabXhPU1ZWTGVHOVFlbFY1VlVWSFNFRRAB",
            "text": "Delicious pie, friendly staff. The owner himself is making the pizzas behind the counter. The cashier recommended I get half and half after just ordering cheese. Would recommend to anyone"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25adlpFMXVWVE5LZFhsM2MxODFZbFpmTnpoWldGRRAB",
            "text": "First time in NYC and tried a few pizzas/ slices. By far the best slice we had in NYC , staff are great and such a nice family run pizzeria.\nAlso Luigi the owner is a top guy!\nRecommend to anyone in NYC and especially in Brooklyn."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21OMFRHWnRSVk5DYVVvNFlsSnZhRXRVTWswNE5VRRAB",
            "text": "Owner is an amazing guy! Very nice, loves pizza and socializing with the patrons who come!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnNnJEM0FnEAE",
            "text": "Went to Luigi’s pizza on a cold, rainy day after being on my to-go list and it was absolutely delicious. The bottom of the slice was crispy, slight drip of the oil, and the cheese was cooked perfectly on top. Dictionary definition of a great NY slice."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WM1RrVXpZamh3YjJ4ak5rSnZlWGQyZFRWcFZXYxAB",
            "text": "Went to Luigi‘s today for lunch we were going to go to another restaurant, but I was at the dealership and the dealer told me forget that place you’ll be so happy when you go to Luigi’s and boy was he so right the pizza was absolutely absolutely delicious. My wife loved it better than the pizzeria is by our house. She said the sauce was phenomenal. The owner was unbelievable. His hospitality towards me and my wife was very precious to me means a lot the service we received the atmosphere. The food was absolutely absolutely unbelievably delicious. Thank you so much for a wonderful Can’t wait to come back again"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkLXBHUnpRRRAB",
            "text": "If you are looking for a great pizza place in Brooklyn, you should definitely check out Luigi's pizza. I ordered the fresh mozzarella pizza and it was one of the best pizzas I have ever had. The crust was crispy and thin, the cheese was fresh and melted, and the sauce was flavorful and balanced. The owner of the place was very friendly and hospitable, he came over to talk to me and found out that I was visiting from London. He was so impressed that he gave me some extra slices for free, which was very generous of him. Luigi's pizza is a classic Brooklyn pizza joint, with a cozy atmosphere and a fast and polite service. I enjoyed every bite of my pizza and I would highly recommend it to anyone who loves pizza.\n\nWill definitely be back next time I’m in New York. The owner was SUPER friendly and the food was INCREDIBLE!!!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNV1pxT1N0bXVYMEpBEAE",
            "text": "Amazing. Thin and crispy..no floppy crust. Cheese and sauce very tasty. Crust soo good you can eat it by itself. Worth the trip from Orange county ny."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2b29YcTFRRRAB",
            "text": "We are visiting New York from Texas. Luigi's in Brooklyn has the best pizza that we've ever tried, and we've stopped at several in New York on our trip. So if you live in New York or just visiting you have to do yourself a favor and stop by for a slice. The owner and everyone there were friendly and helpful. I can't wat to go back."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2cjVIVVl3EAE",
            "text": "Luigi’s Pizza is a no-frills spot that serves some of the best fresh mozzarella slices you’ll ever have — perfectly melted with a crispy, chewy crust that hits the mark every time. The place is cash only, so come prepared, but the minimal wait during a Saturday lunch was a pleasant surprise. With only seating for about 10 people, it’s a tight squeeze, but the pizza more than makes up for the limited space."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmbnJYcEJnEAE",
            "text": "An unbeatable experience for anyone who truly loves and appreciates pizza. Luigi's has perfected the art and science of making amazing pies with unbeatable consistency. The crust has the right amount of firmness and crunch to support and balance the perfect sauce and cheese combination. All of the staff, including Gio are very welcoming and friendly. A must visit while in New York City."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJelF2UDZPX1l6SlBnEAE",
            "text": "Real old school pizza. . Was here last in 2002. The owner gave me 2 pies to take with me to Alaska where I was stationed. Pies were free, pizza was awesome then and now"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkNl9QRFJBEAE",
            "text": "Old school original Brooklyn pizza was the best pizza I have ever experienced. Thin crispy and perfect. I had to try the grandma pizza, the fresh mozzarella, and the pepperoni. All three were pizza perfection, freshly made, and delicious. The restaurant is old school 50's to 70's decorated with memorabilia of Giovanni 's family photos and celebrities who have visited. It is a must stop and get some pizza in Park Slope"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KMWNVcFpjMlEzUzJoWlJtOXRUMDAzWmxZM2VHYxAB",
            "text": "For a place that sells by the slice, the atmosphere was acceptable. The pizza was the best I had on my visit to NY. Thin, crunchy, and didn’t over or unload the cheese. The sauce was not over sweet. It had the perfect amount of flavor. Very good pizza."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKb1B2Q0N3EAE",
            "text": "This place deserves higher praise as one of the best pizza spots in the city.\n\nFamily owned, with a friendly staff, they were pumping out pizzas non stop when I stopped by.\n\nThe plain pizza was the perfect combination of cheese and sauce; the margherita slice was even better. A staple for any NYC pizza list."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkNmFibEh3EAE",
            "text": "A NYC pizza spot in Brooklyn (Park Slope) that you have to try. A fantastic New York pizzeria with Italian sourced ingredients. Zero flop crust, cooked to perfectly crisp. Sauce is bold (Italian tomatoes with no sugar added). Excellent pizza!\nThe seating is very limited, but the staff was beyond helpful!\nBring cash- credit cards are not accepted.\n\nVisited on a Thursday night in February- 6:00 PM and the line was out the door but our order was ready within 15 mins (a whole pie)."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5cGNpeDFRRRAB",
            "text": "I wasn't sure what I was expecting as Luigi's has been touted as the legendary classic that has been scored highly.  My experience has been not quite as high scoring, but it's a decent slice right out of the oven fresh.  The dough could use a little more development for additional flavor, the sauce could use more oregano and basil.  The cheese produced the above average oil slick, but not enough not to eat the pie.  The price was reasonable at $2.25 per slice.\n\nOverall a nostalgic legend"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMcWEtTjVnRRAB",
            "text": "Wonderful pizza joint and the best in Brooklyn. Family-owned business that truly takes pride in everything they do. Serving the best quality food to all the people that visit their famous shop. The owner Gio is incredibly kind-hearted soul that works effortlessly to make his establishment as special as it is. He takes time to talk to all his customers and wish them a good day while also serving pizza counter with his employees. After living in Brooklyn for 2 years, I finally checked this place off my bucketlist and am now forever a loyal customer. Had a wonderful conversation with Gio and got to meet his son. Pizza of course was amazing! This NYC old school pizzeria deserves to be recognized every day and continue to live out its legacy as one of best spots in Brooklyn. Much love to whole establishment!!! ❤️🍕❤️"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5aDhIbFJ3EAE",
            "text": "Came here because of portnoy’s review and it really lives up to the hype.\n\nFirst off the pizza nice thin and crispy. Absolutely amazing pizza. The lady at the counter was super sweet. The vibe of the restaurant is from the 80s or 90s. They even have an old cash register which is completely analog. Not only is the cash register old but so are their pricing. Compared to many other pizza joints, this place has still retained its pricing meanwhile fighting inflation.\n\nAbsolutely a 9/10 for this place."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzNTlQUnh3RRAB",
            "text": "Possibly the best slice shop in the 5 boroughs right now. Nothing I say will do this place justice.  Go to YouTube, look up the review on the Barstool Sports/ One Bite pizza review page and know that I agree with everything about the review. Simply put, amazing slices."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGbXZ6ME5nEAE",
            "text": "An absolutely amazing spot in Brooklyn for a New York slice! We got a classic cheese, a Grandma, and a fresh mozzarella. They were all delicious and everyone had a different favorite. The seating is very limited, but the staff was beyond helpful!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tFdFdVMVFWbU0wTWsxeVJIVk5TV05wZERseVEzYxAB",
            "text": "Gio is the best.  We tried all the brooklyn  pizza places, and this is number 1. That is saying a lot because they are all excellent pizza places  in the area .  Thanks for treating us like family!"
        }
    ],
    "reviews_count": 83
}