{
    "name": "Ocean Eats & Island Treats",
    "place_id": "ChIJUQ_ItbtbwokRFA0IIpbuUwM",
    "grid": "BK7",
    "address": "865 4th Ave, Brooklyn, NY 11232, USA",
    "rating": 4.7,
    "user_ratings_total": 117,
    "phone_number": "(718) 808-8817",
    "reviews": [
        {
            "date": "14시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xM2FGOVFlbmx1VmpsUFVEZFlObXhSVHpNMWQxRRAB",
            "text": "Great food great service 10/10"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxWFNVcEdkR0pVVm5wbWJYVTNhbTlIYUVaQ09GRRAB",
            "text": "Food was GREAT! Seasoned so well"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wRllWSkZUVGxFT1ZWaVJqSnZPRll3VGs1SGJuYxAB",
            "text": "Walked in on a Saturday at 3:30. We were the only customers. No deliveries. No one waiting for food. 40 minute wait. Never again. Good food, good people, and good service keeps people coming this does not."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25KRFFrcGlRVjlPYzI5V2JHZFFiblY2VGtObk1HYxAB",
            "text": "Food there is soooo good"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oWk1EVm5WRU51YkVwd1EzaGZORXAwVWt0b1dYYxAB",
            "text": "We went there to get some good seafood & they didn't disappoint us! The server/cook was very nice and professional about their service. The food was delicious and worth to wait for because they cook it after you put the order in. They have a little place to seat and enjoy the meal with friends and family. Overall a very nice restaurant."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKa2JsY3RYM2gzZWw5SlNtcHpZM3BLUmpkS1NIYxAB",
            "text": "Ocean eats was a great experience the hospitality was very welcoming the cook is very nice and polite the food was awesome and plus more they take EBT SNAP I will definitely be coming over and yrs to come marked as 1 of my favorite spot to eat at"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFNGRGaHFWVlpmUmxWVVRXTTRNQzFLUlUxNk1uYxAB",
            "text": "Example of a great small business that needs to be supported to the fullest.Hospitality and service is amazing,very welcoming…food is freshly cooked seasoned to perfection…we’ll definitely be back and definitely recommend to others."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s5VGFsQlRMVXhWU2tOSVgzQktYMWwwWDBaSVFsRRAB",
            "text": "This is one of the places you must go!!!!! I got the snow crab with some sides and the fish & chips — both were amazing. The food may take a little time, but that's because the owner cooks everything fresh, not just reheating pre-cooked meals. So just be patient, and you'll be tasting heaven 😁. I wish I had tried the lobster too — next time for sure! The owner is a sweetheart, and his food is incredible. I promise you won’t regret it! 👍👍👍"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOYWt5ZXFONXZyOHB3RRAB",
            "text": "Worker Atta was very polite& gave amazing hospitality!! Checked to see if we wanted more food& if there's anything he could help with :) food he made was so worth the money I will come back again !!! 🦞❤️"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoM2IxRkNiWGxrV0c1d1VsWXdMVTVSVGsxUVVXYxAB",
            "text": "Absolutely amazing cuisine thanks to otta had outstanding services towards us overall great time here"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMdllsT2ptdmViOVJBEAE",
            "text": "I love this place. Great customer service, great food & amazing prices especially during lunch hour. Will definitely be back!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNelZvdTJldXQtdHNBRRAB",
            "text": "Very kind service! Just ordered a build your own seafood platter and so far it looks delicious. Kind employee was the only one working and he even brought the food out to our car! 🥹"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJTGJ3S1M0Xy1MSFpREAE",
            "text": "Today was our anniversary and I was dying for seafood and we came here. Mr. Damon and Atta were soooooooo hospitable. We had the Ocean's 13 combo and it was absolutely fantastic!!!! The mussels were my favorite hands down. But everything was delicious. I would recommend it 100%. We live out of state but would love to come back again."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPN2x6LVhTLUw3b1lREAE",
            "text": "I’ve ordered serval times from this establishment.. food is very good,and the owner shows great hospitality 👍"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VQMm9yNXpHeS1EVFpnEAE",
            "text": "Ocean Eats is only opened on Tuesday and Wednesday! On the other days it’s the Caribbean kitchen. Personally I prefer Ocean eats any day. The quality of their food is always hot and fresh. Their flavors are also impeccable. The pricing is also reasonable compared to the amount of food you get. This time I got the salmon and shrimp(2 filets and 6 jumbo shrimps) daily special platter with a side of steamed vegetables flavored with Damon’s mango jerk seasoning. Absolutely delicious! I would’ve gave it five stars if I wasn’t biting into the salmon fish scales throughout the dish. Needless to say, I would definitely order this again."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJaVc0Y09sbGZLUVpBEAE",
            "text": "I had such as incredible, unexpected experience.  I am in the hospitality industry and very picky about service. I was searching for some good seafood from traveling from Long Island to Brooklyn to visit my in-laws for Mother's Day. I read the reviews and saw the photos.\n\nThere was a technical glitch and the owner reached out to inform me and was not supposed to be working but took time out of his schedule to drive out to the restaurant to prepare my order.  He was friendly, warm and provided exceptional service.\n\nOnce you walk into the restaurant, your mouth will water up. When we ate the food, it was well seasoned to perfection. Absolutely delicious and it is a must have for all seafood lovers. We also got fried chicken. My in-laws were looking for me. Don't forget to stop by for your order."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURveGFxX0VnEAE",
            "text": "Thanks for cancelling my dd order after i waited 50 minutes for it"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvalB2ejB3RRAB",
            "text": "I don’t know how this place stays in business. They never have what I want, always sold out, and there is rarely any customer there. The food I managed to get aren’t terrible but can be better. The people who work there are really nice though."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvcFp2NzV3RRAB",
            "text": "Wish I took a picture of the food but the jerk chicken with the Rasta pasta was a solid 20/10!!!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvc3RTWDNnRRAB",
            "text": "With almost a dozen shrimp and a subtlety sweet jollof rice, this plate is filling, flavorful, and delicious. I wish it came with a veggie side like a broccoli rabe or sautéed mushroom and some sort of sauce or gravy but otherwise this is one of their best items on the menu that I definitely recommend trying!"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3bzVQMEZ3EAE",
            "text": "The food is delicious. I really love the salmon and shrimp combo. The owners are super friendly and accommodating.\nWould definitely recommend"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNJNWUtRV93RRAB",
            "text": "I ordered an excellent shrimp, fish n chips to go. It was absolutely delicious.  Very fresh seafood."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3LWNtclNBEAE",
            "text": "I stopped in because I was in the mood for a fried fish sandwich. I ordered the catfish on toasted buttered white bread. The catfish was perfectly fried and there was so much of it, it spilled out of the bread.\nI loved it so much, I’m sure I’m going to order it a few more times before I can broaden my choices."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRbElPV3NBRRAB",
            "text": "Me and my husband went for our first time we are visiting here we haven’t been in luck with good food and decided this was our last shot. I am so glad we tried this place it’s the best place we’ve been to by far I got the shrimp fish and chips EVERYTHING was cooked fresh. The cook even let me see the food before he bagged it. Everything was seasoned just right cooked to perfection I can’t wait to go back tomorrow ! He was very patient and friendly overall my favorite experience here."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRb2RpY0R3EAE",
            "text": "Had this amazing place in Aruba where it was originally from! I haven’t been to this location, but I noticed a changed in menu which I’m sure is phenomenal! But y’all need to keep serving the og dishes that you did in Aruba, I have yet to find a place in the US as good as that in regard to Jamaican/Caribbean food."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnMmRhTTFBRRAB",
            "text": "The food was delicious, and our waiter was awesome."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2M1pHV09nEAE",
            "text": "Food Is Amazing 🤍 I give it a 10 outta 10 food is always fresh may take some time but food is fresh !!! I highly recommend 🤍🤍 enjoy!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2OHRUV1R3EAE",
            "text": "Great food always highly recommended place."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYNWNXbDdRRRAB",
            "text": "This seafood joint is awesome! The food is super tasty, fresh, and the prices are super low. Perfect for a quick, delicious lunch. If you’re looking for quality seafood fast, this is the spot!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYZ05IeFd3EAE",
            "text": "solid food, amazing overall, great people"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuOWV5VGl3RRAB",
            "text": "Food wasn't ready when promised and had to wait 20 minutes.  Food was okay nothing spectacular"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNub2NpTzl3RRAB",
            "text": "Food was amazing! Definitely coming back here after having their fish n chip"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURId09uc3d3RRAB",
            "text": "It's really just homemade fish fillet on supermarket buns for their fish sandwich."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIMjZ6WS13RRAB",
            "text": "My wife and I stopped by to grab a quick bite since we were in the area. We were greeted by the host with open arms. Our intentions were to take the food home but the host was very friendly so we stayed for well over an hour. We even ordered food for the next day and it tasted as if it was just make. This is definitely a place to visit and enjoy some good food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIMXVHbWtnRRAB",
            "text": "The boss is very nice, very welcoming and the food is good too"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIMW9TMlpBEAE",
            "text": "Great food.  Very fresh.  Very good value at those prices.  I’m definitely coming back!  Fish is great, scallops taste amazing"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3ell2RzdnRRAB",
            "text": "This is the best food and service I had visiting NY.  The 2 brothers that run the restaurant are absolutely amazing!! Friendly and fast service 10 out of 10 would highly recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiNGJHRUZ3EAE",
            "text": "Food definitely was great. We had fish,shrimp and chips. Everything had flavor and the owner was very friendly. Even gifting us free drinks on him. Great attitude and personality. Food stayed hot till we got home. Thanks for the great time. Your two friends in bensohurst."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMeWZ2cllBEAE",
            "text": "Their fish sandwich lunch special is very good. Big portion great taste. Check it out"
        },
        {
            "date": "1년 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMeklpd1l3EAE",
            "text": "Le chef est super sympathique et la nourriture est délicieuse. Je suis allé dîner avec ma famille, le chef nous a fait un combo familial qui n'était pas sur le menu. Nous avons eu du poulet épicé et des assiettes de saumon avec des crevettes et des légumes variés. Les portions étaient généreuses et le prix raisonnable. Je recommande fortement! Tous les produits sont frais et préparés sur commande. Bon appétit!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6a3BqTUhREAE",
            "text": "Wow... this place is great. Crispy fish and chips with buttery melt in mouth inside. The fries are good too, not greasy or undercooked. Really fresh. The guy in the back is making everything to order I saw my food go straight from the frier to the plate and he even showed me before he packaged it up to get my approval. All for 15 bucks this is easy two meals for me. 10/10"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqeXZISVlREAE",
            "text": "Great food and great friendly service. My wife and I were in the area and went to Ocean Eats for dinner. We had fish sandwich and salmon with potatoes. Both were excellent. Great taste and large portions. They have a family like feel at that place. I would definitely go back there."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqaXJXSGxBRRAB",
            "text": "Girls get together, stoped in Ocean Eats and the food was fantastic. We were served a Seafood Platter and the food was cooked fresh and it was delicious. The owner was friendly, good service and a great cook.\nMake it a point to stop by. Eat in or take out it's worth the trip."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqdk12UFBBEAE",
            "text": "My husband and I ordered here twice already last month and today and both times the food was delicious. The meals are made to order and they taste fresh and all are a decent amount of food per meal for the price it’s a great deal. A great place to get fresh delicious food with flavor. My daughter loves the jerk flavor it had a kick she’s a spicy lover and I got the mango sauce I honestly can’t get enough my 2 year old daughter shared with me and she licked her fingers. My husband is from Spain he knows good seafood when he has it and he loved everything. We got shrimp which was cooked to perfection the muscles they had absolutely no sand which you can know by that if they clean the seafood. I have not one complaint.\n\nThe first time we ordered we picked it up since it was late and they were closing soon and my husband got to meet with one of the owners they had a wonderful conversation as he finished up with our food and packed it up. He stood late to cook all our food which we appreciated.\n\nThe owners are great people, today we meet the other owner as he delivered our food both very respectful gentleman. They cook and care for you like your family! Can’t recommend eating from here enough whether dining in or out the food is worth it and if you’re there you got great company to talk to while you wait for your food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkZ3RiY2tBRRAB",
            "text": "Food was great. The gentleman who served us was so caring and friendly. We had Calamari, Surf and Turf chicken, shrimp and fish. Yummy!\nWe stayed at L Hotel and Ocean Eats was down the block. We took the food to go but you can sit and eat there. We will be back soon. Thanks Ocean Eats."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwMHJUZERnEAE",
            "text": "Amazing food!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKLW9xNlFnEAE",
            "text": "Nice area and the food here is definitely delicious. Me and my girlfriend definitely will revisit."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSOFlmMGN3EAE",
            "text": "Nice big portions of scrumptious fish! Guy even checked the temp of my fish after taking it out of the fryer ☺️"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSOHNQRm93RRAB",
            "text": "Good food! Good prices! Good portions! My fav is the fried jumbo shrimp paired with jollof rice and mango-jerk sautéed salmon. Definitely a unique and tasty meal that guarantees to satisfy. OE is a must-have!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoeTZ1UmZBEAE",
            "text": "What a great little place for all your fish cravings and the owner is so lovely and helpful. The place is super clean and I loved the Monterey Aquarium stream - so unique. Just a great vibe all around and yummy! Give it a try!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXcnZuWXN3RRAB",
            "text": "Ocean Eats is by far one of best seafood restaurants in Brooklyn. Food and Service is exceptional. Atta was very attentive and personable, an awesome host. Love this place, definitely will be back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoOWRxc1VBEAE",
            "text": "Fish & chips lunch special is a steal and legitimately good. 👌🏽 will definitely order again plus try something else on the menu too"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXNnA3a0d3EAE",
            "text": "Ocean Eats 865 32st and 4ave was a place that only has been open for six months.  I was working in the area and decision to stop at Saks Off Fifth to kill some time and wait for my next work assignment.\n\nAt Ocean Eats I was greeted with such great customer service.  The place was spacious and clean.  I ordered the Shrimp 🍤 and shoe string fries which was priced decently.  It same be a trip to City Island in the Bronx now.\n\nThe also have lunch special from 11:00- 4:00Pm and for students only from 2-4 fish n chips for $7.00.  If on this side of Brooklyn worth stopping by, you won’t be disappointed.  The Bklyn Foodie Chick.\n\nPlease understand…\n\nThe shrimps were  fresh and seasoned close to perfection.  It’s a place to definitely stop by and get your seafood 🦞 plus support melanin business that brings fresh protein to our community."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM2NHRpZWp3RRAB",
            "text": "The food was sooo great I didn’t get a chance take the before pic, definitely must order the king fish and fries combo"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1aUxhVXdBRRAB",
            "text": "My first experience wasn't so much of a good one and I wrote a review and gave it first a 1 star, but surprisingly I got a call from the owner, who was very apologetic about the experience I had, he explain to me that he wasn't there and even offer to give us a free meal, but hey! When an establishment owner can call a customer directly, that shows heart in my book and really deserves an updated review! Thank you sir! On that note, I'll revisit \"Ocean Eats\" hopefully the owner himself will be there this time around and our experience with the food and service will be different!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2dEkycmxRRRAB",
            "text": "Have been here a couple of times since they opened and the food is super delicious. Fish always taste fresh and seasoned very well. The fried fish is perfectly crispy and the steamed options are so tender. My new favorite seafood spot !!!!!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURhMTh6cW13RRAB",
            "text": "Just saw this place pop up, I stopped in and got the Fish and Chips. It was amazing! The fries were crispy and the fish was seasoned and fried to perfection. The store is nice inside and the service was perfect. This place is a great addition to the neighborhood. Going back tonight."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1aHI2WFlREAE",
            "text": "The food here is amazing. I tried the fish, shrimps and chips combo and the portion size is very generous, the fish & shrimps were seasoned to perfection and the owner, Atta is awesome!!! Will definitely be coming back!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoOU5mYzRBRRAB",
            "text": "Clean establishment. Great employees! Shrimps are a must try! Can't leave without getting a slice a cake. My new fish n chips spot!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoOVBmMFhnEAE",
            "text": "The food is delicious  and well cook. The shrimp & fish combo is the best. The establishment is very clean and great customer service with a smile."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNHNThxWUxBEAE",
            "text": "Yes! Yes! Yes! FINALLY!! A really good seafood spot around here! Food is delicious, fresh & plentiful! I got a hefty amount of food for the best price! Owner is a really cool dude too! I will definitely be there often!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXeGRhU1RREAE",
            "text": "Great food!! Owner very respectful and curtious You got to try this place the prices are on point love this place and I will be back. Keep up the good work and that secret sauce is popping😁…"
        }
    ],
    "reviews_count": 62
}