{
    "name": "La Cabaña",
    "place_id": "ChIJZ1jzkHpbwokR5FUcPFFH4-w",
    "grid": "BK7",
    "address": "4503 5th Ave, Brooklyn, NY 11220, USA",
    "rating": 4.4,
    "user_ratings_total": 244,
    "phone_number": "(718) 972-2380",
    "reviews": [
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZemJXRXliR2x6UVRsNWRsbEtZVkYxTjNBNFlXYxAB",
            "text": "Everything was cooked perfectly."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxRVdpMTBOa00yZVZwaFpGcFJUalpPYTI1RmFWRRAB",
            "text": "Incredible from the moment we entered! Great and attentive staff, nachos and salsa were offered and appetizers were appetizing. The music was fantastic and at a volume where you can have conversations. The drinks were made to perfection and exactly how I ordered. The food was even better. Great place to eat if you’re in the Sunset area of Brooklyn."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kZmNscE5jakJxYmxwaFZteHZaVkpyZDI5T1gzYxAB",
            "text": "Amazing food, drinks and hospitality!"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21JMFNHcDVRMGxrTVc5TllWTlpUbEJGTkd4RlZYYxAB",
            "text": "Dejé mi teléfono en ese restaurante y cuando fui\na preguntar hablé con la mesera y dijo que no vio\nNada y el cocinero se enojó conmigo\nNo la recomiendo 👎👎…"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xobmJrZzJWSFJyYTNSSGFtd3paM1p4VlRWVlYxRRAB",
            "text": "Wow….. the best tacos, had the carnitas, pollo asado and carne asada…. reminds me of some house made tacos I had in Mexico City…. A+….. Must try please!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4bldVSmZibXhqWVZOYWVYZHJRelJqVkd0Sk1tYxAB",
            "text": "Great authentic tacos for a very good price. Really friendly and attentive staff despite not being the best with english. Definitely recommend."
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxTVpURnZOMGxHUVVoQlJGcFlNMGh3VjFOQlpWRRAB",
            "text": "Fui a cenar y desayunar unas cuantas veces ahi con mi esposo, pero en la última decidi no volver, pues l@s meser@s le dieron toda la atención a un solo cliente que en primer lugar llegó después que muchos de los que estabamos ahi y en segunda era un señor prepotente, que estaba haciendo uso del lugar como si fuera la sala de su casa, hizo que los 3 meser@s lo atendieran a él y su familia y cumplieran sus caprichos poniendo la tv a todo volúmen en el partido de fútbol, mientras el señor se puso a gritar ahi en medio como si fuese un estadio de fut... un horror la verdad, entiendo que sean amables con el cliente y se agradece pero eso ya es otro nivel, no se si era el dueño del restaurante o que para que recibiera ese tipo de atención,  pero fue muy desagradable para mi, además muchos otros clientes que estabamos presentes nos quedamos esperando a que algún mesero se dignara en atendernos 😕 es triste porque por cumplir los caprichos de un prepotente se pierden a otros clientes."
        },
        {
            "date": "수정일: 3달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WeWFIRjBNSEV0ZVV4Q1ZXdHFValZhWDI4NVJGRRAB",
            "text": "Son amable corte y es un ambiente familiar y acojedor gracias por tratarno bien congratulations"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tscFNIZENSMGhVVVVsQ2RYVlRRV1UzZG1KWFEzYxAB",
            "text": "Buen lugar, exelente servicio y excelente comida bebidas y postres, para disfrutar con la familia"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201dlJFWTFZVlZFY1hOM1NVcFJTRkpNTWtGTVIzYxAB",
            "text": "Great service. Great atmosphere. Great food. Overall a really good, solid choice to eat. Amazing micheladas. Also affordable! 4 tacos & 2 micheladas for under 40$!!!!!! Would definitely come back"
        },
        {
            "date": "6달 전",
            "language": "es",
            "rating": 2,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnTUNZNHVkYxAB",
            "text": "Tienen pésimo servicio las meseras, son muy lentas y a primero a tienden a las personas que llegaron después la comida es buena!"
        },
        {
            "date": "수정일: 6달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmcnJpNDRRRRAB",
            "text": "Muy bien 👍"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJMl9TZkV3EAE",
            "text": "Delicious food. Lovely service. Cool music. Good vibes. Tasty margaritas. Free chips and salsa!"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtcjV1WmlnRRAB",
            "text": "La Cabaña has hands down the best steak tacos in Brooklyn—no question about it! I have no idea how they cook the meat, but whatever they do, it’s absolutely delicious. Juicy, flavorful, and perfectly seasoned, these tacos are a must-try for any taco lover!"
        },
        {
            "date": "7달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3dExtQl9BRRAB",
            "text": "Excelente experiencia, buena comida, buena atención y precios justos"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2bWVXQ3FnRRAB",
            "text": "We really enjoyed every plate , been looking for a home style dish and this is the spot !!! Friendly staff and good margaritas 🍹"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQOHBmcjlRRRAB",
            "text": "Terrible service. The waiter forgot my daughter’s chicken nuggets and fries, despite there being only one other table. Hard to understand how such a simple order could be messed up. Food is mid. DONT RECOMMEND!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzOE95M1RBEAE",
            "text": "Best fajitas, excellent pitcher of margaritas. Best authentic Mexican food in Brooklyn!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5bTVmU3dnRRAB",
            "text": "I love the ranchera quesadilla . Great place for big families and children. So far service has been attentive . Weekends tends to be hard to get a table for a party of 5+ ."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuc0x5UTBRRRAB",
            "text": "Have been coming to this restaurant since 2020. They had an outdoor area. Fell in love, with food , prices and the staff. Hidden gem in sunset park."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIenJPOEZBEAE",
            "text": "this place was horrible, i went on sep 15 to eat a traditional plate called “pozole”, it smelled like fish, it was thick and gooey, and when i reported it that it was going bad , she told me it was normal and the kitchen was closed , so i didn’t eat anything!! , i did not eat it and they took it back into the kitchen , and they still charged for the meal !!!! i left mad and disappointed because i had heard really great reviews about this place , overall 1 star,  if i could , it would be ZERO. really disappointed."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ3NllLb1NREAE",
            "text": "Buenos precios"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURibzRpWnJ3RRAB",
            "text": "Buena atención."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHdzdfRXdnRRAB",
            "text": "Horrible Horrible My Parents and i Just Ate At their Establishment And A Cockroach Came out of My Bread I informed the Waitress That Served us And Her Reply Was The Cockroach is Dead Right ? Her other reply was also ( I dont beleive that came from the food ) Very Ignorant And Disgusting i Asked To speak to the manager And Her Reply Was (Hes Not in Right Now) And Left Me Hanging With the Bill She Has Never Said im sorry to us Eighter I dont Reccomend this Place For Consumption Theres Roaches And Rats And Obviously they Do Not Care About Their Customers  Refrain At All Costs ,Save Your Money And Eat Elsewhere........Very Dissapointed Never coming back here Again\n\nUpdate : Now Were Being Blamed (Placing A Roach In Our food By The Owner Himself ( And wants us to delete the Review Let Me Not Take this review down and File A Consumer report and file a human Rights Report To Get this Place Checked out and Shut Down !!!!!!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyZ01Yd3l3RRAB",
            "text": "So delicious and affordable! Amazing service!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6dGN1T2ZBEAE",
            "text": "Great service and amazing taste. The portion sizes are awesome for the price too! 😝🤟🌮…"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqX2JUS0ZnEAE",
            "text": "Muy rica la comida  😋 👌"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5di02NVJnEAE",
            "text": "Es lo mejor lugar para comer"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5N2NxNjd3RRAB",
            "text": "The food was delicious 😋"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhN29mNEt3EAE",
            "text": "Great roasted meat."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5MnBtM0x3EAE",
            "text": "Uno de mis favoritos en Brooklyn"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNOczVhY3NBRRAB",
            "text": "Todo exquisito en este restaurante, regreso muy  a menudo"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxem9QYmJ3EAE",
            "text": "Food was completely delicious. Had a great time there and place was cozy. The service was fantastic.  Drinks were fantastic and they were able to make me a virgin slushie."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURsaTZUcU9nEAE",
            "text": "nice job"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaaTY2WFFnEAE",
            "text": "Authentic Mexican food. The Sopa de Marisco (Seafood Soup) is outstanding"
        },
        {
            "date": "4년 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN5M3FTbHZRRRAB",
            "text": "Troppo delizioso il cibo,  il prezzo e il servizio sono buoni, la cameriere è gentile.\nSuper rico! Precios y servicio muy amigable y amable.…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURlaGF6Ym1BRRAB",
            "text": "All four taco varieties were amazing. The marinated pork was particularly great. The nachos were also good."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPcDh2RER3EAE",
            "text": "I find myself coming back to this place, even though I don’t live in Sunset Park anymore. My favorite Mexican food in NYC, and at a great price. Delicious!"
        },
        {
            "date": "5년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNDdHJTdzBBRRAB",
            "text": "Es un lugar muy agradable y cumplen con todas las normas de higiene q en ésta época del C-19 la ciudad, está pidiendo, los felicito.\nServico amable y eficiente. Me atendió: Alicia\nLimpieaza y seguridad al maximo."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNtN0xMVGZnEAE",
            "text": "Wowzers ❤\nFood was amazing\nDrinks  we're great\nEveryhing is inexpensive"
        },
        {
            "date": "4년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNHbk9fUjJRRRAB",
            "text": "Después de una jornada laboral muy dura cene muy delicioso.  Un servicio fabuloso."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxbGJyTThRRRAB",
            "text": "the quesadilla con chorizo is amazing ❤\nI dislike beans but theirs is just GOOD.\nDef reccomend this place!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSenVXYVpBEAE",
            "text": "Food is great, portions are huge for NYC. The staff are nice they actually keep their kitchen open till 12am. Good for a trip after working nights.\n\nThe seafood soup is probably the best thing I had from a restaurant in a LONG time."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoNUs3dzVBRRAB",
            "text": "Came with my girlfriend. She had a margarita and I had a Tecate. The margarita was good.\nI Ordered the chorizo nachos and they were very tasty but we only got 8 chips which I felt was strange. I still very much enjoyed it but I was very hungry after."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCOGVmY0d3EAE",
            "text": "I have visited this place with large groups (10+) and they were able to accommodate accordingly. The food is OK for the price, there are more options in the neighborhood but if you want to stop here you will get something that is good enough to not be hungry."
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtNDZITWVBEAE",
            "text": "Muy Mal Servicio\nLa Cabaña. Mi restaurante favorita\nMe encanto la comida es muy delicioso\nPero creo que las meseras tienen que dar un buen servicio.\nOrdene un molcajete y un Menudo\nNo tardo mucho la comida, pero nunca me llevaron platos y cubiertos en la mesa.\nLuego ordene una Amburguesa me mandaron todo frío el Queso.\nY cuando pague la cuenta biene incluido la propina en el Bill🤔"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtejdTcmZ3EAE",
            "text": "One of the best authentic Mexican restaurants in Brooklyn.  Nice  relaxing atmosphere, the food is always good. Never miss an opportunity to grab a bite when in the area. So this time ordered chilaquiles with red sauce and taquitos dorados,…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1MzZPS09BEAE",
            "text": "Thanks for the prompt delivery of food. However, would have been better had they taken extra 5 to 10 minutes to ensure the order was properly made and packed. The guac and chips were good. The milanese de pollo was good. Ordered and paid extra a for \"large\" tacos but what we got instead were dry unfulfilling tacos missing lettuce, pico de gallo, cheese, and sour cream. They only had flan tonight for dessert but it was sub par."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKODllT0RBEAE",
            "text": "Delicious drinks (not over the top sweet) and scrumptious food. Definitely recommend for an afternoon of good eats and good energy. Flautas and carne asada are 👌 as are the free fresh from the frier chips and homemade salsa."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURCemJhaU1REAE",
            "text": "Came for Dinner and Beers, Server was nice, but I ordered a $21 Fajita entree, and when I asked for Sour Cream, I was charged $3.50 for it?? Really?? typically, Sour Cream comes with any Fajita entree in Mexican Restaurants, here they charge for it; cheap and petty owner, oh like $21.00 wasn't enough money for the entree they charge $3.50 for a side of Sour Cream, Ridiculous...also careful if you ask for more chips they will charge you $5.00, lol.... you cant make this up, In my forty plus years dining at Mexican Restaurants this is a first, Food was very average, but some advice, stop being cheap with Customers, especially with your prices, also turn down the music a little bit, no need to blast it to the point people cant hear each other speak, My ears were ringing when I walked out of there, remember your a restaurant not a Night Club....."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5MTgtX19nRRAB",
            "text": "Huge portions, tasty Mexican food, and excellent service. The waitresses were quick and friendly. The vibe isn't great, but the rest is totally worth the visit if you're in the area."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2MVBQZklnEAE",
            "text": "Authentic food! Great tacos! Carne asada was my favorite, al pastor, also the chicken flautas, rice and beans very tasty. Someone in our party ordered quesadillas and I was impressed their tortillas were hand made from scratch. Everyone agreed the food was fresh and flavorful."
        },
        {
            "date": "4년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR5aUppY2J3EAE",
            "text": "La comida muy deliciosa y tienen una gran amabilidad a la hora de servirte,la verdad que si lo recomiendo 100% 👍👍…"
        },
        {
            "date": "4년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURhMUlQSVp3EAE",
            "text": "El éxito y el futuro de un negocio depende mucho de un personal atento y eficaz me refiero en el caso de las meseras a mi punto de vista con todo respeto no está a la altura les falta un poco de más atención con los clientes si uno les pide otra cosa y no tienes que pedirlo una segunda ves porque se les olvidó\nporque la comida muy bien 👍 gracia"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtdzhHcFN3EAE",
            "text": "Everything was fresh, solid ingredients and such a good change of pace from the food where I live currently. Such a satisfying meal! Definitely worth the stop 👍"
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNXb3ZIVUNnEAE",
            "text": "Es bueno ese restaurant pero hoy me deseciono\nLa comida es Buena llevo anos deliver & diner ahi & oh comida para evento de 400$ por pedidido…"
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPcEpTd1p3EAE",
            "text": "Me gustó la comida, solo que los nachos solo nos dieron como 8 nachos y los que yo conozco te sirven un buen de totopos con crema,ques, frijol, guacamole y carne y este ni me lleno y se me hace muy caro para tan poca comida."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPeTVYNldREAE",
            "text": "Nice place the waitresses are nice the food is ok it takes alittle to long to get the food on the table tv alittle to loud for a small place but my family and i were happy to eat at this place we will come back soon"
        },
        {
            "date": "5년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ4aGF6SEFREAE",
            "text": "Súper recomendado, me encanta este restaurante, ahora tienen mesas afuera. La atención y la comida estuvieron excelentes. También venden unos cócteles deliciosos"
        }
    ],
    "reviews_count": 59
}