{
    "name": "La Parada",
    "place_id": "ChIJ61Lcm8FawokRzLKKtwEqrM8",
    "grid": "BK7",
    "address": "855 4th Ave, Brooklyn, NY 11232, USA",
    "rating": 4.2,
    "user_ratings_total": 415,
    "phone_number": "(718) 369-0115",
    "reviews": [
        {
            "date": "3주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GVWNVeDZMVmt3WkVORFpFTkRSMjE0TlRKa2FGRRAB",
            "text": "Very tasty meal and the staff are very nice. The rotisserie chicken was delicious!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201dE5ISjBVVlI1T1ZCNFFtODRTbVp0TUVkV1VVRRAB",
            "text": "Food so blaned I definitely had better from Flatbush"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25GR1RFNUxOa3BrUzBGeVJXTmFVRlJRYjJ4bGJGRRAB",
            "text": "One of the best place to eat don't miss this"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201UVVqWk5MVzFXZFdWNk5EVTRjM2xtVkZnMU1FRRAB",
            "text": "First time ordering Uber eats from them. I honestly got to say it's the best Spanish food I would say in all of Brooklyn. I've ordered from many places and the food is delicious. Would recommend definitely"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xRd1MxbEhXalpUY25RNWFrRmFabVpFUW1aUE9VRRAB",
            "text": "Food was excellent and the portion size was generous. Would definitely return.!!"
        },
        {
            "date": "4달 전",
            "language": "es",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CcWExWktkSFpYTUdRMGFqRlBaR0l3TTNkcE5WRRAB",
            "text": "Comida normal, abundante pero medio cara. La atención es bastante floja, una mala onda terrible para atender.  Me acerque a la cajera y me tiró un “que quieres?”\n\nEn fin, no volveré, pero la comida esta ok"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkblNVTm5kMVJ0YWpBdE1uVlROa05hU1d4aGVHYxAB",
            "text": "Small Place\nFood Is Very Good and I Always Order Some Food To Go. Very Friendly Staff"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIeTZuTXpnRRAB",
            "text": "Try/Get chicken cutlet with white rice & beans that's all you need & they have lots of other stuff on the menu"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJbW1fZUM5d3JHcW9RRRAB",
            "text": "Had their beef stew the meat was tough the rice and beans were bland over priced"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VQRFpfWnZhM2ZhT2N3EAE",
            "text": "Been wanting to try this place for a while now and was hoping to be a returning customer. Safe to say, I won’t be returning. I had high hopes for this local rotisserie chicken restaurant whose roast looks so juicy and tender through the window. I was so disappointed to receive a very DRY whole chicken. Even the dark meat was dry. I ordered the family combo #1 which comes with a whole chicken, large rice, medium beans(pint size container), small salad, 2 cans of soda for $25, the side of maduros ($6).  The beans were bland and had more sauce than beans itself. No complaints about the rice. Maduros were good but nothing to rave about. If you do decide to dine here, they are a cash only establishment."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNveHZQLXNRRRAB",
            "text": "Tried calling in to place a delivery order, female does not speak English. What is the point?"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJenFtNUhnEAE",
            "text": "The best"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRbWNYaTl3RRAB",
            "text": "Everything is so Good! Flavorful!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRN0k2YXdBRRAB",
            "text": "Very good, and friendly staff"
        },
        {
            "date": "8달 전",
            "language": "es",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNncWZLTkZBEAE",
            "text": "La comida no está mal pero el precio muy caro y por último solo aceptan dinero cash un problema para cualquier persona que vaya a pagar con una tarjeta."
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN3MzdMT2lRRRAB",
            "text": "Been coming here for years. Food always hits the spot"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfbm9yRDBRRRAB",
            "text": "Great place to eat"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURmN2VEM2pRRRAB",
            "text": "The food is very good"
        },
        {
            "date": "수정일: 10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQaExpaHdRRRAB",
            "text": "Best Spanish food in the area"
        },
        {
            "date": "11달 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQZzRmSGhBRRAB",
            "text": "Muy amables con los clientes"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuOGRMNS1nRRAB",
            "text": "Deliciosa la comida"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIMzlIZE9REAE",
            "text": "I've been eating here for as long as I can remember. Nothing too special, but definitely homey food that makes me feel good."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUc1lHbkhBEAE",
            "text": "This restaurant quality of food and taste has gone down.  Their beans, from being one of the best in town, taste like just broiled, with no taste.  Very disappointing."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUakpELVF3EAE",
            "text": "El pollo y el pernil es su fuerte y esta muy 😋😋🍗…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5c0pPUUZREAE",
            "text": "Not bad but not very good either."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOZ1l5cVpREAE",
            "text": "The first time I went there I liked the food, even if I saw a rat Outside the establishments I continued visiting, I kept finding strange smells in the food because when it comes to food, I don't care I eat it, I'm not picky, I'm good people and I don't like to put anyone in harm's way, but I tell you something, I don't recommend this place, something very annoying happened to me three times, I will never set foot there again, and I'm really sorry 😞 for the people who don't know it"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxX1BMNnZRRRAB",
            "text": "Buena Comida Dominicana,A Buen Precio,Donde Siempre Se sale Muy Satisfecho."
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGcGVEcEl3EAE",
            "text": "Exelente servicio"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1MmVhWTdRRRAB",
            "text": "The nastiest food I have ever received. guisado de pollo was not cooked thoroughly and had a funny odor as if the meat was not cleaned. Did not take a second bite."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1a1BxUWZBEAE",
            "text": "Ordered takeout through Grubhub, picked up order with the right receipt attached to bag only to find out after bringing home that they put the wrong items in there. Completely different order. Brought it back, no apology or anything. First and last time eating from this place. Lesson learned"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKZ01ybXJ3RRAB",
            "text": "All prices blacked out on the menu… which should have been my cue not to try to order here, but the rotisserie chickens in the window looked so delicious and I was eager to try Dominican food. Once inside, staff made a big show of ignoring me/serving others before taking my order and my cash and then 15 minutes later, after efficiently serving several other customers, giving me the cash back and saying Sorry, Sorry! they didn’t have what I ordered. So, it looked good, but the staff sent a message they didn’t want me to be their customer in a humiliating and deliberately annoying way. Happily, found Industry City a few blocks away with plenty of fun foodie options and no weird vibes."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4bHVhbHFBRRAB",
            "text": "So tasty and my utensils felt premium. The place was clean and my food came in fast."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4bktLcElnEAE",
            "text": "I got a half a rotisserie chicken, small pinto beans and huge amount of rice for $13. Chicken and beans were delicious! The chicken and pork in the warmers looked dried out so i felt safe with rotisserie  chicken. I don’t like places without prices posted. It was very busy around friday at 5:30pm. With food prices constantly going up, perhaps that’s why they don’t post a big sign."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxd1BLcmhBRRAB",
            "text": "Delicious Dominican style cuisine"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtNjdYb3JBRRAB",
            "text": "Great food you have to check it out for yourself.     Mmm bueno"
        },
        {
            "date": "9년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBeDRXdmxRRRAB",
            "text": "I love this place and stop by for a bite whenever I'm in the neighborhood.  Delicious food and great prices.  I recommend getting a plate of goat with rice and beans.  The roasted chicken is good too.\n\nThe women working there when I've visited have all been very sweet.  The decor is simple and no-frills but the food is excellent!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNtcUtUSzVnRRAB",
            "text": "Food is so delicious here!!! We had the rotisserie chicken (juice and just perfect!), tostones were amazing!!! Shrimp with white rice was also finger licking good.  The desserts yummy!! And we even tried dominican soda for the first time!! This is the spot! 😋…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURtOFBqcUJBEAE",
            "text": "Ok but once you've experienced restaurants like these they're all the same. I'm of latin decent as well but I prefer variety. I usually go to spots with more choices. I did try it once or twice and it was ok and I'm sure the food here is good on a regular basis but I look for more. Just my opinion."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQtcTdUTzB3RRAB",
            "text": "Omg the BEST rotisserie chicken in Sunset Park, Park Slope, Bayridge! There food is so tasty and good and definitely inexpensive! I got a combo which consisted of large white rice, medium beans, a whole rotisserie chicken, small salad and 2 cans of soda, All for less than $25 dollars so the price, service and food was absolutely Great 👍 definitely buying again! I have referred now my fam & friends because they’re Dominican Food is outstanding!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ2eVl1dldREAE",
            "text": "I got a rotisserie chicken it seemed as if It was reheated...I got Maduros that looked at the oil was drained inside they were greasy...tostones burned I always use to buy here I'm gonna start looking for a diffrent place to get my…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM4MnZqek13EAE",
            "text": "Small place with great homemade Dominican food, with unique country taste.  Lucia Suriel's taste has been brought to NYC by her daughter Esperanza.  Prices are reasonable.  Although small, the place is clean and the stuff is courteous and friendly."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMwMU9yUm13RRAB",
            "text": "Love the place everytime I go there even when its busy the workers are self sufficient and treat me the customer with attention and food AMAZING there rotisserie chicken like Butter so soft and tender, when they have their day of making…"
        },
        {
            "date": "11년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBelBfSXJnRRAB",
            "text": "Being right next to my house, when I am too lazy to cook I'll pop in for some rice and beans, since there's not many options for a vegan here. Their 15$ for 5$ cocktails special is pretty freaking magical though! Great for pre-gaming without a doubt."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoclpueG1nRRAB",
            "text": "it’s giving hit or miss “sometimes”  an when i put my chicken in the fridge i can still smell a strong odor of it while its in the fridge especially when i open the fridge that makes me wonder because i been putting left over chicken in the…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBNmJYTGVBEAE",
            "text": "The food was very good, but hello we are in 2018 and they don't accept credit card as payment, only cash, so it is an inconvenience since my boyfriend was charged a fee to withdraw money from the atm machine and a fee from his bank who will charge him for taking money out of a non-atm machine. So make sure you have cash on you."
        },
        {
            "date": "수정일: 6년 전",
            "language": "es",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJaWNhVmxRRRAB",
            "text": "Deje de visitar ese lugar ya que a cada ves suben los precios y su porción de comida es muy pequeña. Y cuando la dueña del restaurante se encuentra ahí pues las que atienden le tienen un miedo que le sirven muy poca porción de comida al personal y su precio no los vale. Hace como un año atrás ese lugar se mantenía lleno pero desde que subieron los precios ya el lugar siempre se mantiene con pocas personas. Hay días que el Arroz esta un poco crudo y tanto como la dueña y el personal no son amables con los clientes. No muy recomendable ese lugar para ir en familia no lo recomiendo. Lugar bueno para poder comer una buena comida un buen chivo guisado oh rabitos oh maduros fritos les recomiendo El restaurante Campo Bello 92st.y 5ta avenida Bay ridge Brooklyn. su personal muy amable y su porción de comida es muy buena su comida es excelente vale la pena comer ahí."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNnMkk3aEV3EAE",
            "text": "For legit Dominican on the run and on a dime, this place kills it. Go for the quarter chicken meal with beans and rice, you can't lose. Ordering in Spanish will get you a better price, bonus points if you can put on the Dominican accent while doing so."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN5cjV2cF9RRRAB",
            "text": "When I think of spanish food this is definitely the place to go and enjoy an authentic Dominican home cooked meal! The prices are great and they feed you like mama used to for just a fraction of the price that you would pay for 2 meals. Or maybe 3. If they have the rotisserie chicken grab it because its rarely available and so umm good. The pernil (Roast pork) is just awesome. The fish in garlic sauce is simply amazing. Male sure to order Tostones or Maduro to incorporate with your order. *The girls behind the counter serving your food are hardworking, courteous and friendly- so make sure to tip them. So you can order anything on the menu or just whats visible on the steam table and it'll be really tasty, nutritous and delicious. So stop by cause you won't regret it I promise you.Buen apetito!!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJMnFiY3NnRRAB",
            "text": "I wish I could give them negative stars. Always an issue when you try and order food. Ordered food they confirmed via grubhub and when I get there they say they have no food and cancelled my order. Zero…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNZNGFhcjV3RRAB",
            "text": "The best Spanish food restaurant in Brooklyn. Mondongo is good, the pepee steak is good, their beans are delicious.  Just  not a lot of tables to sit, so delivery or to go is a better idea when going there."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPdXB2ZFVBEAE",
            "text": "Terrible service! No set menu price and they just make up whatever the feel they want to charge. Save yourself the time and aggravation and go to a real restaurant"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURjcEptbEFnEAE",
            "text": "I ordered from here yesterday they offer fresh chicken perfectly seasoned, beans are amazing and rice there food is very fresh and delicious definitely satisfied customer they also have reasonable prices a little pricey but very worth your stomach!!!"
        },
        {
            "date": "11년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3bElUX0pREAE",
            "text": "We get delivery from here to our office all the time. Good and cheap! Tastes like home cooked straight from Borinquen. The pernil (pork) is great, and the sandwiches are surprisingly cheap and delicious. The abechuelas are very different…"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNLNHVXaDl3RRAB",
            "text": "This spanish food place is great!\nEverything here tastes sooo good. Rotisserie chicken is the best, my family loves the food here. We eat here all the time."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNpMExPUXB3RRAB",
            "text": "The food is always great here. The amount of food you get is ridiculous. Combo 1 is enough for a family of 4. The service is always quick and the ladies know how to make sure everyone is in and out. Always will reccommend."
        },
        {
            "date": "7년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnd29XTzBBRRAB",
            "text": "Mal servicio, tienen un precio en el menú y te cobran otro precio y cuando le dije ala señora porque me cobra más ella dice que ese es el precio y yo le dije que porque en el menú sale un precio más bajó y además yo le dije a esa  señora…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBak9PTzVnRRAB",
            "text": "I purchased a ham and cheese sandwich and they gave me 2 slices of ham on a hero bread...like really who does that.  I will never order anything from here again... cheating the customer...and my company orders from here on a daily basis...not me ever again."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLNEtiV2ZBEAE",
            "text": "Love this place! One of my go to places in brooklyn sunset park area. I travel from staten island! To get a great meal for a great price for my little familia this is the spot!. Will be coming back soon!."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNlcVBiQTJ3RRAB",
            "text": "This place is garbage. Too expensive for basic rice and beans. No menus are available in the restaurant, so you have to guess what you want and accept whatever price is asked."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNva1l5MUZnEAE",
            "text": "I hate this place because the food is extremely expensive and not only that the waitresses always be dressing like they want to show off there big tots\n\nAlso one time the nipple popped out and daughter was disgusted so we left.\n\nPlease don't come eat here."
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURPMkk3LVlBEAE",
            "text": "Excelente comida. Gente calida y amable.\nUn gran bankete a bajo precio.\nVariedad de platos y sales con el corazon contento y barriga llena.\nRecomendadisimo para ir a comer y salir satisfecho."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURVNV8yRUdREAE",
            "text": "The service in the day time was great!. Food as good as it gets for the typical Dominican cuisine..the price is reasonable..I'll definetly return 😎…"
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURNbGNMZ0tnEAE",
            "text": "I don't give it a five-star because it's not a Puerto Rican restaurant it's a Dominican restaurant if it was a Puerto Rican restaurant I want to still got four stars sometimes the waitresses have attitudes but the food is great if you want food to go that's the place to go"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBbVBpWkx3EAE",
            "text": "They’re good most of the time but this time around they gave me burnt food. All I was able to taste was smoke couldn’t even finish, lucky it was only $10 dollars."
        }
    ],
    "reviews_count": 64
}