{
    "name": "Cafe Nube",
    "place_id": "ChIJkSr7yctbwokRFW7LWD1o_Oc",
    "grid": "BK7",
    "address": "940 4th Ave, Brooklyn, NY 11232, USA",
    "rating": 4.9,
    "user_ratings_total": 275,
    "phone_number": "(646) 226-3844",
    "reviews": [
        {
            "date": "3시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GNFJUbFRZVWx0VW5KeFNtUlpaa3hyZVdWR2FWRRAB",
            "text": "love this spot, biscuits are so good!!"
        },
        {
            "date": "18시간 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT213NVpuZDJYek0zVkRaTGNXbHFWMjB5ZUZCbVVGRRAB",
            "text": "A block away from 36st N/D/R subway station. I stop by for a quick coffee fix. The coffee is from Oaxaca, single origin. I had an espresso over ice. (I know not the best way to drink espresso) but the quality was superb. The espresso was creamy, rich, and bold. I really enjoyed the taste, and made me want to get a latte or macchiato. I saw their menu of Korean-Mexican infused tacos but did not have time to try them. Definitely interested in doing so next time. From the outside the place is unassuming but nice. Inside it is spacious with plenty of tables a bar against the bar window, a section with plants and framed art covering the walls. Picturesque, unique, good coffee. Perfect for a quick run, a date, or lunch with friends."
        },
        {
            "date": "6일 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xSTGF6SnFjRkJLVDNOc1RtSnpjVXB3VEMxT1gzYxAB",
            "text": "So so, little coffee shop right next to the train station. Can't complain, seemed like nice folks. Burrito was a taco, avocado toast not bad. I'm a coffee dork, it was OK. Not trashing y'all at all. It would be a chill spot to get off the street for a bit."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxV2QwMW5VM1ZxZG1Oc1dIaDRTbXRvVm05aGRYYxAB",
            "text": "Delicioso decaf capuchino - you can taste the coffee even though it’s decaffeinated 😋"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xWbFFXdG9RbTFNV2xGcFFURnFTbXB4YW5GUFNYYxAB",
            "text": "Classic tacos, reinvented with a fresh twist.\n- Korean chicken gochujang chicken, slaw.\n- Sriracha miso tofu sriracha miso tofu, sesame, slaw, sesame seeds.\n- Kale mushroom corn kale, soy mushroom.\nThey all have a great balance of flavors and really complement each other.\n\nThey are located by just right outside of the subway station."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsaFFscG1iMUF0YmpneldWZG5kRjlDWDJwR2FGRRAB",
            "text": "I've had avocado toast twice. It was delicious both times. It's a nice environment for studying or working on your laptop. It's not particularly fancy. In fact, it's very ordinary, but the food is delicious, fresh, and tasty. I recommend it. The service is self-service."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tGalVVMHpSVVJTWW5OQ2MwODNOVUZmV0VZNVZtYxAB",
            "text": "Great tacos, great coffee!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0bllsWnNSREZxY1habmNEUkRjSFphUTJWbFEwRRAB",
            "text": "cute/\nnext to 24hour Deli。"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sRFlYaHhVM1k0YW5OQlMzTkVlbFZKVTJSc1JsRRAB",
            "text": "They were so so nice—I accidentally ordered their breakfast burrito with meat (and I’m vegetarian), and they gave me a vegetarian one free of charge even though it was my bad. And it was delicious! Thank you guys!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25wT1oxbzRlblpmY21GZmVuZEZOMlZvWWxOQmRVRRAB",
            "text": "If you’re in the mood for great tacos and coffee, this is your place! Loved the Korean chicken tacos."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xORVFTMDFhMFk1ZVhKT05IaERla2RQUTFCT1RGRRAB",
            "text": "Yay! Breakfast tacos!!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tNelVHb3hjVlZsZVdzdGRVdFZRbEZPVjJGS1VYYxAB",
            "text": "ADOBABO TACOS WERE ONE OF THE BEST IVE EVER HAD. visiting new york and came across this cafe looking for somewhere to get a snack, cozy and delicious!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aSVMyOXFaa0pZUVRWd1ZIRlZRVkZsVVhSa1JXYxAB",
            "text": "I love the wonderful service here. They will bring you your food along with napkins and utensils. The air conditioning doesn’t cool to the ideal temperature, but it is manageable. The tacos weren’t wrapped unless you do takeout, and it was a bit expensive."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKRVJsWmZRelpaVEcxNlVFbDVUM2MwVUVFNFVtYxAB",
            "text": "Drew was amazing!!! She was kind and patient!!! Very helpful and sweet!!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xU1dFOHpNM1kwWkU1dVpXcDRTVjlGV25sUWFYYxAB",
            "text": "The vegan tacos were not that great. The tofu should be super or extra firm from a good company. The tofu was vey soggy. Also the taste was neutral. The smoothie was the best thing of my food. It was a 5/5 in smoothie and a 2/5 with the tacos. That is why I am giving them a 3. I was expecting more of a restaurant with a 4.9/5"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205WlZtNDJSVkZVVEZaT2NVbE1SV0Z2Y0ZjMGVuYxAB",
            "text": "Great lil hole in a wall spot, fresh, clean food."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paUFRERjRXa293YUhKSGRXcEZRbTk0Ym5OcWEwRRAB",
            "text": "Great little cafe in Brooklyn.!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214cGEzVmtXblZZUmxGWE0wVmpUVkU1ZG1SeGVYYxAB",
            "text": "Friendly, fast service and delicious food/coffee."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJR3JpSV8zb3BTaHBBRRAB",
            "text": "A perfect establishment with perfect food and coffee and of course a beautiful family behind the whole operation. Nube forever 💟"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VKanVqYy1ReGREVTVRRRAB",
            "text": "enjoyed their breakfast biscuit sandwich, next time we'd have substituted the american cheese with the pepper jack cheese and asked the biscuit to be warmed up. that would be absolute perfection. additionally had their mini breakfast burrito and that was just okay. can skip more like the mcds version than I had back in the day, very affordable spot in the neighborhood, six bucks a bite is a deal"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOR08tTEdQX3RMazZBRRAB",
            "text": "Great spot to hang out! Their Mahogany smoothie was fantastic!! It's clean and neat, and the staff is very friendly. I'm coming back"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvb1pDNm5nRRAB",
            "text": "Absolutely delicious tacos. I had the Korean chicken (spicy) and chorizo and both were 10/10!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvMnMtc3J3RRAB",
            "text": "Breakfast burrito was average, did not stay wrapped and had egg shells in it."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBc29EbVhREAE",
            "text": "The coffee is great, VIP baby burrito is a morning staple. Love the salads, too!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfbzZqdkRnEAE",
            "text": "Breakfast Tacos are delicious, coffee and Matcha are the best in the area.\nIt’s a family owned business, as a regular client I can confirm the quality is consistent, the prices are fair and the environment is always welcoming."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfd0lxc09REAE",
            "text": "Perfect breakfast! Highly recommended."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmb2VLSU9REAE",
            "text": "great food"
        },
        {
            "date": "11달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURQaHZmUTNnRRAB",
            "text": "El local es muy agradable y tranquilo. El café de especialidad está realmente bueno y el taco de desayuno también, repetiremos."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQcV8yYWN3EAE",
            "text": "such a hidden gem, loved their cappuccino and coffee. nice and quiet ambience to do work. will come again!!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzNzgzNl9nRRAB",
            "text": "Incredible tacos & coffee! I got the breakfast taco and adobado taco with a cappuccino for breakfast, and it was delicious. I went on Sunday morning at 10AM and there were no lines, very reasonable prices"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYMHNMUWVREAE",
            "text": "High quality food, low prices, and laid back environment. Perfect place to grab a good bite to eat while getting some work done."
        },
        {
            "date": "1년 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYOW9QT0F3EAE",
            "text": "Les muffins sont excellent, faits maison !"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURueDQyTGV3EAE",
            "text": "Ordered the egg & cheese muffin with the chorizo add on. The chorizo was generous — and the egg was silky! The matcha latte was a bit milky and watery, with just a tinge of matcha taste. Great space though, with plenty of seating and outlets."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURudTZ5Vk5BEAE",
            "text": "Nice people, delicious food"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIMXREVDVRRRAB",
            "text": "Always friendly service. Delicious coffee and food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIc05tenFRRRAB",
            "text": "A place that sells good coffee and good tacos. Perfect."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3dXR6RXZRRRAB",
            "text": "Best coffee in the neighborhood. Most consistent barista ever."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3djZLazlnRRAB",
            "text": "Yummy food,\nI had the egg and cheese biscuit and the pork taco  both were delicious and filling. Biscuit was nice and soft, not as full fluffy as I usually like but solid and definitely not dry. They have honey for you to drizzle too.  The Pork taco  was tasty and slow cooked flavors, similar to mole chicken but yet so different!  I’ll definitely be back to try the other tacos and bevs. Pretty chill working space too. They also offer free water and bring your foods to you!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3LU5mTUZBEAE",
            "text": "Incredible coffee and pastries and breakfast tacos! And never too crowded, which selfishly I hope stays the same, but would actually be happy if more people knew about it. So go check it out!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiMU95WktnEAE",
            "text": "Great spot for good food for a decent price. Definitely recommend. Their tacos are delicious"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNiZ2ZHTW53RRAB",
            "text": "Delicious food!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMenZxdmVnEAE",
            "text": "Best cafe in Brooklyn if you ask me. Coffee is great, food is phenomenally tasty (and made quick!). HIGHLY recommend any of the food menu items but ESPECIALLY the Korean Barbeque tacos and the chorizo tacos - just delectable."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMbGZlN3J3RRAB",
            "text": "First time customer and WOW! I had such a pleasant experience. Victoria was the absolute sweetest and gave the best recommendations- I’ll definitely be returning!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMcHFud2NBEAE",
            "text": "Reminds me of a easy coffee shop similar to Starbucks where people eat and stare at their laptops. I ordered the breakfast taco and Korean chicken taco.  Both tacos were well stuffed.   The breakfast taco was delightful with egg cilantro and a bit of chorizo. The Korean chicken taco was well stuffed, tasty and filling.  I'm stuffed from these 2 tacos.  Yummy.  Prices are reasonable. Atmosphere is clean and I think it's fairly new.  You order and take a seat. They bring food to your table.  There is a water dispenser for free glasses if water.  No frills. Paper plates, plastic utensils and napkins. I will be back for sure and try the quesadillas and salad bowls."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6aHQtanhRRRAB",
            "text": "Best breakfast ever! I'm a coffee snub and this is one of the best coffees I've had in NYC. Foamy almond milk cappuccino in which you can still taste a strong coffee. Delicious fresh, flaky bisquets with a generous serving of avocado. Unbeatable prices for the quality of food you get!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUalB2RmpBRRAB",
            "text": "It would easily be a strong 5 stars if the price of the food and drinks were not too high.\n\nI would say it was a really, really good cup of coffee, and the bbq pulled pork tastes out of this world. But the size, for two to three bites it costs about 5 pounds. I think a greater portion would help.\n\nSeriously, i could eat the bbq pulled pork all day if i had no choice too."
        },
        {
            "date": "1년 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqX2FyY3hBRRAB",
            "text": "Magnifico !"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqaTlqQ0xnEAE",
            "text": "Wonderful! The homemade biscuit was so fresh and had great flavor in the sandwich. Very good drip coffee too!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREeDZMNVNBEAE",
            "text": "This place is the best! Both for breakfast and lunch. Also amazing coffee and great service! Love it!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5dWRQZUpBEAE",
            "text": "Updating my review because of the home-baked biscuits. Do yourself a favor, go get them. Ultra high quality!\n\nGreat Matcha & Breakfast tacos. I like my matcha with a little sugar free vanilla syrup. Great place, friendly service. They close a bit early 3:30pm."
        },
        {
            "date": "3년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNleHJYY3l3RRAB",
            "text": "뉴욕 여행의 마지막 식사를 완벽하게 장식해준 식당!!\nGreat food, very kind staff"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURCbXRpRDlnRRAB",
            "text": "The atmosphere of this cafe is so peaceful and relaxing. My friends and I ordered breakfast tacos, BBQ pulled pork quesadilla, Korean chicken quesadilla, quac and chips, a matcha drink, and cappuccinos, all of which tasted A M A Z I N G. The drinks also had really cute latte art and the employees were generous enough to help my friends and I split the quesadillas onto separate plates since we were sharing. The employees brought the food and drinks over to our tables and even gave us a cookie on the house which absolutely surprised me. The staff were super friendly and the food were great. I would most definitely come back again to try the rest of their menu."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyeUxDS0tREAE",
            "text": "Great price, fast turn around and quite tasty. I would have liked some citrus notes on the Chicken and Breakfast Taco. They felt like they were missing one flavor to tie it all together. Granted, I can't do cilantro which I opted out of on the breakfast taco. If you're in the area, check it out! Oh, the GF LOVED the egg biscuit sandwich. Had that great 'homemade' taste in the best of ways."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNaE1YMWd3RRAB",
            "text": "Was craving that mid day coffee and notice the new cafe and decided to give it a try. I ordered an ice coffee and also their taco sampler for lunch. You can immediately tell they take their coffee seriously when you drink it. The tacos…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURPek5fMjZ3RRAB",
            "text": "Such a cute and quaint cafe. The coffee and cappuccino are great! Perfect level of frothy-ness! I ordered the breakfast taco and it was small but delicious! Love the bit of chorizo. It was the perfect bite. Don’t make the mistake I did of just ordering one!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1a2Q3M0xnEAE",
            "text": "Holy cow! The food was delicious. Had the biscuit sandwich with chorizo and a cappuccino. Wife had the avocado toast with a scrambled egg. Wow!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ1cXRIVEpnEAE",
            "text": "I wish this place were closer to my apartment instead of two subway stops away. Really solid coffee shop with a nice space to sit. Not cheap and not overpriced. The kitchen puts out some fantastic snacks too."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSURlZ09BVxAB",
            "text": "I had a delicious iced latte with oat milk and sugar free vanilla. The biscuit breakfast sandwich was buttery and delicious. Such a good biscuit! The Korean taco was very flavorful with a nice little bit of heat."
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyd1ptRWdBRRAB",
            "text": "Lugar amplio con 10 mesas aprox. Rico café y comida (tacos y burritos son pequeños).\nCappuccino $4.25; burrito $5.50; taco de pollo 3.50\n\nBaño solo para clientes.\nMi tarjeta de crédito nunca funcionó aquí."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKLXZ6Ql93RRAB",
            "text": "Best cappuccino and super cute! The breakfast tacos are delicious! Staff is friendly and the place is clean! I’ll definitely come back for the coffee on of the best ones in NY!"
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1MF9pRjVBRRAB",
            "text": "Great service amd banana muffin are so yummy. Moist and flavorful. Tacos are very tasty. Came in after i played tennis with a friend and dropping him off at 36th st station.  Ate everything before remembering to take pictures."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSNXViaEFnEAE",
            "text": "Coffee is always solid. Great selection of pastries (their biscuit is probably the best in the Northeast). Friendly people. Reliable wifi. If I lived closer, I’d be here all the time."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMtMV91djB3RRAB",
            "text": "This place... even after having left the US and traveling Mexico for three week, I still *crave* their delicious Korean-Mexican hybrid tacos. And the breakfast burrito. And the smoothies... I haven't found anything like this in Europe.\n\nNext time I'm in NYC I'll definitely hit up this place again!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoNS1UTmtBRRAB",
            "text": "Was not expecting how good this place was. Stumbled in for a quick bite and a coffee and it ended up being an amazing taco. It’s almost worth making a trip down here just to try their adobado. Coffee was also really good"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5c0pfS293RRAB",
            "text": "Doin’ it right\nI had breakfast tacos and a mocha. The flavors were superb as was the presentation. A great spot to grab a quick bite when you’re in the Sunset."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNLcC12NUJnEAE",
            "text": "Surprisingly good breakfast from Cafe Nube. My friend asked if I want to try their breakfast so I ordered the egg and cheese biscuit with chorizo and their green smoothie. Their biscuit is home made, so GOOD, perfectly combined with the egg/cheese/chorizo. The green smoothie is delicious and healthy.\n\nIt's also well packed. Will definitely try their tacos and coffee next time."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNzLU5HT0pnEAE",
            "text": "Nice decor, good vibe to enjoy a cup of coffee or small snacks. They now have more items on the menu, including VEGAN tacos. Got to try those next time!"
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURLcU1tUjVRRRAB",
            "text": "Very nice and friendly staff. Coffee is awesome. Wish they open one in Staten Island and I will definitely have my breakfast there every morning."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwM29fUUVREAE",
            "text": "Tried this place for the first time today and I really enjoyed it! Very fast service, cute cafe, and really yummy food that was extremely reasonably priced. Definitely will become a spot I frequent often. Thank you!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4LU92RlpREAE",
            "text": "I’ve been wanting to try this place and it did not disappoint. I ordered the baby breakfast burrito and a 12 oz iced vanilla latte w/ oat milk. So so good."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2aWQyX3hnRRAB",
            "text": "This place is the best !!! Super friendly staff quick service! And to top it all off some of the best damn coffee I’ve had! Can’t recommend enough!  Oh wait does that mean more people are going to come here?…. Shoot."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR1aEkyWEtREAE",
            "text": "So happy to have found this new gem! Get the egg and cheese on biscuit. Fluffy eggs and their biscuit is wow! Moist and fluffy too 😍…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1dktIMDZRRRAB",
            "text": "Just moved to the neighborhood and I’m so excited about this spot! Coffee and food was spectacular ( beautiful, clean and tasty!). I will be back and excited to bring people with!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkcC1UeGd3RRAB",
            "text": "Wow.. absolutely recommend this place for breakfast. Coffee is refreshing and avocado toast was amazing. Highly recommend!!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSbU11TnhBRRAB",
            "text": "recently visited nube cafe and was pleasantly surprised by the quality of their food and service. The atmosphere was cozy and inviting, and the staff were friendly and attentive."
        }
    ],
    "reviews_count": 75
}