{
    "name": "FRYING PAN BROOKYLN",
    "place_id": "ChIJNTbYnr9awokRtA4BkZG87kU",
    "grid": "BK7",
    "address": "51 35th St, Brooklyn, NY 11232, USA",
    "rating": 4.4,
    "user_ratings_total": 298,
    "phone_number": "(646) 708-1814",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25aNk16ZDRSa2czVmpSNVYzQnRUVE16U25aVVJIYxAB",
            "text": "I have stopped by here a few times, mostly for drinks but did have dinner here recently. The food is over priced, but it does taste good. If you get the tacos be aware that they are street taco size. I will highly recommend coming here for the drinks and atmosphere."
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oVFkwNVNNbUprZFZSRlNsaDVTa2h0VkhSalYyYxAB",
            "text": "this food was beautiful. honestly the best burger and fries ive had in new york"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oVk1UVlNaVlJ3TVdGMVRuRkRTVVZVVW5KVGRXYxAB",
            "text": "Cool place, indoor and outdoor seating. The service was excellent. The food is very good. The shrimp banh mi was bursting with flavor, I loved all the pickled vegetables. The short rib grilled cheese was more of a short rib sandwich than a grilled cheese but it was delicious. The apples were a nice touch and needed to break up the richness. The fries were well cooked."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201UVpIRjRjVVpUYTBaR01YUktaVGxpU2tSRlJFRRAB",
            "text": "Love coming here! The food is good and I love the music they play. Everyone is always friendly. Clean and good vibes. Decent happy hour as well."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tKcVVFUXdYelZKWW5GYWRUWnJWblo2VTFoc1oyYxAB",
            "text": "I had my first experience with this restaurant this weekend and it was really good. I came in for brunch and got the Brunchy Burger and Brunchy Mary. My burger and the fries were perfectly cooked and flavorful. My cocktail was great too.\n\nI really liked the vibe of this place as it isn't too large, but they have enough seating indoors and outside for larger crowds. The menu is pretty limited, but they have some great food and drink options and the prices are good. Service here is decent also.\n\nOne thing to add is that there are no restrooms here. The restrooms are a little further down on the left in the courtyard.\n\nOverall, even though I saw several negative reviews about this place, I personally had a good first impression and will definitely come back again in the future."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201UVdrSkZaVEZEZUU1dmRWQmhPR3R0U0VVek5tYxAB",
            "text": "Nice bar food. Prices arent too bad."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xdlRHVjZlazl1UTBSTVlUSkZRa1V0YWxkRVMzYxAB",
            "text": "I’m a really picky Negroni drinker , but today i had one fantastic . Not my type of food , but whatever i tried has been good!!\nThe servers and bartenders are really fast and efficient!!\nHad a good time."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WMUxWbGpUbEZMT0VoSmVUUmhXVEZNY2xkc1pXYxAB",
            "text": "The owner was a complete Gentleman to me. I had an altercation that involved an intoxicated patron, and the management staff made sure I was protected and even offered a drink. Much respect.."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aYWQxZERWa2xaVVVkV01UaDJTM0Z2Y21od1VHYxAB",
            "text": "Great service , food and drinks , Esmeralda was very pleasant and engaging ."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201V1owaEtWVXhuUWtnMFZFWkpVR2RWVEV0U1ZXYxAB",
            "text": "Tasty big ole burgers. Brews."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tWaFJXNVFWV3RSTVZaWk1qbHJXbmt4U1VoNFJsRRAB",
            "text": "All good for a quick bite."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xFMFNFZ3laMmRHWTJGdmRXWmlUa2RhUjNwdVEyYxAB",
            "text": "Great friendly bar/restaurant with an interesting array of choices on the menu."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxTFJ6aGFSa3BQWkMxRVVGcDJZMUJEY3pab1puYxAB",
            "text": "Both the food and drink were delicious. They tasted even better with the rapid service that the staff provided"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2taWFRrMVJVbWxtWW5aVVlYZ3lVMUZrT1VSNU5YYxAB",
            "text": "Good and service on point ✨️"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kWWNVMW5RVWhKYm0xcVN6VmtOVFZIZFdWalltYxAB",
            "text": "We had a terrible experience tonight with the bartender with the mustache. We came on a Friday at 9pm and he was annoyed with our presence there. We went to sit by the window and he came over and sprayed the counter on my husband’s hands and said “watch out.” Then when he went to order a drink, he asked some questions about the frozen margarita and asked what tequila was used, he said he didn’t know, with an attitude. Then my husband asked him about what tequilas they had and he was so annoyed and said “well what do you want.” So my husband asked if he was okay because he was giving him attitude and he pretended that he didn’t know and walked away. So we left and went to Barrows Intense Ginger instead and they were lovely. Definitely do not visit this place when this bartender is there."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pjeWJUbENTRkJFTWtGNWNXazFkME41VWxneVIwRRAB",
            "text": "Industry City is the best, and this is our favorite place. The chicken wings are decent (Buffalonian)"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLNnMyLXJPOTduZFpnEAE",
            "text": "Fire everything about this spot. Very good drinks, staffs and food."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZMkl5V1ZREAE",
            "text": "If you’re in industry City and don’t have time to read my lengthy review; for drinks go to Barrows Intense and for food try Hometown bbq, Taco Mix or one of the many Japanese restaurants in Japan village. The service and food at these places are significantly better.\nMy experience: I finally decided to give Frying Pan a try as I always walk past it to and from work. On 4/28/25 at around 7pm I walked in and was met with a bartender/ host who refused to acknowledge me for several mins. For some reason he kept walking right by me. As someone who eats out a lot this was already a red flag. If your business doesn’t have greeting the customers down pact that says a lot in my opinion. I eventually greet him and inquire about seating. He mumbles something and points to empty seating. I order calamari, a lobster roll, fries and a glass of wine. I am not exaggerating when I say none of it was good except for the fries. I mean how can you mess up fries. The wine was supposed to be Sauvignon blanc but it was so bad I don’t believe it (and I’m no wine snob. I’ve enjoyed many cheap wines before)The lobster tasted like it was not cleaned well. Lastly the calamari which is so hard to mess up, was very salty. I picked at my fries and waited for someone to return to ask me how the food was. No one came. The same guy kept ignoring me as I’m staring at him. He just kept Walking back and forth, Clearing tables, bringing out food, etc. I literally had to tap the guy on his arm as he intentionally walked by me for the 5th time to ask him for a moment of his time. Up until then I was literally sat with my untouched food for like 45 mins because I really wanted to give them a chance to make it right but I could not wait any longer. I proceeded to tell him that nothing is edible and that it’s all really bad. He then scoffs and laughs and gives me a nod of agreement and mutters something along the lines of \"yea the food is bad\" and proceed to say he’s the only one here hence the long wait. Not true. I saw at least 2 maybe 3 ppl walk in and out the kitchen. He also stated his manger isn’t present so he can’t do anything about the bad food. Oh he did offer me a free drink to which I declined.\nConclusion: I paid about $58 for a seat and some shelter. Barrows Intense has a fire pit with seats and it’s free. I should’ve just stayed there. For food I recommend bbq joint across from Barrows intense or one of the many food shops in the Japan village. If these places are closed I’d suggest going to the deli across the street or the Latin restaurant on 35th and fourth (La Familia)."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnTUNZc0xFRRAB",
            "text": "Frying Pan has a great offering of menu and drinks with a great staff facing Industry City's cozy courtyard. If the more adventurous offerings of Industry City are not your cup of tea, Fry Pan offers great American faire and has a good brunch."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvOFlDRnN3RRAB",
            "text": "Amanda and the entire team are phenomenal. We were a party of 11 and we were promptly seated and accommodated . It was my best friends birthday and they did nothing short but make her feel special. Shout out to the entire staff. The food was delicious , wings, Mac and cheese, burgers all amazing. I will be back . Also the drinks , passion fruit cosmo 10/10"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvaTR5U1RBEAE",
            "text": "We tried the Mac and cheese, sliders, wings and calamari. We also got lemonades and it was all very good. However I would vote against the Mac and cheese, it was too creamy and flavors were just not it. The wings were soo flavorful, I would’ve made them a bit spicier but they were soo good and I’d get them again. The sliders were good nothing too crazy but they’re a good slider. The calamari was amazing and the marinara provided was even better. The prices were a bit crazy… especially because the only “entree” from their entree section was the Mac and cheese yet they were all on the same price range. To be expected I guess In a place like industry city. Very pricy but food was good."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfNXJ2QkxREAE",
            "text": "Cool spot...Noor took care of us with an awesome marg"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfNW91SEh3EAE",
            "text": "NOOR IS AMAZING she is so caring and loving & is the best bartender we’ve ever had. This is my first time in industry city and we were so happy with our service!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNmbjhiU1pREAE",
            "text": "Second time coming here after moving to Bay Ridge and great experience this time around — good during first visit, better during the second. The fries and wings are delicious. Drinks great quality. And Nour was our server and she was welcoming, energetic and gave great energy making me and my party want to stay longer. I would come back again esp if she’s here."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmbjRhMzdBRRAB",
            "text": "Food was excellent and the service was incredible. Shoutout to Noura especially who ran the bar like a pro"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzOGZqckJnEAE",
            "text": "Great drinks, very loud music, decent food. Friendly and professional bartenders and waitstaff."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzaFBpa21nRRAB",
            "text": "Great people, drinks and food. What more do you need?"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNucE5uSHVnRRAB",
            "text": "Loved their spicey shrimp BahnMi."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIel9hbTZnRRAB",
            "text": "I went just for the blue drink with a duck. Felt like it tasted better previous times I've been there.. jad the jerk wings they were ok."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3bHRXVDd3RRAB",
            "text": "\"The chef Gustavo  has a expert use of fresh, local ingredients, impeccable plating, and masterful balance of flavors made this one of the most memorable dining experiences I've ever had!\""
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3bDdXcWZnEAE",
            "text": "DRY lobster. Not okay at $30. Get Luke’s Lobster instead.\nExpensive food, inferior quality.\nTater tots also doughy and bland.\nWaste of money and calories."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURydjVfVUVREAE",
            "text": "Great summer spot. Food was good and easy to get a table on a Friday night. Will be back!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURybjd2ek13EAE",
            "text": "Get the shrimp ban mi!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMLWFPTlV3EAE",
            "text": "I was looking to eat a warm lobster roll at the restaurants by Industry City and found it at Frying Pan. It was so good paired with a glass of Sauvignon Blanc. Ordered two more to go to bring to my family for lunch.\n\nThe music could be a tad bit lower but over all great experience. The service was great!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMNnVYRXhnRRAB",
            "text": "Fish Tacos, oh my God-ness delicious.\nLobster Caesar, SOB was amazazying"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR6bmJuenFBRRAB",
            "text": "Staff is super friendly me and my girl friend ended up chilling here and grabbing something to eat, located in the perfect market area love it here"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqcmZheTVRRRAB",
            "text": "Absolutely loved the lobster roll."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5Nkx2OXJBRRAB",
            "text": "Terrific bar pretzel—best one I’ve found in south Brooklyn so far—and the bartender boys that work here are super nice. Great place to grab a beer and some wings after work."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkNUpTMVVBEAE",
            "text": "The lobster Connecticut is delicious, and it's right across from a great comic book store."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkMFluY0JREAE",
            "text": "Love going here, love Connor! CY and Gabe are awesome too!!"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNVeWY3Zmt3RRAB",
            "text": "Just revisited.  Drink was delicious.  Soup was so so and not entirely hot on a very cold day.  Fish tacos were fishy and salty.   I don't feel like this location is the best with food."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxbzUzSHZnRRAB",
            "text": "Great spot in industry city to grab food. I’m not familiar enough with this king of spots but it’s worth trying.\n\nThe food was great we tried the Spiced shrimp, grilled cheese & salmon the salmon burger was ok though.\n\nThe service was excellent and we got our order pretty quick. Lot of place for seating and the atmosphere is nice."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxd3VQdF9nRRAB",
            "text": "Excellent taste.  Cool place and so fast service."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxMEltWkFREAE",
            "text": "Nice local bar."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWN2YzVnp3RRAB",
            "text": "I love industry City in my opinion it's a little better than some of the restaurants by Brooklyn bridge Park. The only caveat Is that some of the cocktails made by a very few select places are not the greatest."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsdzVtaFZnEAE",
            "text": "i asked for food without black pepper since i have an allergy to it and i have been very sick evidently it had pepper"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1cUxtVXJRRRAB",
            "text": "CY has shown so much passion and care for us in the first few moments of walking in to see where the amazing smells were coming from - side note food is outstanding- SERVICE WITH A SMILE - UNFORGETTABLE. CY for the WIN!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNab2N6Sk5BEAE",
            "text": "It’s not the original but if you are in Industry City, it’s a decent alternative. They have specials posted on the bar in the center, as soon as you walk in. Check those because it won’t be listed on the menu and the server might not mention it. Full bar with plenty to choose from. It was a couple of bucks cheaper to get my top shelf custom cocktail versus ordering from the signatures on the menu. The short rib tacos are not missing any meat for $20 and you get 3. Each one is like a quarter pound in weight, no lie! Hearty! The Connecticut lobster roll was $30, buttery and the lobster meat was too chewy for me. Maybe the next one will be better. At least one TV is in the spot to view sports on at the bar. Most of the seating is bar type seating. If you want a table, you have to sit in the lobby/common area of the building outside of the restaurant. Cool hang out just avoid sitting in front of the kitchen window at the bar. The smoke will burn your eyes."
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNFaWVqQ0ZBEAE",
            "text": "Super-spacious, super-friendly brunch coffee bar and eatery plus cocktail lounge at Industry City. The menu is tailored for sumptuous long brunches, offering a variety of tacos, sandwiches, lobster rolls, eggs and yoghurts. Coffees can be…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSNy12Q3VRRRAB",
            "text": "Frying Pan is a really nice spot if you want to grab some nice bar food or seafood. Plus, you can get the food and chill outside in the gorgeous courtyard at Industry City.\n\nHighly recommend getting a soft pretzel and enjoying some greenery and fresh air outside. A bonus in my book is that they have some nice refreshing nonalcoholic drinks, alongside their normal bar offerings, if that’s more what you’re looking for."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSejVxamZnEAE",
            "text": "Great spot for food and drinks with a great outdoor space on warmer days.\n\nThe baked wings were delicious. Nice selection of beers and the bartenders are friendly."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURXbWMzcDRRRRAB",
            "text": "It was a busy Friday night the first time we had visited here and immediately we were welcomed like a local. The bartenders were so friendly and inviting and got us waters before we even asked. That night we were there just for drinks and had a few rounds but really loved the staff and the atmosphere. We are both from out of town, Massachusetts & Maryland, and we were exploring and felt so lucky to have found this spot. On our last day there the obvious place for drinks and some eats was this place :-) we came back and were instantly remembered, possibly because we had on Texas Longhorn gear - haha. Amanda and her team are so awesome! We ordered drinks, & we got wings which were exceptionally good! We felt like locals and really appreciated the warmth and charisma that she and her team had. The food was great, the drinks were great, the staff was great, the atmosphere was great, and you can bet that when we are back in town we will absolutely be stopping here again :) thank you Amanda and your team for your excellent hospitality and service, you guys made us feel right at home :)"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNZa3MzSmJ3EAE",
            "text": "Was at the Industrial Park for business and had lunch here.  They have the best staff, so friendly and fun. The food was good too, as was the house made sangria. Had the broccoli rabe and brie sandwich with mushroom soup. Delicious and well priced for the NYC area. Would definitely return.  Also, they have outdoor seating."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvNDRXVUJREAE",
            "text": "This is a cool, throw-back, perfect for an indoor day, room full of active games for kids of all ages. Table tennis, Skee ball, pinball, mini golf, and more. The price is right at $5 per player (play all day!) and there’s decent seating for…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSNDZHWkV3EAE",
            "text": "To die for. A paradise of greasy fried most delicious food. Well worth a heart attack. Had a short rib grilled cheese and broccoli rabe  grilled cheese sandwich. I died and went to heaven"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQyb2Z1cjFnRRAB",
            "text": "Food was tasty and nice outdoor seating area. A bit on the pricey side though."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKOTVhS1JBEAE",
            "text": "A cool spot in Industry City. We sat outside in the courtyard and enjoyed a great lunch and cocktails. I will definitely return when I revisit this area."
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURnN2NfdElnEAE",
            "text": "Good bar. Just need a little better service at the bar. I don’t like the plastic wine cup."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtMXBMdHJBRRAB",
            "text": "Good spot for drinks and food during a fun romp through Industry City. Big fan of the lobster rolls and lobster grilled cheese"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4Mlo3NmNnEAE",
            "text": "Bar & Brewery hopping in Industry City. Dropped by the Frying Pan for some short rib  tacos. They were very good."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwdzdxd2pRRRAB",
            "text": "Food was okay. We had a salmon burger, tater tots and fish tacos. The salmon burger could have had more flavor. We also had a cider (don't recall the name... something with East in its name) and margarita. Both were good. The host was friendly and engaging."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4cXFUalp3EAE",
            "text": "I got food catered back in January for my sisters birthday and I couldn't have been happier with the experience. The staff was incredibly friendly, accommodating and easy to communicate with both in person and via email. They were recommended to me by Fanny, owner of Rue du Paradis (local business neighbor.)\n\nThe food and drinks were delicious with great variations that everyone enjoyed. Everything was fresh and beautifully presented,  they even went above and beyond to provide recommendations and suggestions for pairing the food with drinks. Thank you again! :)"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXeXBQbUZREAE",
            "text": "Place is nice perfect for a hot day cool refreshing drinks and some amazing food"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKZ0tlbUd3EAE",
            "text": "This place has an endless variety of foods and beverages to satisfy anyone's appetite and thirst. The staff is very friendly and accommodating. I had the Pulled Pork Sammy which was mountain sized and cooked perfectly. Moist and tender. I give this eatery 5 stars. Give it a try, you'll be back for more."
        },
        {
            "date": "5년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNzaUpXNHlnRRAB",
            "text": "There is so much good to say about this place. The beer is great, the food is delicious and the staff are super friendly and make you feel like a regular when you barely are. It's great having a place like this in the neighborhood and a home run with kids; you can take them ice skating or miniature golfing between beers."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJX2NyQkdnEAE",
            "text": "If you plan on doing shopping or spending the day in Industry City and in need of some good food - this is the go to spot! Let me just say the food here is PHENOMENAL!!\nThe customer service here is TOP NOTCH !!! they are so welcoming and attentive. As far as the atmosphere it’s even better - it’s so chill , and feels great to sit down and enjoy a meal after a long day of activities.. ( if you have children with you , they have a game room located right across - which makes it super convenient to grab a snack or lunch.They have these SUPER SIZE pretzels ... try it! You won’t be disappointed!!)\nWe ordered a SHORT RIB grilled cheese -  for the meat lovers, I have never had a grilled cheese that tasted so good!! No seriously. But they do have a few different grilled cheese flavors.\nWe also ordered a cheese platter that is great for someone who wants something light or even as an appetizer.\nOh and TRY THE APPLE CIDER .... they warm it up and put a stick of cinnamon... you will be back for more of that - trust me, I know I will!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSZ3NtdzN3RRAB",
            "text": "Great spot. Food was delicious (short rib tacos are exceptional). Good selection of beers too and helpful, friendly staff. Definitely worth a visit away from the main food hall area in industry city complex."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURJNHZlbGdnRRAB",
            "text": "Great time at the frying pan in Industry city. Its a cute little spot with great staff and friendly people. It was first night opening NYC trivia, so I stayed and played the game, which is super fun and would recommend coming here for that…"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBNzlIbnJBRRAB",
            "text": "Nice atmosphere, and the food (a platter of cute little fish tacos) is fine & good. Beers on draught are correct if uninspired. Best option for anything local & superior quality when we were there was in bottle—Flagship Brewing’s IPA."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURoalAyTWtRRRAB",
            "text": "This place amazing!! Our bartender; CY, was so kind and accommodating. He recommended the short rib grilled cheese and it was absolutely delicious. Will definitely be back!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN1MXJXTGJnEAE",
            "text": "The service was excellent here but the drinks were just okay!"
        }
    ],
    "reviews_count": 71
}