{
    "name": "Frankies 457 Spuntino",
    "place_id": "ChIJm7uvMfZawokRNR0XRCotzWY",
    "grid": "BK7",
    "address": "457 Court St, Brooklyn, NY 11231, USA",
    "rating": 4.5,
    "user_ratings_total": 1419,
    "phone_number": "(718) 403-0033",
    "reviews": [
        {
            "date": "5일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25kaGFqSTRNM1UzVW5GRFRWbHNSemw1V0ZodlFtYxAB",
            "text": "All was good . People and  service and place"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSb2FrUkRSVU5tTlZaT05IVmtXR0Z0VnkxalNWRRAB",
            "text": "Super delicious pasta in a lovely setting. Almost recommend coming here for brunch or lunch instead because it can be super loud and busy during dinner and somewhat hard to get a reservation."
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tvM2VVWnJOM0ZYTldWa1RVSkhXRXgzYW5sVVlYYxAB",
            "text": "Amazing food with great service. The cavatelli with hot sausage and brown butter sauce was so good."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201a01FSlVhakJFWldGa1FuSlZSVWw0YldwNVRHYxAB",
            "text": "So happy we chose to host our rehearsal dinner with Frankies in September. We had a private room for 35 people at F&F restaurant & bar with food from Frankies. From the minute we reached out via email, Tucker and the team provided top notch service. Fast forward to the rehearsal dinner: the ambiance, staff, and food were all amazing. It was the perfect way to kick off our wedding weekend in Brooklyn. Thank you!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kWU1YSnlWa1ZqUjI1WVduSXlSWE0yWlVjeFVsRRAB",
            "text": "Had an awesome meal with a group of 8. Food, service, atmosphere were fantastic. Would absolutely go back. Thanks!"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tOSVRUWjJWbGRaTURVelozWTVOek5DZGtSSmFXYxAB",
            "text": "Very slow service, 2hr30 for a Thursday dinner / pretty standard order."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ObFRGZFRTRXN6YmtselpFcEZlbEZ3V1hjeGFWRRAB",
            "text": "Frankies used to be reliably good—my partner and I have come around once a month for the past few years. It has always been a treat. Unfortunately the past two times we came the food tasted strange (our favorite cavatelli was dry; eggplant marinara was a mess; maltagliati was tasty enough; fennel salad thankfully still delicious), the service was horrible (several of the longtime servers we knew were not present and the ones we interacted with kept us waiting 30 minutes to even order and were very brusque). We brought our friends on a recent weekday where it took almost two hours for them to serve two very mediocre-tasting courses and we were frankly embarrassed after raving about Frankies for months. We will be looking for a new go-to spot in the neighborhood ☺️"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toU2FESlpjVGRJVkhkaFdXOWhVREZxTnpOVVNsRRAB",
            "text": "Came here for a private event and the food was amazing. Steak, fish, tiramisu, passed small plates. All amazing. Staff is wonderful."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURsM19xTXBBRRAB",
            "text": "Such a bummer to write, but the experience was bad enough to say something. Frankie's has always been a favorite, I’ve even had friends get married here. So when my partner and I came for date night this past weekend, expectations were high.\n\nShoutout to the hostess, who was lovely and even texted us about bar seats. Unfortunately, our server Nicholas seemed determined to tank the night. It took him 10+ minutes to greet us, and when he finally did, he barely looked up. When we asked for a recommendation on a second entrée, he suggested the gnocchi in red sauce. My partner asked if he meant he recommended the red sauce specifically — his response: “No, it’s bad, that’s why I’m suggesting it to you.” Nice one.\n\nFrom there it was a masterclass in neglect. Ten minutes for the wine, twenty for the first course, thirty-plus for the mains. Each time, dishes were dropped silently and he vanished. No check-ins, no bread (we had to beg another server), no sense of hospitality. Just two and a half hours of being ignored with the added bonus of bad vibes. Dessert, usually my favorite part of Frankies, wasn’t even worth attempting.\n\nNicholas, if people annoy you, that’s fair. But maybe consider a career path where people aren’t the main part of the job."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sR1pHNWphbEZ4UzNWeFlVMVRURFpLVjFGWU4wRRAB",
            "text": "The most disgusting food. Inedible."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25neGVWTmhXbVk0TTNoTlp6RTBUV3RyVld0Wk9GRRAB",
            "text": "The only Italian restaurant I’ve come back to in NYC, you MUST get the fennel salad, cavatelli with sausage and finish with the prunes and mascarpone. It’s fantastic"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21sU1lXTTBWRVJPVTNreVQwNUhVRmxKTlV0eFRuYxAB",
            "text": "Celebrated my fiancé’s birthday here tonight and we both agree that we had the best dining experience either of us have had.\n\nThe staff was so welcoming from the moment we walked in. The food was incredible - clearly so fresh and intentionally crafted. We got the mozzarella tasting, the ricotta honey crostini, meatballs, the sausage pasta, and the gnocchi. All delicious!\n\nI don’t typically write reviews but felt the experience tonight was too spectacular to not share. Thank you to all the staff who made our night so special, your above and beyond mentality and culture is clear and very much appreciated. We can’t wait to come back!"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214YVR6bEllR0ZEYW5oM2JraDBObTlvVGxScllsRRAB",
            "text": "Enjoyable dining experience. We arrived early and found a table ready for us. After a couple of small plates for appetizers, we enjoyed savory crepes, a delightful chicken and sausage dish with potatoes and a delicious gravy, and two pies.The guanciale and leek and the sweet red pepper pies brought a perfect balance to the other entrees. The crust was excellent, with just the right amount of char."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xbE0yVkZjRjlMZFZsRFZFWkdaMWN5ZVVjd04yYxAB",
            "text": "Its a reliably good meal and I always invite friends to go here when they're visiting. The garden seating is relaxing and a nice atmosphere (though there can be mosquitos in the summer- so make sure to wear some kind of deterrent). The meatballs are some of the best out there - reasonably priced, a great texture, and plenty of sauce. My favorite pasta dish is the cavatelli with hot sausage, there is a light spicy note to the dish, but very fatty sausage. If you are watching your heart health, then have a friend eat the sausage. My second favorite. pasta dish is the gnocchi - super soft pillowy gnocchi. The only thing holding this dish back is the tomato sauce was a bit watery - probably from placing the gnocchi in the sauce after its prepared rather than letting the gnocchi cook in the sauce. The ricotta honey crostini is always a delightful appetizer - it is something that can easily be imitated at home, but is a reliable starter. Their various salads are usually pretty good as well but portions are small. The service is always nice and courteous. I love the soft bread and delicious olive oil that they place on the table. Overall, a lovely place to take a friend or family member."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xdlZWTXdaVmxJTldGRWVrVjFXbk5rVjFGYWNFRRAB",
            "text": "Top notch Italian spot. Walked in with a hungry group after an all day event, and everything we ate hit perfectly. The eggplant marinara, meatballs, cavatelli with hot sausage, and Matagliati with boar were particular standouts. Definitely will revisit."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21acWIxZzJSMFJuUzBwalVWQlZkMU0wZGpScGRGRRAB",
            "text": "Good"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25jd01qbHBaRzB0WkhWeE4zcElkVnA0YUV4SU5tYxAB",
            "text": "Charming garden seating and fresh handmade pasta."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214bGMxaDJkR1Y0UTI1YU9UUkROMjl6ZGxwdlgwRRAB",
            "text": "Best gnocchi I’ve ever had"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0eE1rZDROR3QxVkVkWlVqbFhTRWRRYWt0dGQyYxAB",
            "text": "The best! Delicious food and extraordinary service"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210MlpEa3lPVlJ1YlRCUmFFMWFiMkYxUnkxcU1GRRAB",
            "text": "Ordered the Eggplant Parm the Sausage Cavatelli and the Beet Salad. I would highly recommend all of those dishes. Paired well with the Nebbiolo."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25vd1pVWjJNa1pKUlcxclZHcDBiRzF3ZVdkb1VHYxAB",
            "text": "Pretty packed and highly sought out restaurant. Had to reserve a table days in advance. Some of the location of this particular restaurant appear to be shared by other restaurants, which appear to be owned and perhaps run by the same company/owners. Although there may be outdoor seating in the back, it is difficult to determine since the restaurant next door also has access to the same space. Several bridal parties were held so I am not certain where it ends. Each of the restaurants are Italian themed and also share a \"Frank\" name.  This restaurant has a small menu, so our party was able to of order several different entres. Some dishes we thought were better than others.  All different from other older American Italian establishments. It still was an excellent meal."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psMk5XTnRVRTVzZHpOc1VrY3hhbll6UVhBM1UzYxAB",
            "text": "The Cavatelli with Hot Sausage & Browned Sage Butter is truly a last meal level dish. This restaurant is so cozy and friendly, you could eat by yourself at the bar, but I recommend going with a group of friends and splitting as many dishes as you can!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21WS01qSk9ObXhWVVhWcFNsTlFNbGx5ZVhCU2IxRRAB",
            "text": "My go to spot! Always consistent! They never have a bad day. The servers are great and never make you feel rushed to order (sometimes I go here late before closing). The food is top notch and the servings are the perfect size."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25RemVHRmljVzlKVDA5aVFUaElURGhWZVdsT04zYxAB",
            "text": "It does have the best cavatelli!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oRVUzbDFhM2d6ZVhsWE1sVjJSVFpsUjJVeFoyYxAB",
            "text": "Sat at the bar and the service was great. Tristian provided a perfect guide to the menu and drinks."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSVlJEQndTbEF4VjFCQ2FtcHpXaTFmTkVKQ1gwRRAB",
            "text": "Great spot."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SbGNWZDVXR1ZmVWt0elRDMVJRV0k0VUV4a05GRRAB",
            "text": "I really rarely rank places but unfortunately I didn’t have the best experience coming here. I was super excited to come here and everything atmospherically was beautiful and really enjoyable to dine to. As well as the staff who were very friendly and helpful. But there was one man who I went inside to ask very politely if it was a possibility to switch from an outside table to an inside one, which he immediately told me that I can go to the restaurant across the street in a very passive aggressive way. And then proceeded to push me to go the restaurant across the street saying “are you sure? It’s really good.” While I just asked him this question one time and never pushed to sit inside after I already asked him. So I sat back outside no problem. And after talking to this man child our food came out last after everyone else who got seated after us. I don’t know if this was intentional but it could have definitely added up after the very unique encounter I had with that guy. Super strange and unnecessary."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSSVNrUnRObG94WkZkdmNVOTFUVVZHYW1wU04zYxAB",
            "text": "Second time refusing a mom alone with a small stroller (baby asleep), while the restaurant is half empty, and it's 2pm. Don't get this, esp. in this family-friendly neighborhood. They have plenty of room available, they just don't want you there."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkTGJqaElSR2t0Tld4RVRWY3lSRU5LUVhkc1pYYxAB",
            "text": "Great food service and atmosphere at this Italian restaurant in Brooklyn. They have an outdoor patio that is a great setting to dine on."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNua2ZhcFRnEAE",
            "text": "A must eat meal when you visit NYC/Brooklyn!\nWonderful menu with all Red Sauce classics.\nAll the sauces and pasta made in house. Start with any of the incredible in house antipasto and move on to classic main meals. Pappardelle with braised lamb ragu or Sweet Sausage with roasted peppers  & polenta. Save room for desert red wine prunes & mascarpone. If you cannot get a table/reservation come anyway and get seat at the bar. Wonderful neighborhood of Carrol Gardens\nWhen Abbey is working the bar have Abbie make you the best rye manhattan in Brooklyn! Then take your time reading the menu.\nYummy times await!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WT2FrWnBXRVJJVFhWNVFWRlZNa3RDY21SR1RFRRAB",
            "text": "Great local pasta shop . Super small kithen but somehow produces amazing Italian dishes"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psWWExZEhNMnhLUldGNlpVZFpSUzAzYW5CT1JHYxAB",
            "text": "Delicious start to finish. Great service"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkRlRWaHhhWFV0UW1SdWNtMW5SRjlJTjB0dE5YYxAB",
            "text": "Incredible and delicious food, very traditional, great service"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT210bGJEazRXbmc1VTFoak9GbHljbDlKWDBsc2VrRRAB",
            "text": "Small bites, bustling adorable setting, food that makes you happy as hell, great wine selection!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0SFVXZHBRM1JyTUdOWlZtWmZOMUExU0RscVUzYxAB",
            "text": "Private party, food was excellent, great vibes"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkWmIwaGFkVVpIUVRSMlYyTktRME5TUTJwSVJVRRAB",
            "text": "ive tried quite a few things on the menu and everything tastes pretty good!"
        },
        {
            "date": "4달 전",
            "language": "uk",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paTFducHNZa3MxVkVWdlYwdExUbXBZVERsekxYYxAB",
            "text": "Гарний ресторан італійської кухні, сподобалося!"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xJd1dtNXJlRmQ1ZUZaelh5MTRhVFJmYTA1WFRsRRAB",
            "text": "Place would be Michelin star quality if not for the ridiculous artistic aspect to present food..\nI mean who cares as long as the food is good.. good old fashion good quantity cuisine"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21kR2IycFNSazlaTlZKeGNEQnVkV0ZTU0VSdVZrRRAB",
            "text": "Upon entering, we were met by a host who was notably haughty, arrogant, and genuinely unpleasant. His behavior created such a poor first impression that we opted to cancel our reservation on the spot. We won't be returning."
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM0bWVqdTJRRRAB",
            "text": "They make their own pasta daily. A must try is the Cavatelli with hot sausage."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GV1puSmtkWFp1TkVSUGJuWmhkMkYwWW05MVRXYxAB",
            "text": "TLDR; some of the best gnocchi I’ve had.\n\nWe came in for a late lunch and luckily did get a table right away (it did look super full and they only had one table left).\n\nWe ordered the beetroot salad and the gnocchi in marinara sauce between the two of us. The gnocchi was absolutely amazing - one of the best I’ve had. All the flavors were incredibly balanced and the texture was perfect.\n\nThe beetroot salad on the other hand was a bit underwhelming- they’re not kidding when they say it’s a beetroot and avocado salad - it’s literally just that."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psSlZGcHFlVTFST0dGS2NrcDZWazl0WWkxS2JIYxAB",
            "text": "Nice backyard. The starters are great, but the pastas very bad.\n\nHad mozzarella plate, Caesar salad, ricotta honey toast, and chili. The pasta with fava beans was ok but not good, the pork ragu was terrible, too many different things thrown together."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOcW01ZGZTLTRHTG5nRRAB",
            "text": "A classic for a reason"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CeGFtMVZOa3hKVFdkMlduVXdWbWR4UzFkeWIxRRAB",
            "text": "Lovely place with great pastas and generous crostini size (seriously you need like four more pieces of bread to finish the HEAP of chicken liver mousse you get for $6) and good wine. We walked in for an early dinner on a Saturday and loved everything. Staff was friendly and kind but not overbearing and we weren’t rushed at all. Two crostini, a salad, two pastas, and two glasses of wine didn’t even break $120 before tip."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNdkt4cTI5MDdISlVBEAE",
            "text": "We had the best time here! The staff was just as incredible as the food! If we’re ever back in the area we’ll be back at Frankies"
        },
        {
            "date": "5달 전",
            "language": "pt",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KTFpUZGlkVzVDZVMxM1VWcFphblE1WkRSQ2VtYxAB",
            "text": "Um ótimo restaurante italiano, sempre cheio (é bom reservar). Preços não são baratos,mas a comida vale o que pagamos."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VMLTd4TUhfbHVIb3NBRRAB",
            "text": "This was a wonderful experience. The day could not have been better. The weather was perfect. We were out back on the patio. Service was very attentive but not too much food was lovely. The whole experience was lovely."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKQ212TW4yeE5yUkRnEAE",
            "text": "Went to an event here today and it was amazing."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VMdU0wZFNfb3Y2R2NnEAE",
            "text": "A solid choice. Reliable, tasty Italian fare."
        },
        {
            "date": "5년 전",
            "language": "ko",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURNNHR5eDhnRRAB",
            "text": "브룩클린에서는 꽤 명성이 있는 이태리 식당입니다.  식전 빵과 서빙되는 올리브오일 향이 좋으며, 메뉴마다 맛 있습니다.  다만, 직원이 좀 불친절해요.."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvaTVHbnp3RRAB",
            "text": "Amazing lunch here out in the patio on a sunny spring day. Everything we got was fantastic. Highlights were the cavatelli with sausage and pappardelle with lamb ragú. Both desserts were also outstanding: the chocolate tart and the creme brûlée. Service was very nice and polite, and you can tell everything from the menu is high quality and consistent. Try to come on a day you can sit outside because it’s super chill. Will definitely come back!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNva3RDcklnEAE",
            "text": "We came here a few months ago with some friends — it was my first time there, but I'd heard great things about it. The Cavatelli with Hot Sausage & Browned Sage Butter did not disappoint! I was a little less impressed with the broccolini and other antipasto items, but would definitely get the cavatelli again. The creme brulee was also great. The bread and olive oil were on point.\n\nAside from that, we ordered the:\n- Gnocchi Marinara with Fresh Ricotta (good)\n- Tomato Braised Short Rib with Fall Vegetables and Polenta (good)\n- Eggplant Marinara (pretty good)\n\nWould definitely return for the cavatelli, service, and atmosphere."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZNk1td3d3RRAB",
            "text": "A beautiful venue with a lovely interior courtyard for outdoor dining. The hand made pasta was superb! Don't miss out on the tender and spongy meatballs! This place is a must when visiting the city!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzdW8zRzhBRRAB",
            "text": "Super excellent Italian AMERICAN restaurant, if you get my drift and what a great drift this place is wonderful. Great selection of classic Italian American dishes, all hearty home made tasty and great! Rustic interior coupled with friendly no frills staff is what ya want and need here! Will return this trip again and try something new! I can’t wait!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBNTVQanBBRRAB",
            "text": "\"Fantastic! The service was excellent and the food was delicious. I highly recommend this place to anyone who loves Italian cuisine. Cozy atmosphere and very kind staff. I'll definitely be back!\"\n\nTips:  if you are not sure what foods you wanna try , just ask for recommendation . Staff is friendly!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyOVBqQzNBRRAB",
            "text": "I've always loved the food at this restaurant but the indoor acoustics are terrible which is why we haven't been back in a long time.\n\nThis time of year, you can sit outside!\n\nIt was perfect on one the few cool evenings we've had this summer.\n\nNot terribly buggy but we seem to be sitting near a bee's nest. We didn't bother them and they didn't bother us.\n\nI really enjoyed the spicy crab pasta and the roasted vegetable salad. They seem to be very few raisins in our meatball dish.\n\nThe server recommended the Rosato to drink and it was very nice."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRdk9Xa3V3RRAB",
            "text": "Excellent. My favorite meal in Brooklyn. The prosciutto alone made the meal. High quality and thin cut, perfect temperature, wonderful. Wine suggestions were amazing. Courses were timed casually but perfectly. Just a great restaurant. Everything was delicious down to the fresh cracked pepper on our honey burrata bruschetta. Just fantastic"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYaTdla01REAE",
            "text": "I ordered their sausage cavatelli and it was very rich and heavy; it felt like an adult version of pasta with sausage franks that I grew up eating. However, the sweet potato ravioli was served in a very thin and loose Parmesan broth that I wasn’t a big fan of. But overall, the experience was solid and I recommend this spot to the neighborhood Italian cuisine fans"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIMll5LWJBEAE",
            "text": "Loved this place. After a long time had an amazing genuine italian food. The outside section is absolutely gorgeous. Perfect for a date if going in evening or with friends and family for Sunday brunch.\nThe server was a happy ray of sunshine.\nHad order Olive Martini. Stupendous!\nEntrees was Meatballs. Yum!\nMains was Cavatelli with Sausage. Delicious!\nEverything was on point."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzdmZ2S3V3RRAB",
            "text": "Overview:\nLook, I buy their oil so  I was excited to go to the restaurant. I’ll tell you what- the vibe was great. Beautiful outdoor space. Service was also! Sat outside with my mom’s dog and they were super friendly. Brought the dog water. Only issue was that the food was just ok. Nothing to write home about. Probably won’t be running back but I can see if you live in the neighborhood why it would be a good spot to go to.\n\nHere’s what was ordered:\nAntipasto plate: 6/10\nThe vegetables didn’t compliment too well. Was lacking any sort of brightness from the plate like not briney olives or some pickles. Cheese was disappointing and didn’t provide balance to the plate.\n\nCrostinis: 7/10\nLook at photo for reference you will need extra bread to eat as there are heaps of the toppings on a thin crostini. The liver was very flavourful tho and yummy.\n\nCaesar salad: 8/10\nA good Cesar. Portion was a little small but otherwise great flavour.\n\nGnocchi: 6/10\nWas ok. Good portion size.\n\nParpadelle with braised lamb: 7/10\nNice portion. Nice amount of lamb. I have had better and I have had worse."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnaGV6a09nEAE",
            "text": "Cavatelli and sausage was amazing, plus the delicious dessert. We enjoyed our time there and some great wine too. Such a classic place\nDef will come back"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURiNXZXRWRREAE",
            "text": "A lovely restaurant with great atmosphere, make sure to remember to make a reservation as the restaurant is small so there is not a lot of seating especially the restaurant is famous for their olive oil. The appetizers and pasta is good, the cocktail was decent, the servers was sweet and helpful."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIMWY2cUN3EAE",
            "text": "This is my favorite restaurant in New York.  I always take guests when they are visiting from out of town and I’ve even had my birthday here.  The pasta is always a must.  In particular the sage brown butter sausage one.  Must order atleast one of those every trip.  10/10 espresso martini as well."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyM1liaDNRRRAB",
            "text": "We absolutely loved the Cremini Mushroom, Boquerones, and Ricotta & Honey crostinis. The Caesar and Heirloom & Avocado salads were delish. And highly recommend the chilled Gamay! Stefan was the cherry on top, he gave us wonderful recommendations and was so friendly it really made our visit all the better."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOS1d6NHZpODZqTG53RRAB",
            "text": "We recently had our wedding at Frankie's 457, and we truly couldn’t have imagined a more perfect venue or experience. From start to finish, everything ran like clockwork—and it was all thanks to the incredible staff and seamless organization.\n\nFrom our very first meeting, the team was attentive, professional, and genuinely excited to help bring our vision to life. Every detail was thoughtfully handled, and their communication throughout the planning process was outstanding. On the big day, the staff worked like a well-oiled machine—everything from the timing of the ceremony to the flow of dinner service was flawless.\n\nOur guests are still raving about the food, the warm atmosphere, and how smoothly everything went. The staff went above and beyond to make sure everyone felt cared for, and we truly felt like we were in the best hands the entire time. They even handled last-minute changes with ease, and always with a smile.\n\nIf you're considering having your wedding here, you’ll get more than just a beautiful setting and delicious food; you’ll get a dedicated team who will make your day feel effortless. We are forever grateful for everything they did to make our wedding unforgettable."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2eTc2aURnEAE",
            "text": "The Cavatelli with Hot Sausage & Browned Sage Butter at Frankie's 457 Spuntino is a world class dish. The handmade pasta shells are perfectly al dente, capturing the nutty brown butter sauce that is the dish's foundation while the housemade sausage brings a balanced heat. I would eat this dish again in a second!\n\nThe rest of the menu is solid but there’s nothing on the same level as the cavatelli, I’d recommend the chocolate tart to pair with as your dessert."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNxM1pTVHFnRRAB",
            "text": "When we were in NYC this past weekend we gave Frankie’s 457 a try. Our reservation got mixed up through no fault of their own, but they pleasantly accommodated three of us anyway. We were seated in the far back garden which was a quiet and…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM0cEpqV293RRAB",
            "text": "This place is so good it makes me want to move to the neighborhood so I can go more often. We sat at the bar and the bartender helped us pick some great glasses of wine, letting us taste a bit before committing so we could be adventurous…"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNPOEw3NFFBEAE",
            "text": "Now that’s Italian! This is Court St Brooklyn. You will have the best meal you’ve ever had before. Their menu is perfectly sized not one thing on it i wouldn’t order. Its close eating so be prepared to hop in or out of a conversation with others. They have a very cool Secluded back yard court area for more eating room when its nice out. The cocktail menu perfectly pairs with some of their dishes. If i could leave more stars i would."
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNPb3RiWnNBRRAB",
            "text": "When we lived in the city, this was our absolute FAVORITE restaurant. After moving up to the Hudson Valley, we decided to have a date day to spend in this area of Brooklyn and made reservations at Frankie's. SO happy to report that Frankie's hasn't changed, and in a very good way. It's still just as wonderful as we remember. The food is astonishingly good as always, and the ambience is just perfect!"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRNUtiTXVRRRAB",
            "text": "Boar ragu is no good. The extent of the flavor is just salt. Not too salty, its just literally the only seasoning i could taste. For this one dish with no beverage after tax and tip was 40 dollars lol ... im good off that\n\nI love the homey atmosphere but i won't be back.\nBread service is yummy though."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoc2NQVlBBEAE",
            "text": "This Brooklyn restaurant and wedding venue is a hidden gem with a great vibe and atmosphere. Our team at Megan & Kenneth headed to Frankie’s 457 Spuntino for an intimate wedding ceremony and celebration in the Stable and Pizza Gardens. The…"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzOWR1VmdBRRAB",
            "text": "I visited to try their Cavatelli and Gnocchi, and both dishes were delicious. I also enjoyed the burrata. As a bread lover, I wasn’t impressed by the bread. :)  We sat in their backyard, which was chill and relaxing. Overall, a great spot for delicious Italian food with a laid-back vibe!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKaDQyZnRBRRAB",
            "text": "Highly recommend to start with the fennel, celery root salad and antipasto plate. The Cavatelli with hot sausage is a must. And the meatball with pine nuts & raisins is just dreamy. Finish it off with the prunes & mascarpone!\n\nP.S. if you’re in the garden over the summer evenings, the staff have mosquito spray behind the bar!"
        },
        {
            "date": "수정일: 4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3Xy1MbVNnEAE",
            "text": "Believe the hype, Frankie's IS all that and a bag of chips. Outstanding Italian in Carroll Gardens. Don't currently take rezzies but they'll put you on a list and call when your table is ready. Visit one of several cocktail bars nearby while you wait. Food is simply prepared and absolutely delicious. Service is friendly and reasonably attentive even on busy nights. It's definitely worth the trip!"
        },
        {
            "date": "수정일: 11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNadjlmbXRRRRAB",
            "text": "I photographed Elisa and Radu's beautiful wedding here in the fall. I highly recommend it! The backyard area provided a charming and intimate setting for their ceremony, and the flexible options for hosting the reception both indoors and outdoors were fantastic. Not only was the food incredible, but the venue’s care for vendors really stood out. The branzino dish, in particular, was one of the best vendor meals I’ve ever had! This place is a true gem for weddings.! ig @konradbrattke"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNacDh6QTRRRRAB",
            "text": "Texture of home made pasta was great! Flavors were balanced between the delicious sausage and various cheeses. The sandwich bread is pizza dough from the next door slice joint with amazing texture!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VKV2N4cDNQeS1EY0dnEAE",
            "text": "On our first visit we tried one crostini, two veggie appetizers, and two entries. All were wonderful. Not the usual fares but still feel very much Italian. And the amari is refreshing.\n\nThe pastas ordered by the neighboring table looked tasty. Will try some next time.\n\nThe servers were very nice and efficient,"
        },
        {
            "date": "수정일: 5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2NTltUWpRRRAB",
            "text": "I'm such a big fan of the sausage cavatelli. It's so good. I'll definitely come again."
        }
    ],
    "reviews_count": 79
}