{
    "name": "Rob's of Brooklyn – Sunset Park",
    "place_id": "ChIJQ341AFtbwokRwcwO6IC7Dng",
    "grid": "BK7",
    "address": "4201 7th Ave, Brooklyn, NY 11232, USA",
    "rating": 4.2,
    "user_ratings_total": 93,
    "phone_number": "(347) 599-0179",
    "reviews": [
        {
            "date": "2일 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21GMWJtWTVNamhJVmxoRGJpMUlOek53VWs5TFZVRRAB",
            "text": "Good spicy vodka pepperoni square"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxcU56VlZXbkJuWmpWRUxYSlVUbVpwV0RsZlVGRRAB",
            "text": "Cool pizza spot in the neighborhood, the pizza is very good and staff friendly too"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOQ09XSm9RVmxHTVdGRVZFbFlaRlJTV2xoUWFFRRAB",
            "text": "Vibe isn’t very welcoming. Service without smiles, but pizza tastes better than the surrounding pizzerias. So, I will visit again :/"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2poWVNVMW1iR2d4YkhCamRGVTJlalJXY1dSSFkyYxAB",
            "text": "For me, it’s the best pizza place by FAR in Sunset Park! Delicious pizza, pasta and salads! Can’t go wrong!"
        },
        {
            "date": "2주 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0Rk1VczNaSEZOZFVOVmRYZHhPRXAwUWxoUkxVRRAB",
            "text": "The pizza here is solid -but the staff consistently feel unwelcoming. I’m not expecting Disneyland levels of customer service (especially in nyc) but a simple “Hey” or “Be with you in a sec” goes a long way.\n\nIve been there about 5-6 times since this place opened, and each time I’ve been met with blank stares, no greeting, no warmth, mostly “Why are you here?” energy. It feels like the staff would rather not engage or interact with customers at all. But then seem to perk up and laugh with each other after they take your order :-/\n\nOne of the best things about nyc pizza shops, beyond the pizza, is the personality behind the counter. The neighborhood vibes, human connection. This place feels opposite.\n\nI want to support local, but it’s hard to come back to a place that seems so indifferent to people walking in. Just because it’s the only pizza place on the block doesn’t mean it should feel like you’re doing them a favor by showing up."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psTmJXOXVhMmRXZUhORFUweEVSVWhwTm1waWFXYxAB",
            "text": "Great pizza- happy to have them in the neighborhood 🤌"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wT1NrbHJYMEV6WkVONlpVRmxXVGhqZFRaMFZVRRAB",
            "text": "Pizza bread and the crust is a bit soggy. The taste is very OK, not tasty.\nIt is a shame that such a great location dies not a good pizza."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xQ2IyMU5VRGgwVlZkVFNGOVhZMjFYZDA1bFlXYxAB",
            "text": "Very Disappointing Experience\nI drove all the way from Long Island to try this pizzeria on 7th and 42nd after a friend recommended it, and I honestly regret it. The girl with blue-dyed hair who served me had a terrible attitude — she didn’t acknowledge me, barely made any effort, and even ignored me when I said “have a good day.” I was really looking forward to trying this place, but the rude service completely ruined the experience. I won’t be coming back."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tSeWFYUkZSR3BrZVZZNVNXczJlVkpLZG1SU09WRRAB",
            "text": "It’s new but has one of the best pizza I have ever eaten in NYC! It’s so flavorful and has a very nice thin crust . I remember back in the day when there used to be another pizza shop here they also sold amazing pizza as well! Glad to see the tradition still going strong.\n\nUPDATE: So I usually only get single slices but I just got a pie the other day and ate it in the car and it was banging! Highly recommend this spot and it’s right next to the park! Honestly best pizza in Sunset!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tobU5FcERZVkpIY0ZOTldtcE5WbDl0Y2pWV1JWRRAB",
            "text": "Excellent food"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s0NWVUSlBZMUJrY1Y4M2IyZEZOVGw0Ylc5NWRtYxAB",
            "text": "Super delicious pizza 🍕"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oTVNUQjZNVFpsU1dnNFNGcExNRGMwY2xaQ1dtYxAB",
            "text": "The prices are quite chaotic, the price increase is too exaggerated, the difference is $4, which is ridiculous"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxVFNEZHZiMnhmTmtNMGRWTlNjR2xCV0hRNE9IYxAB",
            "text": "La cajera es muy mal servicio"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21jd1drZE1OM2cxYnpJMWIzYzFXVGh3VjBKb1EwRRAB",
            "text": "Very OK pizza. I get the dream of there being a killer slice in the neighborhood—I’ve been on the same block here more than half my life—but this ain’t it. Think Dominick’s on 8th with a sweeter sauce and you’ve got the idea.\n\nPizza turns very hard 7-8 minutes out of the oven. Becomes a tough chew once you’re onto your second slice from the box.\n\nAt nearly $30 for a one topping pie, this is a swing and a miss. Not bad, not worth $30."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xScGFpMVZlbUZNU1MxRlJHTlZhbU5TU1VjelZXYxAB",
            "text": "Cute Pizza shop, staff are very polite and on top of their customer service game. Unfortunately, the pizza is alright but garlic knots are drenched in oil making them impossible to eat. I used about 6 napkins to absorb the oil and there was still so much left in the garlic knot."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pCUWJqaDFZbm8wVmpSeWR6VlNZelp2TWs5RFptYxAB",
            "text": "Terrible customer service which is very unfortunate because I live a block away and always go here plus their pizza is good but after today I will no longer be giving them my business. I went in ordered a few things about $40 one thing I ordered contained pork the cashier (small girl with glasses colored hair) she specifically asked me when I ordered my sandwich if I wanted the pork I said “no I can’t eat pork” after waiting 20 minutes for my food she hands me my sandwich with pork all melted into the cheese so i politely tell her “remember I asked for no pork?” She agreed and said “yes” then I said “can they please remake it I can not eat pork” she said “yea” and she took it away not less then a minute after someone brings it back up to the counter so she goes to hand me it and I ask “they didn’t remake it, I’m not trying  to give you a hard time but I can’t eat pork I would like them to remake it” she looked me right in my face and told me “they can’t remake it” I was extremely disappointed and upset. Why can’t they remake it when they clearly messed up? No apology from her no nothing I asked for a refund and she refunded me cash when I paid with my credit card another issue but I didn’t say anything. Aside from all the other stuff I bought I also bought truffle fries to specifically eat with my sandwich and I ended up having fries that i ultimately didn’t want because i wanted to eat it with my sandwich so i just wrapped it up to take home. It’s such a shame because I go here a lot and my husband too we spend a lot of money there since they opened. I must say I am extremely disappointed, I have a pork allergy this is customer service and that young lady really gave poor service and did not seem like she cared or try to even fix the issue. What would have happened if I ate the sandwich and I had an allergic reaction whose fault would that have been? Please explain to your staff the importance of customer service and paying attention to specifics when  someone orders something."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twclZ6Sk1WSGN5YTFvNUxUTnpNMmxsTmxORVJIYxAB",
            "text": "Perfectly fine pizza and beer at great prices! Refreshing to see a pizza place open up with the essentials and priced right for the neighborhood. Great seating outside and across from the park."
        },
        {
            "date": "3달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25JM1RrbHBRMWczY2tOaVVtUjZWbWR2VVhkc2RYYxAB",
            "text": "Muy muy mal servicio de comida.  Las pizzas muy secas  paresieran Atrasadas\nPara el precio que tienen. El pollo quemado  el sabor nada bueno ."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wM1ZtbzFYMG8zZDA5a1NEaHZWVGhwTmtWTVUxRRAB",
            "text": "Awesome! Excellent! It’s so hard to believe anyone could give it 1 star. One reviewer contradicted himself too, saying it was the best slice, and second time was cold and owner would make it up to him if he came in person, but didn’t want to come in. I truly think this is the best pizza from 7th avenue and above in Sunset. Maybe the best in Sunset, but there are a few more i need to try first."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xoMFdHaGpZelZsZEVNd2JYRkdaM2czYVZKaWVYYxAB",
            "text": "Went by for lunch and was shocked this pizzeria had delicious food."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkc1pGbFhhakZPT1hSNFJubDBhbmhLTm5sbVoxRRAB",
            "text": "Excellent new spot for Pizza in the neighborhood! Yummy choices. Menu with a solid number of choices and also not overwhelming."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t0U1NtOVFXVVZ1ZGs1alQwVXhMVmRVWld4UVdVRRAB",
            "text": "They kno how to make food that tastes good"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21wb1FUbHRZemQ0TmxnNVUwTlRXVVZRYUhreFFYYxAB",
            "text": "Consistently very good pizza - thin & tasty.\n\nThe only drawback is to watch out if the reheated slice stays in the oven too long. The hard working staff can get busy with the influx of activity."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VQengyTXFjMXBEaDV3RRAB",
            "text": "Got the mushroom white pizza- super yummy. They go heavy with the mushrooms and cheese! Very  impressed 🍄‍🟫🍕"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJMlQ0OHVMaWFtZGJREAE",
            "text": "Picked up a great Pepperoni Grandma pie here!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VOV2ltOXZ5MXV2a2x3RRAB",
            "text": "Food wasn't bad, but you guys get 5 stars for being ok with me using your outlet to charge my phone for a long time while I was trying to sort out a mess I had gotten into."
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJTGd3cVQ4blp5bUlREAE",
            "text": "Me encanta,!! todo ahi es delicioso"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VKR3U4YW55LXE3NWdRRRAB",
            "text": "We are now going to be ordering our catered office lunches regularly from Robs.  The food is fresh, flavorful and delivered hot. Even the bread was warm.  We ordered trays of chicken cacciatore, baked ziti, mixed salad and meatballs marinara.  Beautifully packed and arrived exactly on time."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZaGViWm1BRRAB",
            "text": "1 regular slide look dry have no teeth it really sucks  ..  ...!!!¡!!  back in the Days Pizza by The Park was very good slices ...."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvdXJDbjNnRRAB",
            "text": "My sister ordered food through to good to go app. Got there 3 minutes late and was laughed at by staff."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURvaXJPdG5RRRAB",
            "text": "WARNING: this restaurant was inspected by the NYC health department on Jan 6, and received 18 points worth of violations. That would be a B grade. Something I read unfortunately after I ate here.\n\nThe crust was burnt and there was hardly any cheese on my slice. The workers were trash talking about the other customers in Spanish not thinking I understood, very unprofessional especially in a neighborhood with many Spanish speakers."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNvaTVQMEVnEAE",
            "text": "Go to pizza place"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvamJ2QWxBRRAB",
            "text": "Lifelong Sunset, we’ve never had a pizzeria as exceptional as Rob’s. Franks on 8th Ave. was a great ristorante, since then nada.\nRob is the real deal, the best Pizzaole ever in Sunset ! Top quality as Sunset has long deserved, let’s support him BIGTIME !\nKenny J"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfeXNqZTF3RRAB",
            "text": "So happy a good pizzeria opened one block from me. Margarita, & half pepperoni was delicious & their garlic knots are amazing. Will return to try some of his pasta dishes & of course different selections of his pizza. Good Luck & Welcome to Sunset Park!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJajZiVzlnRRAB",
            "text": "I had no idea Robs was so close to me as it is on a street I rarely walk on.  I waited for a cold wet day to enjoy a beer and my Eggplant parmigiana.   The place had a steady flow with eager take out diners.\n\nThe food tasted great.  The place was very clean.  Not overly friendly, the staff was efficient and thorough.\n\nDefinitely going to show up again."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJLUtfR3l3RRAB",
            "text": "Great pizza!!!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3NmF2WUZ3EAE",
            "text": "Pizza pie has crisp to every slice! Full of flavor, large slices. Just how a pizza should look and taste!."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3bUp5dGpBRRAB",
            "text": "Sad to see the original location closed, will stop by the new location one day."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3cjRQVmhBRRAB",
            "text": "! The crisp and the fluff! I actually got a plain slice due to the fact that it's lent, and well, I didn't know I was missing out... I've been saving that experience for a year because hot honey pepperoni grandma is actually magic sauce. I don't mean that in 2005 slang, I mean like the sauce is very, very  good.  It was so nice to be in the new space, it's a destination in a different type of way. So many folks buzzing about this authentic spot, and I think it's just the beginning. 10/10 would go back 100+x and bring my entire family."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUN3d3Z2dzlRRRAB",
            "text": "The girl that takes the orders over the phone doesn't pay attention.  This is the second time I ordered and she didn't put the  spicy vodka sauce cup i ordered which paid for twice .. food is delicious a lil over priced but good if she can get the orders right .."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3dFBfaGRREAE",
            "text": "Hands down best pizzeria in BK! Rob’s offers authentic pizza with a perfectly crispy crust and fresh ingredients. Pasta 10/10 as well!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRaDktd1RREAE",
            "text": "I came in at 4:09 with my little brother and asked if we could still get the student special for him, even though I knew it was past 4. The guy at the front was nice enough to let it slide, but the girl who charged us was rude. She spoke in Spanish, assuming I wouldn’t understand, and made nasty comments about the special being only for students. Like HELLO my brother is right next to me!!!  She also rudely told the cook, “If I get in trouble, it’s on you,” right in front of my brother, who was already shy to order. Once she realized I understood, she gave me attitude when explaining the time limit of the special. I told her I was fine paying full price. To make matters worse, we didn’t even get the soda that’s included with the special, but I didn’t bother bringing it up since I was already annoyed. We’ve been regulars since they opened and usually love the food and service, but her attitude was unacceptable."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURReGJLdlpREAE",
            "text": "I’m really disappointed that I have to update my glowing review for this pizza spot. The pizza I received today was hard and old, which is such a surprise considering the amazing pie I got when I ordered delivery previously—it was honestly the best I’ve ever had. I don’t know what caused this drastic change, but now I’m left with a horrible sickening experience. To make matters worse, I decided to try their pasta, and the chicken was undercooked, bland, and as hard as a hockey puck.\n\nI called Rob’s to see if they could fix the issue by delivering a new order, and I was willing to tip the driver. However, they told me they'd only honor the request if I came to pick it up. Why would I want to return to a place that got my order wrong in the first place, especially after spending almost $50 this afternoon? It doesn’t make sense. If I’m willing to take care of the delivery tip, why can’t they just fix their mistake?\n\nLesson learned—never again. Save your money and head to Park Slope if you want a slice."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfcElEbEp3EAE",
            "text": "5 star slice. Best pizza in Sunset Park. Awesome sauce cheese and a perfect crust"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRX2Y3STh3RRAB",
            "text": "One of the best slices I’ve had!!! Staff were very welcoming and friendly :)"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURneXFHbDlRRRAB",
            "text": "This is it; this is the New York slice you have been looking for. Sauce, not too sweet. Crust? Perfect. This will become one of \"the\" spots for the perfect slice of New York pizza. I've only tried a regular cheese slice and I can tell you that I will absolutely be back for more. 10/10"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURneklMY0VREAE",
            "text": "This is the 2nd time I ordered pasta or pizza and when it arrived, it was cold—almost as if it had been sitting around for a while before being brought to me. They gave me an excuse that it was cold outside but I’ve ordered pizza for 20 plus years and this the only shop with this issue. Not only was the temperature off, but the texture of the pasta was far from fresh. It was chewy and dry, which totally ruined the whole dish. I understand sometimes things get busy, but this was just unacceptable. It was a total letdown, and I won’t be ordering from here again anytime soon."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURBNjdTQ0hnEAE",
            "text": "Thanks for coming back. The pizzis the best."
        },
        {
            "date": "8달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBMk5qcnVnRRAB",
            "text": "La pizza esta muy rica, el lugar muy bonito"
        },
        {
            "date": "9달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBMWMybld3EAE",
            "text": "10/10 👌"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfN0l2S1VREAE",
            "text": "Been waiting more than a decade for an elite pizza place in Sunset Park, and it has finally arrived. Thank you, Rob’s of Brooklyn. Highly recommend the Spicy Vodka Pepperoni Square, but the classic slices also deliver. The crusts are crispy and chewy, the perfect balance, and the sauce brightens everything it touches. There’s still a lot on the menu that I have not tried (looking at you, Mushroom White Truffle) but I will eat it all very soon."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfb1Atd2h3RRAB",
            "text": "Robs new location in Sunset Park. Very good pizza. Great blend of cheese and sauce and many variety of pizza offerings. They have pasta dishes and sandwiches too. This is the hot new pizzeria in the area. Definitely stop by and give this place a try"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfbHFmTGhBRRAB",
            "text": "Fantastic pizza and great crust. NOT floppy. Love the caramelized onions on the white slice. Had their pepperoni vodka slice earlier this week and now having their regular. Im very picky when it comes to vodka sauce but they nailed it. Delicious! Sending love from judys 🫶🏻❤️"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfdC1DQlVnEAE",
            "text": "We've been waiting and finally opened! Stopped in for a beer, salad, and slice, and all was wonderful. Great addition to the neighborhood 👍…"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURfMS0tWnJnRRAB",
            "text": "Just got a regular slice and blown away immediately! Thin, super crunchy, light and simply amazing, 10/10 one of the best in Brooklyn and definitely ranks among top elite pizzerias in Brooklyn. Good luck and welcome to the neighborhood!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfaE12MlNnEAE",
            "text": "delicious and the only pizzeria in the area, good menu, pleasant service, reasonable prices"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfb1A2d0R3EAE",
            "text": "Each slice is better than the last. Must try!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfbHFPcXVRRRAB",
            "text": "Traditional New York Slice! One of the best in town! Flavor and quality is unmatched. Staff is quick and helpful, paired with a cozy sunset vibe. Highly recommend!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfaE12dTdRRRAB",
            "text": "Delicious pizza at an affordable price. Mushroom pizza is my favourite."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfOHBLblV3EAE",
            "text": "Finally a decent pizza in the neighborhood!!! As good as Table 87. Their house tomato sauce is delicious! Welcome to the neighborhood, guys!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfNU5ydF9BRRAB",
            "text": "Vodka slice and buffalo chicken are very good."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfa2ZMWVZBEAE",
            "text": "Very solid pizza. Stopped in to get two quick slices last week and almost went back for a third!"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNBbXVLOGlRRRAB",
            "text": "Absolutely fantastic mushroom pizza! The service was phenomenal!! Will definitely be back when we are in NY!!"
        }
    ],
    "reviews_count": 63
}