{
    "name": "SLIMAK CAFE",
    "place_id": "ChIJfRifabhawokR_3_XhbNgcig",
    "grid": "BK7",
    "address": "4110 4th Ave, Brooklyn, NY 11232, USA",
    "rating": 4.6,
    "user_ratings_total": 548,
    "phone_number": "(347) 689-3332",
    "reviews": [
        {
            "date": "3일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SUFNFMUJXV2R3Vm1wd1QwcHdlbTlNYjI5dFJGRRAB",
            "text": "This place is so sacred to me. The coffee, food, and service is top notch. The ambiance of the whole place is just excellent too, which is the best part for me. The staff is attentive and friendly. I would say this place is very customer service forward, which I can appreciate. Lifetime customer here xo"
        },
        {
            "date": "4일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkeWRqQnpSRWxNZW1OM09YbG9PVmc1VjJGc00zYxAB",
            "text": "Very yummy coffee speciality drinks"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2twbVVHWXdUSEJOUkhkMlFVaFdNVk13YXpsamVYYxAB",
            "text": "The staff is very friendly! You order at the counter and they bring you your food if you are dinning in. The kitchen has a window if you'd like to take a look at the cooking process/kitchen. The vibes are so cozy! They take tap-to-pay and have a single stall bathroom (for customers only) that is nice and clean."
        },
        {
            "date": "4주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xVNGNsWTJXakF0Tm1NeVFVWnlaMWhrWms5bmNsRRAB",
            "text": "I love the ambiance in this place , is really cozy and service is always really attentive! My favorite dishes are the chicken wrap , ricotta pancakes, sandwiches and the soups ! And all of the desserts are amazing but carrot cake is my fav,Moist and soft !"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pKRmVuUjNSRUkxWmpGaWFYRXdUbE13YUMxU2JVRRAB",
            "text": "The food is yummy, visually appealing, and they accommodate kids. Definitely coming back!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25FM2IwSktZVnBDV1VKcE5ubFRRaTE1ZVdacVNVRRAB",
            "text": "alowyes good"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSbU5tY3hUR0ZtVWtWUk0ycExTRGxQVlVSQmFtYxAB",
            "text": "Excellent place!"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tkMlQwWlZjelZ4VVV4dVltNDBhMEZFUm1WelFYYxAB",
            "text": "Delicious but too small (for the price)\nThe avocado toast tasted great, but left me hungry, which for $12 dollars seems not worth it."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xnNVVsSnZiRE5yWWpCVlprVndNRjlqY210WVFXYxAB",
            "text": "Atmosphere here is a vibe. I can definitely see me sitting here having my lunch and enjoying a peaceful morning or afternoon. The young man behind the counter, who serve me was pleasant. He didn’t notice me at first I’m not really sure if that’s true or not, but he did have manners. However, the food is atrocious. I only ordered a brownie. It was a cream cheese brownie. It taste like they let a cat stir it with their paw. I heated it up it was edible but it has such a bad smell I tossed it after three bites. Idk why I even ate three bites."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xKbVNXaHhaazB6T1VrdFZuWnNMWEY2VFZZM05WRRAB",
            "text": "The service was excellent, and the staff was very courteous and attentive. I ordered a French toast sandwich, and it was delicious! I highly recommend that you try this place."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214TFQxaFlhWGg1WW5BM1dsSTJjRWc1UWpOUlgwRRAB",
            "text": "Amazing salads!!! Everything so delicious here and great service and atmosphere."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2paV1EwaGtaR2xLWDNsdVExRnlZMVF5YUdZMlUyYxAB",
            "text": "Every time I come back to this place I’m reminded of how lovely it would be for them to be conveniently located for me. The deliciousness and kindness abounds."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21oR00zcENaa2RvUlMxYVZYaEpiV3RhUlhWTWRFRRAB",
            "text": "Very good hash"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sUGFWZFFka1ZrTXpKcFR6a3habkl6U21ZeGJIYxAB",
            "text": "This restaurant maintains high standards. The staff's excellence matched the kitchen's creativity. The team showed sincerity in their pleasant interactions. This place has a welcoming setting. I'm ready to go back immediately."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aNmNYWnpOamRpYlhwRFVHdzBjMVZ4UkRkRk5HYxAB",
            "text": "I absolutely loved everything about this place and will be returning many, many times! I even told my son and my cousin about it and can’t wait to bring them to enjoy the food here as well! And thanks to the lovely staff as well!!\nSadly, I was so hungry that I didn’t take any photos of my delicious meal, which was the Roasted Salmon Salad, and the Stress Buster Smoothie!\nThe salad was pretty big and very satisfying, not to mention delicious and the smoothie was absolutely yummy! It wasn’t super sweet, it was just perfect!\nI will say is that if you enjoy salmon cooked on the lighter side, you might have to tell them that when you place your order…because my salmon was well done, but I like it that way. So I don’t know if it’s an option, whether you can ask them to not cook your salmon all the way? I guess I’ll find out real soon at my next visit! And I will take photos this time! 🤭"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25JNE9XUktlbXRPVFZGNVZUVlRjekJ0TnpnMFIxRRAB",
            "text": "The food, drinks, and service is always good."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25ZeU1rZFZlbEZ3WDNwVFNXbERMVmwzYUZodVUxRRAB",
            "text": "This place was pretty cool. The food was great but the drinks were not cold at all. But if you don't drink it will be nice 🙂"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21aNVREUmZlbHBHTFU5SU5HSmhRVVZUVGtSemNWRRAB",
            "text": "The Hanger steak sandwich was DELICIOUS.. came on a bread I can’t even pronounce lol (Ciabatta) it was amazing !\nSlimak has amazing coffee and their Ginger lemonade is delicious too !! I had the sandwich with chipotle mayo and it slapped!!"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ZNVIzRjJTV1I1UjJsVE5ISXdURkE1ZWtJeE5sRRAB",
            "text": "Food was delicious, nice atmosphere. Would come here again!"
        },
        {
            "date": "4달 전",
            "language": "de",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1R1kxQlhaSFJ3ZGpWU1ZIbGxYMEZ3VkhaRVVFRRAB",
            "text": "Wir liebten unseren Aufenthalt im Slimak! Das Personal war super freundlich, die Musik war genial, das Essen war echt lecker und die Stimmung einfach Mega. Deshalb kamen wir auch 2 mal her um zu essen während unseres 4-tägigen New York-Aufenthalts!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VLQ2tsSlR0OExqWFZnEAE",
            "text": "The food and service is amazing! On top of that I never have to worry about not finding options with my gluten allergy. They have a huge selection of gluten free desserts and food options."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VNbkZxNEt6Z3Zyd3J3RRAB",
            "text": "I always come here when I rush and dont have time to make breakfast. It's pretty and cozy inside, the staff are wonderful and I like the food- ive only really ordered sandwiches and quiche here - but the bread is very crunchy - reminds me of paris."
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURJazYzeXRBRRAB",
            "text": "Order on uber eats countless amounts of time and they seem to always forget  to add items that they charge extra for. Especially on the uber eats platform where you could report the issue and get no type of compensation for the items ordered that wasn’t received. The restaurant lack of care pretty much pushes me away from being a returning customer!!!\n\nUpdate owner claims that a refund refund was given!!!! Who you lying to?\nBelow shows i wasn’t"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNJMzhiOElnEAE",
            "text": "The people here are so nice. Really love the Speculoos latte which is biscoff flavored!"
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJODYtTVB3EAE",
            "text": "😋 🤤 Everything is wonderful, from food to customer service. I remember I ordered a coffee on one of these food apps. They will wait till you get there to pick up then they make the coffee right away, making sure its quality( instead for just letting it sits there and deteriorates). Also they are part of the the TOO GOOD TO GO! Combating food waste problem. This is SUPER!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3OVBhQk9REAE",
            "text": "What a sweet, charming cafe with delicious and healthy food options. This place is a true gem and a delight to spend time in. Perfect for a meal and a stop during your day."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3b0x2NFhnEAE",
            "text": "Stopped by this local Brooklyn spot after a car run, just looking for something quick, and it exceeded my expectations. Cozy atmosphere, friendly staff, and a dessert counter that looked incredible. You do have to order at the counter, which some might not love, but it wasn’t a big deal. Overall, a great find—I’ll be back."
        },
        {
            "date": "수정일: 7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURxM0tlNzFnRRAB",
            "text": "Good service!!"
        },
        {
            "date": "8달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNRekw3S1VnEAE",
            "text": "La comida muy rica, el ambiente es familiar, y los precios está bien calidad-precio. Recomendado si están cerca"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnMHZ5TFl3EAE",
            "text": "Amazing food + Amazing service = Happy Customer!\n\nIced Caramel Latte made with just the right amount of sweetness.\n\nBelgium Waffle add on Berries\n\nHanger steak and eggs\n\nChicken club with Salad"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnOE9YVmZBEAE",
            "text": "Absolutely wonderful cafe with delicious pastries and coffee, in a charming pseudo Parisienne setting."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBbjhuT2hRRRAB",
            "text": "Haven’t ate in the restaurant yet, but all the times I ordered food from them it’s been great. Pancakes, potatoes, egg sandwiches have all been great. Great beverages, great pastries, give this place a try"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNfMS1TVERREAE",
            "text": "They have the best brunch, the best salads, the best coffee. The best non coffee drinks.\nI love the golden drink!"
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNmaGZiMWpRRRAB",
            "text": "really good food, i got a sausage breakfast wrap. the vibes inside are really nice, however, extremely busy so if you want a place to sit go early!"
        },
        {
            "date": "10달 전",
            "language": "de",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR2ZzhfcUN3EAE",
            "text": "Wow ... wir können dieses Café nur von Herzen empfehlen. Es ist alles einfach rund um passend. Das Essen, der Kafffee/die Getränke sind lecker & das Personal ist herzlich, immer freundlich & zuvorkommend."
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR2X3NpcnZ3RRAB",
            "text": "I love this place. It’s a gem, and not your typical city breakfast spot. It has everything you could want, in the perfect combinations. Very friendly service. Unfussy ambience but welcoming. My only non-glowing comment is the hot drinks aren’t amazing, though the coffee is fine."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzeHFlS3lnRRAB",
            "text": "Amazing cafe for breakfast and brunch. They had so many options and the food was really good. I had pancakes and bacon which was just perfect. The waiter at the counter was really helpful. He helped me with my order by suggesting what I might like. Also he's very cute and had a beautiful smile 🤭 - @prameshr47"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzd08tb05BEAE",
            "text": "such a great cozy cafe. The women who run this place are so sweet, attentive, and friendly. Food was delicious and came out quick. I recommend the milanese sandwich and omelette. Food is fresh and filling."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzbzZ2WW53RRAB",
            "text": "I ordered a catered breakfast for 10 and catered lunch for 25 from Slimak. I highly recommend - customer service with Andrea was swift and friendly; the food was timely, presented nicely, and most importantly delicious. The price point is appropriate. I recommend the Mediterranean board to accommodate a varied group, Would absolutely order from here again! Thank you!"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzdGJmbUZREAE",
            "text": "An amazing gem of a restaurant.  Everything is fresh and delicious.  Perfectly seasoned. Can't do salt. Gluten free choices and interesting combinations for lunch and breakfast..only bad part they are not open for dinner!!!!... Staff is sweet and attentive. I have tons of allergies especially wheat and i ate a flavorful brunch that did not kill or upset my body.  Will be back...Highly highly recommend..total yum 😋"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYMTVXbEt3EAE",
            "text": "Este es nuestro lugar favorito para desayunar, lo que  más que nada nos encanta el servicio de sus meseras. Nuestro plato favorito es chiken club sándwich, siempre lo ordenamos y siempre pero siempre tiene esa consistencia tan delicioasa y su punkimp spices late que lo recomiendo, mil gracias por todas sus atenciones y por supuesto nos vemos pronto."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURub2ZXRnFnRRAB",
            "text": "Great little brunch and bakery. Nice service. Food tasted very fresh. The chicken apple sausage hash was the highlight."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuMzgzNXBBRRAB",
            "text": "Me gusta mucho este lugar siempre salgo complacida"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURIdFkzTEN3EAE",
            "text": "Cute little coffee shop/cafe with great study vibes, but very hot inside though, which discourages me from going. Berry chia pudding is so good, and the tuna melt is yummy. Vietnamese iced coffee is delicious if you like sweet coffee."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIdHZEVGlnRRAB",
            "text": "One cookie was six dollars... really.."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3cXNhS2xBRRAB",
            "text": "great place for breakfast brunch and great customer service"
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3ME0tUGNBEAE",
            "text": "A true ‘hidden gem’. Its wonderful to have this place close to home..!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3aU5ycFh3EAE",
            "text": "The food has been surprisingly good every time I order in or out. Plenty of clean healthy options. Some of my favorite food in the city (I'm an NYC native and picky.)\n\nOut of curiosity I read the negative reviews about service, seems they have turned that around 180°. Reviewers can be so ruthless. This place should be packed!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiNE5QVXRRRRAB",
            "text": "I recently visited this coffee shop for the first time, and it was a fantastic experience. The coffee was excellent and definitely worth the price. I also tried a waffle, which was great, and a breakfast sandwich with crispy bacon that was simply delicious. The ambience of the place is very nice, making it a perfect spot to relax and enjoy your meal.\n\nThe only downside was that the girls behind the register could be friendlier. I understand they are young, but they should be more knowledgeable about the menu. Other than that, everything was great, and I will definitely be back."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNibElIbjdnRRAB",
            "text": "I had the ginger lemonade with the quinoa bowl today. My egg was fried hard as requested. 10/10!!!!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5bE1iSlp3EAE",
            "text": "Slimak is a must visit if you're in this area of Brooklyn. We went at 11 am on a Saturday for breakfast and somehow there was no line and seating available--this is tragic given how good our meal was. You order at the counter and are given a number so staff can locate you when your food is ready, and food was ready FAST! All of us loved our meals. The steak in my steak and eggs was excellent! Definitely not typical diner fare. The decor and atmosphere is also on point and their sweets are tasty too. The only thing I'd change is their eggs--why don't they ask for a cook (easy/medium/hard)? They do over easy by default and mine came with a lot of loose white (and you can definitely achieve over easy with a fully cooked white)."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMdlpHZTdnRRAB",
            "text": "My forever go-to place for breakfast/lunch and/or weekend brunch.  I’ve lost count of just how many times I’ve gone to Slimák, taken friends there, or have ordered delivery.  It has never disappointed.  The food is always fresh, always delicious, and always leaves you wanting to return for more. I can’t pick a favorite because I’ve tried so many items on the menu and it is all simply amazing - the sandwiches, the salads, the pastries, even the drinks, you absolutely cannot go wrong if you choose Slimak as your dining option any day of the week. The staff are always friendly and welcoming, and if you can’t decide - just ask for a recommendation! The place may be packed but you’ll still feel like you’re eating at home - the food is so good it’ll make you feel warm and fuzzy inside."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURUODRXWkdnEAE",
            "text": "We came to the cafe on Memorial Day for brunch when many other places are closed. The latte was very good, especially when enjoyed with the almond croissant. Pancakes and avocado (pesto) toast was above average. My favorite is the quick serving time, plenty of seating inside and the coffee and pastry!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxNWRXTmV3EAE",
            "text": "I recently visited this cafe and was impressed by its great ambiance. The staff was exceptionally friendly, and the menu offered a fantastic variety of delicious foods. The freshly squeezed orange juice is a must-try, and the beets sandwich was absolutely delicious. A delightful dining experience overall!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5ckpxZWdnRRAB",
            "text": "What a special, lovely, delicious spot. I live in the Philly suburbs and found this spot on Google maps. The outside belies such a  cozy, warm and fun breakfast and anytime cafe. Service was great, friendly. Food and drinks - excellent chai latte and iced coffee, food was very good quality, good portions and came out very fast, and clearly this cafe knows how to operate. The prices were really good too! Thank you for a great meal!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNobjlLU3p3RRAB",
            "text": "This is hands down of the best kept eatery secrets. I love having breakfast or brunch here on the whim.\n\nThere's always seating, the staff is always courteous, and the food is ALWAYS fresh and delicious.\n\nI recommend any coffee drink (I get the latte) and my favorite dishes are the (1) Fat &  Fluffy French Toast (2) Salmon Egg Benedict with scramble eggs not poached!"
        },
        {
            "date": "수정일: 2년 전",
            "language": "fr",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSeHJ5VG53RRAB",
            "text": "Grande variété de plats très bien cuisinés avec des produits frais. Difficile de faire un choix parce que tout fait envie.  La musique est par ailleurs excellente elle aussi. Après une première expérience aussi satisfaisante, nous avons décidé de faire du Slimak Café notre camp de base du matin pour toute la semaine."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwaXVmYkRBEAE",
            "text": "Had a so-so time at Slimak Cafe in Brooklyn. You order at the counter, and they bring the food to your table. The lavender oat milk latte was super strong, almost like a cappuccino, and way too sweet for my taste. For my meal, I went with the sautéed kale with avocado and two poached eggs. Unfortunately, the eggs were overcooked, and the kale tasted more like spinach. To top it off, a family with two kids sat next to me, and the dad decided to read a book out loud, making even a simple meal quite unpleasant."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR1d3EtR213RRAB",
            "text": "We love this cafe in Brooklyn!! A tiny entrance with huge space inside, every details on the wall and table. We had  avocado toast, black coffee and scrambled eggs with smoked salmon, those are fantastic and coffee just excellent, and the price are great, we will def come back again!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN1N18tQjJRRRAB",
            "text": "We love this place! Stopped by real quick to grab something before Church. Everything seemed amazing so we will be back! Lots of indoor seating with 1 outdoor table. Lots of delicious looking items on menu and in countertop windows. Our food & drinks were delicious! I gave 4 stars because we kind of stood there awhile at counter before anyone really greeted or addressed us if we were ok, wanted to sit or order to go.  Loved that they pre-cut our sandwich in half without asking. We got the beet, goat cheese walnut bread sandwich. She got a Matcha oat latte and i got their green smoothie special. Our order was made pretty fast.\nGreat spot to go by yourself, on a date, with family or a group. We went on a Sunday morning and parking was not hard."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURpekl1eDV3RRAB",
            "text": "The food is great and freshly made. They have so many options that it’s really hard to choose from. I guess I’ll have to come here more to try out the menu.\nTo dine in, you have to take temperatures and fill out the form. The staff are always wearing masks. I felt safe to dine in. The service is great!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR3N01IQmdRRRAB",
            "text": "Extremely fresh (7 days from green to brew) Columbian coffee, and well balanced brunch menu and beautifully prepared meals. Great service. Seasonal cranberry apple cider and the smoked salmon with scrambled eggs are the best!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMtb1luZUlBEAE",
            "text": "Their omelette was really good and the French toast was super good with fresh fruits , the coffee was okay not the best but not the worst , I really enjoyed their breakfast and yes it’s pricey but so is everything else and for how heavy and huge that plate of omelette is it’s definitely worth it. It’ll fill you up if not feed 2 people lol 😆"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4cnZ6dlp3EAE",
            "text": "Delicious, great service, and you can have breakfast and brunch all day. Very accommodating for people with food allergies, with great happy employees. Another great place I found thanks to other Google users’ reviews. Yummy!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsbS0tMzFRRRAB",
            "text": "Highly recommend this coffee shop. Loved the spaciousness of the seating especially for a cafe. The food was delicious too at reasonable prices and coffee tasted great. There’s a great variety of food with vegetarian selection, sandwiches, wraps, bowls/salads. Would definitely recommend and come back again :)"
        },
        {
            "date": "1년 전",
            "language": "it",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNWLTdDLTl3RRAB",
            "text": "Il nostro posto fisso per la collaborazione, tutto ottimo ed espresso. Menù speciale nel weekend. Gentili...che dire consigliatissimo"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1a1piZ0V3EAE",
            "text": "Nice little cafe nestled in the middle of sunset park. Like other reviews have mentioned, you order at the counter, pay, and then they bring you the food. I went on a Sunday and ordered the Hanger Steak and Eggs from the brunch menu. Waited about 20-25 minutes for the food to come, but the food was delicious and nicely portioned. Overall, staff was nice, atmosphere was warm and welcoming, and food was great!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaZ0lfN0lREAE",
            "text": "Slimak Cafe is one of my most favourite cafés in Brooklyn, New York. It is specially good for brunch! The food there is healthy and the menu enlists several options. If you are a vegetarian, my recommendation you MUST try the Roasted Beets Sandwich or the Sophia Toast. Couple either with an orange juice (or mimosa)."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURod0xxSUJBEAE",
            "text": "The restaurant is decent, you will have to go up to them to order your food. The food was well made for casual brunch, the drink was also good"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkbk5TVVpnEAE",
            "text": "I forgot to take a picture because I was too excited for this breakfast, but I have been from Ohio to Florida, and let me tell you, BEST. FLIPPING. WAFFLES. ON. THE. PLANET. Unlike anything else, truly like a pastry with the texture and flavorful sweetness of a pastry. Im picky about my pancakes, but dang, these were pretty darn good, too. Normally, I insist no restaurcooks better breakfast than me at home, but I wish I could live here for this place.PLUS, the fruit was perfect, the bacon on point... the real maple syrup is just the perfect touch.\n\nAnd yesterday's lunch was BOMB. The chicken panini and salad were so fresh and filling.\n\nAnd it helps they know their way around real espresso. The body, crema, perfect foam on the top of the latte, no breaks in the microfoam or burnt milk, just *chefs kiss*\n\nAnd everyone is so freakin cute and nice!!!\n\nAnd art made me really rave about the aesthetic. I dont eat cold food. I couldn't eat fast enough. I still ate everything here.\n\nAnyone who has anything negative to say about this place or give less than 5 stars is a pretentious liar because i will never enjoy my old favorite breakfast joint again 😭 I'm ruined.\n\nThank you, everyone. we will be back every day till we leave!!!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNJbGV2dXRBRRAB",
            "text": "Big selection of diffrent food. Fresh and delicious. Great service and beautiful design. Fresh squeezed orange juice and Salamon with pouched eggs were sooo good! Definitely recommend!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURkMmVqUGxRRRAB",
            "text": "Breakfast takeout order\nOh My this food!! 😍 It was soo good!! Big up to the staff!! As soon as I got the notification my order was ready I stepped in the restaurant and everyone sitting in was “tearing their food up”. I was like okay I must be in the right place.\nWe ordered the Kitchen Sandwich with an add on of Bacon, garden breakfast smoothie, corned beef Reuben with the green salad, Americano with Almond Milk and caramel syrup.\nEverything was soo good and fresh!! Truly made my husband  and I’s morning. Definitely will be back."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNodDdHS1BREAE",
            "text": "Great energy, vibe, friendly staff and quick service. Food came quickly and is high quality. Coffee was so good as well. Check out this little Sunset Park gem!"
        },
        {
            "date": "7년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNnOVBTbTFBRRAB",
            "text": "Good spot for a casual breakfast in Brooklyn, regular price for brunch, friendly staff, neat design. No central AC, so sit close to the bar area, close to windows AC units :) For eggs Benedict which they serve, I would suggest to warm up…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNWak4yR253RRAB",
            "text": "It was awesome!! The breakfast was really delicious. The staff were friendly and attentive.\n\nI think it’s the best Cafe in Brooklyn."
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNBdmZLdWxnRRAB",
            "text": "This place just opened but I can already see myself coming here a lot.\n\nThe owners seem very friendly and they have delicious pastries, coffee, and sandwiches. Atmosphere-wise, there is nice open floor and lots of space while retaining an aire of warmth. A very nice addition to the neighborhood.\n\nBeer and wine soon to come..."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURrbTdEUVVREAE",
            "text": "This is my favorite coffee shop to visit when i'm in the area. I have tried vanilla lattes and iced coffees that are always smooth and very tasty. I've tried everything from their pastries, yogurt/smoothies, burritos, and egg meals and…"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNJMTRqa1lREAE",
            "text": "Best coffee in the area. I love drinking my latte from a cup, Slimak is one of those rare places that have actual coffee cups . And food is even better. Fresh, beautiful, simple and delicious. I fell in love with their berry tart. They…"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURodmUyeXp3RRAB",
            "text": "My fav spot for breakfast or brunch! Love everything about this place! Food, coffee drinks, staff, all of it! Always use the sauces! They are delish 🤩"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSbWVLVDl3RRAB",
            "text": "Grabbed a quick coffee here. This place is very spacious, huge. A few desserts to pick from but the menu on the wall is mainly beverages."
        }
    ],
    "reviews_count": 80
}