{
    "name": "Kai Feng Fu Dumpling House",
    "place_id": "ChIJG1_qo8tawokRjoeyM60U_Lg",
    "grid": "BK7",
    "address": "4801 8th Ave, Brooklyn, NY 11220, USA",
    "rating": 4.5,
    "user_ratings_total": 995,
    "phone_number": "(718) 437-3542",
    "reviews": [
        {
            "date": "1주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pObFZtSTFVM1pmU0U5d2JFdzFSQzFEWlVjd2JYYxAB",
            "text": "Very cheap, very fast, good food, friendly and attentive service. It’s not fancy but excellent all the same."
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2toUFVFTk9ZVzVOWjFReWRIQkZlVXBXTnpGNE9YYxAB",
            "text": "You come in with shock and you leave with awe. Dumps 10/10. You reached the pinnacle of the eating experience. This is a place you go to and then contemplate starting a food blog."
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkdlgzUkZTa0paWlZCME5YcG9NelJtVFV3NGVFRRAB",
            "text": "🐐"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2kxSVkwMXJlWGRUZVd4MWFtWkNUR2syTUhOWE9WRRAB",
            "text": "Muy buenos Dumplings"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201TlpGcFJUR0ppYW5SeVdUSk1YMTltTFZweU0wRRAB",
            "text": "I love everything about this place! I've been eating here ever since I was a little girl and the dumplings are so good!! ☺️☺️"
        },
        {
            "date": "수정일: 1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNoZ3JfRkZnEAE",
            "text": "Affordable, filling, comfort food fare. My favorite is the hot and sour soup. Prices are a little more due to inflation"
        },
        {
            "date": "2달 전",
            "language": "zh",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2psb1Z6QlFkbEpGVW0xTlkxSnBSM0JmZUZBd1luYxAB",
            "text": "点了一份牛腩面，根本不是牛腩，只是牛肉的边角料，而且咬不动，大家千万不要点这个"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tsUGVWOHpNM0ZEWm5GRmRIQmZiSGRhWVRsNk1GRRAB",
            "text": "Wow I was so hungry and they DELIVERED! Affordable and so fast, was so happy eating in here I will come back again and again 🫶🏻"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s1dlUyMXJPVEZZVTB0Vk1WQXRVR051TlZWTGFXYxAB",
            "text": "Soup dumplings had no soup in them."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xOMFlUazRSa05xT0VScGVWZFhTV2RRUW05dk5VRRAB",
            "text": "My dumpling spot"
        },
        {
            "date": "2달 전",
            "language": "zh",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21ObE9VRkNlRlpIUzFKb2NVNXBWMWQwYVdVMGQzYxAB",
            "text": "服务态度差"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25oYVgyVkROWE5xWXpRdGNIWTFPRXBaT1RaVFQzYxAB",
            "text": "I basically ordered the wrong thing. I got the boiled vegetable dumplings which were the worst things ever…All bland, too much skin, only cabbage… cry cry cry. The star of the show is their pan fried pork dumplings but unfortunately I do not eat pork. How disappointing. I also tried a tea egg which was pretty good."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT205Wk4wY3RjRjlxWVZSSlVrZzROSFo0ZEVaMFRXYxAB",
            "text": "Absolutely amazing home style place, with delicious everything. Wonton soup and fried dumplings are the best. Visited them every time we were in Borough Park, Brooklyn."
        },
        {
            "date": "수정일: 3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tRelZGSnVOalExTUdkSFRHTlFVVU5GVXpKQlgxRRAB",
            "text": "This tiny little spot serves the most delicious fried pork chive dumplings! It’s a no frills establishment service a few types of soda and water. They are pretty busy from opening to closing on most days. I tried the sesame pancake also which was pretty good on its own also I ordered 2 spring rolls."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2tzMFZrYzFaRnBJVkZadGJFSXpaMDVPWldwb1NWRRAB",
            "text": "I came before and I enjoyed their dumplings. There is a area to eat your food but it’s small"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xab2RGRXpiWGt4Ymt0TVNteGFNR04zZDBWbGMzYxAB",
            "text": "been eating here since i was a child, place went mainstream and (I think) is under new management which could be a reason why the quality of the food went down, not a lot of good value on the menu now"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT20xcGJETjJkRkUzZFZobVVtSlBlRGxIWjJ4bGIyYxAB",
            "text": "Very small place but dumpling nice and fresh"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2LUpmS1JnEAE",
            "text": "This is one of the best dumpling shops anywhere . Very unassuming and amazing at the same time ."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sQ2NuVlhZMEZPTTNFNFJVaHRVbUU1TUdwemRXYxAB",
            "text": "Food is pretty cheap for now a day. My favorite is their hot and sour soup."
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201ZlNUVTRTQzFxZWtNeGRGbEZWVGxqUTBWNVRIYxAB",
            "text": "Tbh the value is def there still, quick affordable bite! I use to come weekly. I revisited today and honestly notice a slight quality drop despite the price increase. No scallions in the scallion pancakes. Sesame pancake is fluffy and delicious. Sad they also dont offer hot oil anymore, only sriracha. The dumplings and buns are still solid, will fill you up"
        },
        {
            "date": "4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w4MWJIUnRUa1I1V1RSeVFqRktPSFpFWWxjMlJHYxAB",
            "text": "Kai Feng Fu Dumpling House in Brooklyn is one of those hidden gems that never disappoints. The prices are incredibly affordable — you can get a generous serving of dumplings without breaking the bank. They offer a great selection of both fried and steamed dumplings, each packed with flavor and made fresh.\n\nThe service is impressively fast. You order, and within minutes your food is ready. It’s a no-frills spot, but perfect for a quick, tasty meal. If you’re craving dumplings and want something delicious, cheap, and fast, this place is definitely worth a visit."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VKTHo4UEtsX0sybHhBRRAB",
            "text": "I don’t get why this place was VERY OVERHYPED on TikTok. We ordered 2 sets of dumplings — chicken & mushroom combo and shrimp & pork combo sets — which both came out soggy, bland, and doughy. Lowkey 70% of it was just dough and 30% filling. On top of that, we ordered a scallion pancake that barely had any scallions nor any green onions even though that’s traditionally part of the recipe! I’ve had better ones made at home. Lastly, we finished it off with some greasy soy sauce covered beef vegetable noodle soup that barely had any vegetables and the beef wasn’t as fresh and tasted as if they were defrosted. The slices were stiff and difficult to chew and it tasted like no effort was put into the broth at all. Seatings are very limited with barely any extra tables given that it’s a small shop. Overall, although the menu is relatively cheap, this was such a disappointing experience for a low quality meal and we will definitely NOT come back again."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VQaTctUFNUeW9uU0ZBEAE",
            "text": "Best in all of Brooklyn. Top 1 for dumplings. If you see the prices , you'll start to 🤤. They close early nowadays."
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VPenFycUMxeTY3SkpBEAE",
            "text": "I highly recommend it! One portion of eight authentic medium-sized dumplings costs $4, the service is very fast, about 1-2 minutes. Suitable for those who want to eat well and spend a minimum of money, while saving their time"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VQVGtuXzZobWVMY0tnEAE",
            "text": "Too many bones and cartilage in the pork and chives dumping making it impossible to consume without feeding chocking.  Be careful!"
        },
        {
            "date": "5달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VNSGtudHZWMzQzMUtREAE",
            "text": "Good and tasty food at a very affordable price. Customers can buy the frozen Dumplings for home as well. Recommend."
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNZb1l2T2JBEAE",
            "text": "Still a decent place for cheap and tasty dumplings. Don’t miss the scallion pancake!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNZMXVHbjFRRRAB",
            "text": "Fast cheap and delicious! They make the best dumplings!"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURvX0x5NWJREAE",
            "text": "Good authentic dumplings.  Soup is good and plentiful."
        },
        {
            "date": "6달 전",
            "language": "zh",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvbDh5QjFnRRAB",
            "text": "牛肉饼就只是芝麻饼夹卤的牛腱子肉而已  并不是牛肉馅饼"
        },
        {
            "date": "6달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNvam92d21nRRAB",
            "text": "Got the pan fried dumplings and beef noodle soup! The dumpling filling is so juicy and the skin has the perfect crispy yet chewy texture. The broth of the beef noodle soup is also so flavorful!"
        },
        {
            "date": "수정일: 6달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR5cF9UUTF3RRAB",
            "text": "Great food. The dumplings were delicious. Will definitely buy from here again."
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3bXRMM0FnEAE",
            "text": "The pork chive dumplings used to be $1 for 4 then $2 for 5 and now it's $4 for 8. It's not as good now since the skin is chewy so the taste went down. I tried the steamed mushroom dumpling which tasted ... Mediocre and it left a mushroom aftertaste which I disliked. The wonton mushroom was 10/10 refreshing and cleansing. Pork vegetable buns are flavorful and a salty overload but goes well with the mushrooms mixed in. They also used to have a backside where customers could eat but I guess they shut it down"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUN3bWY2V2RnEAE",
            "text": "the food was not fresh and old ! there is a dead rat around the kitchen area ! so diecasting. will not go buy again !"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURRbU5lU0dREAE",
            "text": "Sesame pancake, pork vegetable bun, and the beef stew soup were SO GOOD."
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRN1BTODJnRRAB",
            "text": "One of my favorites"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNRZ0p1bDlnRRAB",
            "text": "Such a cozy little spot! Really enjoyed my food. Not heavy and super flavorful. Food came out quick too!"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxMHUzd09REAE",
            "text": "Best Dumplings by far.  Not, Cheap with the amount of dumplings you get for the price !"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTURnLTZHSlVBEAE",
            "text": "Rude service 👎…"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUNnd2UycjF3RRAB",
            "text": "We’ve been here a couple times and this unassuming hole in the wall shop has some of the best pan fried dumplings in the neighbourhood. At $4 for 8 dumplings, the prices are decent. Eat them fresh and top it with some chili oil and vinegar for a good time. With that being said, I wasn’t a fan of the boiled dumplings.\nI also quite enjoyed their wonton soup (simple but made well) but not so much the noodle version - the noodles were thick like udon but on the bland side.\nMy husband enjoys the sesame pancake with beef which is a little bland for me, however it becomes a winner when you drizzle it with the chili oil and vinegar. I just wish they’d put more beef in it!\n\nThey have a pretty big menu for such a small shop and some are better than others. We’ve also tried the boiled dumplings and the pan fried buns which we were not big fans of.\n\nAll in all, a good meal for a cheap price. We’ll keep coming back for the pan friend dumplings, wonton soup, and the sesame beef pancake! All 3 together cost $11.25 and we were pretty full by the end!"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyLUtiSEx3EAE",
            "text": "Big juicy dumplings that you can't wait to get your hands on.  Feels and tastes so good sliding between your lips"
        },
        {
            "date": "8달 전",
            "language": "zh",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURBdi1hcXJnRRAB",
            "text": "每次都是买三四个生煎包 味道很不错 口感很好"
        },
        {
            "date": "수정일: 8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURzb01XTk9REAE",
            "text": "A little hole in the wall dumpling house. Fanatic food for real cheap. I highly recommend the pork buns and pork and shrimp dumplings."
        },
        {
            "date": "9달 전",
            "language": "ko",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNBclpDM0l3EAE",
            "text": "(중국 이민자불들에게)정겨운 중국식 김밥천국\n찐만두(16번)먹었는데 만두피 너무 두껍쓰\n완탕 ㄱㅊ았음 작은거시켰는데도 배불렀습니다."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfeHVENFlnEAE",
            "text": "First I didn’t give a rating for service because the employees cannot come to the table and offer any service because the space is limited. The restaurant itself is very small, having limited seating only around 3 tables. I gave 3 for atmosphere because it has a rough interior but also that you have very little space especially with the people lining up and waiting to order. The food is very well seasoned but can be on the saltier side for some people. The skin for the dumplings is not too thick or too thin. I think their choice of flour is what makes the skin good. The inside is also very moist and has deep soy flavored pork. I think adding vinegar also elevates the flavor even more. The prices are very good for the food quality and quantity you are getting. I think we got 8 panfried dumpling for 4 dollars. So I would consider this place a cheap eats. Closing statement: I recommend you bring a bev cause the food can get salty especially with the hot sauce, soy sauce and vinegar."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfMEtxUVNREAE",
            "text": "The customer service at this store was absolutely terrible and extremely rude. I was in the middle of placing my order when the cashier, a very SHORT Asian man, abruptly interrupted me by yelling, “HOW MANY?” I didn’t pay any attention to him at the time, but when my order was ready, he whistled to get my attention as if I were a dog. After I gave him the cash, he slammed the change on the table instead of handing it to me and then simply walked away without saying a single word."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNfNXBHczZBRRAB",
            "text": "My students were talking about dumplings this morning, so I was intent on having some for lunch. I looked at highly-rated places in my neighborhood and chose this venue.\n\nI had the delicious hot and sour soup, the sesame and scallions pancake and steamed veggie dumplings. All very good, although I would have preferred the dumplings pan-fried; not available today.\n\nIt's a tiny place, but you can find a seat easily.\n\n$10 for a very satisfying meal. Friendly service."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmdWRLekZREAE",
            "text": "My favorite cheap dumpling place. Service is based on getting customers their food as fast as possible. Has a few places to sit. If you need to fill your stomach but don't even want to nudge your bank let alone break it, this is the place to go for lunch."
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmX29qTWVBEAE",
            "text": "Favorite dumpling place in the area. Recommend to all my friends. Feel like home here"
        },
        {
            "date": "10달 전",
            "language": "zh-Hant",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURmcElITk9BEAE",
            "text": "華人早餐價格實在"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWNkp5Um13RRAB",
            "text": "One of the best affordable places to eat in NYC! Everything is under $10, the pan-fried dumplings are so crispy on the outside and juicy on the inside, and the scallion pancake ($2) and beef noodle soup ($7) are both very authentic and affordable as well! Will definitely be back here."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqOHV6enNRRRAB",
            "text": "Nothing beats a good cheap eats, especially when you're hungry and broke. Only have $2.50? That’s enough for a plate of fried dumplings at Kai Feng Fu Dumpling House in 8th Avenue, Brooklyn. We got 6 pan-fried pork with chives dumplings. They’re a lot more doughier than I'm used to, but the meat is flavorful. After eating one dumpling, I can guarantee you that if you eat all six of them, you will be full on $2.50. Quick service, affordable food. There's no beating the prices at this casual dumpling house."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNoNllmZ2h3RRAB",
            "text": "First off, this place is literally a hole-in-the-wall. But it's surprisingly good.\n\nI ordered the hot and sour soup, pork dumplings with leeks, pan fried dumplings with pork, and scallion pancakes.\n\nThe soup was one of the best I've ever had and I've had a lot of hot and sour soup. The heat was slightly lacking, but I fixed that with the chili oil sitting on the table. Both dumplings were tasty with the right balance of bun and meat. They are slightly bland so be aware you should use the soy and vinegar provided.\n\nThe scallion Pancakes were a bit limp. I normally like them a little more crisp.  They were also a bit thicker than I'd like, but that's a personal preference.\n\nI'm really glad I found this spot while running errands.\n\nDefinitely coming back to try other items."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQbWIyNFh3EAE",
            "text": "Not sure why some people are complaining about the wrapper. Definitely thin enough for me. The pork and chives have the correct amount. The scallion pancake is airy and crunchy. I could have two more slices of just this."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEaV9MbDJRRRAB",
            "text": "We got two orders of pan fried dumplings, one order of hot n sour soup (small), one beef sesame pancake, and two hot soy milks (small). Everything here was so delicious and for the price point (around $16) for all of this, it was a great deal! The hot soy milk was perfectly sweet and it warmed us up immediately. The pan fried dumplings were so juicy and flavorful. I’m also a big fan of hot n sour soup so of course I had to get some here. I loved how much filling there was in the soup. My bf got the beef sesame pancake and he said it was good overall and it was a perfect mix of flakey/doughy consistency. Highly recommend this spot for a quick grab and go lunch. Be mindful that it does get a bit packed around early lunch time!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEc3REenl3RRAB",
            "text": "Other reviews are correct. If you want freshly made, piping hot delicious dumplings, pancake with sliced beef, pan fried meat buns and stewed beef  noodle soup, come here. Place is tiny hole in the wall with few small tables and could use a some freshened up, but guessing this helps keep the prices low. 10 dumplings for only $4, it‘ll fill your hunger. So good that I went back the next day eating there and bought more to go. Must try! I’m hungry again just thinking the dumplings."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkdktyS1J3EAE",
            "text": "Really delicious and great prices. We ordered the fried dumplings and scallion pancakes and they were ready in two minutes. Super filling and nice and hot! Be sure to try it if you’re in the area."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1a3F5SndBRRAB",
            "text": "Absolutely delicious steamed pork & chive dumplings & spring rolls. All ingredients coarse & cut by hand. Genuine Northern Chinese style food and cheap as it gets. Recommend."
        },
        {
            "date": "10달 전",
            "language": "zh-Hant",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2MjYtanFnRRAB",
            "text": "202412\n鍋貼（八顆$4）和生煎包（一顆$1）的皮都偏厚 內餡中規中矩 很便宜 適合來快速吃飽！位子沒有很多但翻桌很快 有廁所"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKMXJHamJnEAE",
            "text": "This is my favorite dumplings and noodles soup spot in Brooklyn. Delicious, great portions, & Inexpensive. They also have frozen dumplings that you can make at home, and those are great, too."
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNZeExqR0lBEAE",
            "text": "Clearly a go-to spot in the neighborhood for no-frills, tasty classic Chinese food items such as dumplings (either pan fried or steamed, noting that steamed requires a 10 min wait as they’re freshly made), various soups including beef noodle soup, wonton soup, and hot and sour soup, as well as congee, scallion pancakes, and many other items.\n\nThe people working there are super nice, and no worries if you don’t speak Chinese as the cashier and other staff members are fine with English. The tables are self serve, and while it’s a small spot where you’ll likely need to share tables, it’s clean and well maintained, with a restroom for customers.\n\nI ordered the vegetable dumplings and the chicken and mushroom dumplings. While they weren’t anything particularly memorable, they were large, tasty and full of filling. 8 dumplings sell for between $3 and $3.50 (with the chicken and shrimp ones costing more). Another option is to get the frozen ones at $5 for 20 or 25 dumplings, which is a pretty decent deal. You can enjoy them with the hot sauce and vinegar at the tables. Next time I’ll probably go for the beef noodle soup, which looked really tasty and at only $4.50 would be a budget friendly lunch.\n\nAll in all I would definitely return if I’m in the area, and the stars are mostly awarded for the great service and surprisingly comfortable and clean environment at this price point."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURXdGFfTU1REAE",
            "text": "For Quick Snack with multiple options, this is your spot!\n\nA little hole in the wall, but those are always the best hidden gems.\n\nI got the house special dumplings, with an order of Roast pork Buns to go!\n\nBuns were amazing, and dumplings were good.\n\nTHE REAL kicker was it was less than $5 for some satisfying snacks.\n\nI'd be back next time I'm wandering around the neighborhood for some good eats."
        },
        {
            "date": "수정일: 1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ2OF9yVXpRRRAB",
            "text": "Cheap eats. Really dingey looking spot, but some of the most filling, best bang for your buck dumplings in the area. $5 goes a long way at this place. And although dumplings are their niche, their soups and pancakes are no slouch either. Would highly recommend.\n\nUpdate 10/30/24 - prices went up, but still a great option for cheap eats if you're in the area. Regular order is 8pcs for $4 now compared to my original review. Roughly $1 for 2pcs when getting more or less than 8."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURIbloybnpnRRAB",
            "text": "The dumplings were super thick and doughy and the pancakes were oily and flavorless.\n\nThe three of us have probably collectively eaten over a thousand dumplings in our lifetime and we all agreed these were the worst dumplings we’ve ever had."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5OEliVFp3EAE",
            "text": "Atmosphere is a dump. But that’s not why you go here. You come for the great dumplings for 1/10th the price of NYC restaurants. Amazing dumplings! Life Hack: buy a bag of 50 dumplings for around $12 and keep them frozen. Plan fry at home as needed!!!!"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNvN3RQRlJnEAE",
            "text": "This is the first place we stopped on our trip to Brooklyn and it was worth it. Their dumplings are reasonably priced and worth more than what they charge. We had the pork and vegetables and chicken and mushroom steamed dumplings and they…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREa2EzWkRREAE",
            "text": "Ordered pan fried dumplings and “soup dumplings”. The soup dumpling was a letdown because there was no broth in the dumplings and the skin was way too thick. Taste wise…nothing special. Also, when asked for a printed receipt, they wanted an extra $1 due to having to declare sales tax. SMH."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaZ1BPeEhREAE",
            "text": "On my NY trip I was on the hunt for some really good dumplings and since this place had pretty good reviews I decided to give it a try. First one thing i really liked was the prices. They only charge $5 and the size of the dumplings were huge, i want able to finish them and they tasted really good. If you don't allow the looks of this place to stop you I'd definitely recommend giving them a try."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROZ3RlXzZ3RRAB",
            "text": "We had high hopes but were surprised at the thickness of the dumpling skins. Hard to describe, but each of our dumplings had a wad of extra dough tucked in the middle, we suspect as a bulking agent. It was more like we were eating wads of dough with a light smear of meat inside.\n\nThen after our visit looked at lots of other reviews mentioning the skin getting thicker, going back years, which created the impression that the dumplings have gotten doughier and doughier over time! 😳"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURlaE96YUpREAE",
            "text": "The fried pork and leek dumplings were a standout item—flavorful and chewy with crispy edges. They were also extremely popular—four other people popped in to order this dish while my order was being prepared. Inexpensive and delicious!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxdmMzQ2ZnEAE",
            "text": "6 dumplings full of pork for $2.50 is amazing offer! Btw, sesame pancake is just the piece of fried flat bread with some chives and sesame on top. But dumplings are awesome"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNvLTZTNWdBRRAB",
            "text": "Took a while for a review of this place. I kept forgetting because I was busy eating their delicious dumpling. If you buy their $5 frozen dumpling packages, it is worth every penny.\n\nLets start with the location. This is a bit out if the way but properly the best dumpling. If you live in the area, it is worth it. For $1 you will get 5 dumplings or select from their long menu of snack. Their dumpling is handmade in house with homemade dough unike most places in the city. I recently felt in love with their shrimp dumplings and easily bring home frozen to be cooked in 10 minutes. From hot and sour soup to pan cake, they are all delicious. Going to their beef noodle soup, they can be a bit salty but it's good on cold night.\n\nThis place seats about 12 people max and even little in heat during winter. Great for a quick bite if you want to explore Brooklyn biggest Chinatown. Btw this place is not vegan family 😁😁. Don't expect service as well. Clean up after yourself."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxcVpQWU1REAE",
            "text": "Cheap and delicious eat. $2.50 for 6 dumplings or $4 for 10 dumplings. The dumplings are large with ample filling and nice thick fried skin.\n\nThe service was quick and the staff was friendly."
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNQbHYtbXh3RRAB",
            "text": "Literal hole in the wall and easy to miss if you don’t know it’s there. I visit this place every so often if I’m in the area. I recommend the pan fried dumplings and not the boiled ones. Unfortunately I forgot to take a photo as I devoured them too quickly.\n\nSo while the prices have gone up over the years, I think the quality of their dumplings and the taste has reflected that… and even then these dumplings are still pretty budget friendly. The dumplings are very very flavorful! And if you wanted to, eat them with the provided sauces for even more flavor! Also, eat them when they’re hot!\n\nIn addition, years ago, the dumpling skin of the pan fried dumplings used to be thicker/chewier but now it’s thinner and crispier, the way it should be!"
        },
        {
            "date": "8년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN3cXJ1Nll3EAE",
            "text": "My only go to place for fried dumplings. I've been coming here since the 2nd grade and is the best I've ever had. Can't get better than this. Great food and good deal. $1 for 4 dumplings"
        },
        {
            "date": "6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQwMk83QmNBEAE",
            "text": "New to the Sunset Park area and wanted to eat something good, cheap, and authentic for lunch so chose a place with the highest rating on Google Maps (this).\n\nThe staff are super friendly, they say hi to everyone who walks in. Service was quick; ordered the pork and mushroom noodle soup for $5 and received in 2 minutes. The taste is rich and the condiments are plenty: vinegar, sriracha, soy sauce, chili oil. Napkins, forks, chopsticks all self-serve and a restroom for customers as well. Limited seating with only 3 tables so be ready to sit with other people you don’t know.\n\nOnly con is that the broth is very salty, so not really drinkable. Fantastic value for the price, however, definitely recommend."
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNldU96WHF3RRAB",
            "text": "Delicious. Fast service. A local favorite.\nFried pork dumplings $2 for 5 pcs. Shrimp & pork shrimp dumpling $5 for 8 pcs.\n\nThere are 3 tables inside, one gender neutral bathroom."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUcllLQVl3EAE",
            "text": "We tried this place based upon the recommendations of two Facebook acquaintances.We were quite disappointed,it’s not very good, my son couldn’t even finish his beef and vegetable noodle soup no matter how hard he tried. Sorry I’m being honest, we did really like the Honey Pomelo drink"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURsdzR6amNBEAE",
            "text": "An excellent space serving the best wonton soup I have ever had!! Service is speedy quick although the Soup dumplings will take a while...\nLimited seating - to go available as well as frozen options.\nEnjoy!!"
        },
        {
            "date": "3년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMyLW9IS0tBEAE",
            "text": "Dumplings skin is very thick and doughy, well! It is what it is.. is Cheap!! I just pick the fillings, I thought I'll give it a try seen many people give a good reviews.."
        }
    ],
    "reviews_count": 80
}