{
    "name": "La Flor De Izucar Café",
    "place_id": "ChIJW_Jxw8dawokRQaJ-4MagS4c",
    "grid": "BK7",
    "address": "4021 5th Ave, Brooklyn, NY 11232, USA",
    "rating": 4.1,
    "user_ratings_total": 317,
    "phone_number": "(718) 633-1254",
    "reviews": [
        {
            "date": "6일 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2sxdk5WSjZiakJzVFRKMWJGOUtPVFJOVjBjMldFRRAB",
            "text": "I have been twice for Breakfast, and both were really good, is a most try."
        },
        {
            "date": "1주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21SWU0yY3lOR0pKUmxweVNVSmljbGxCTjNkdU9XYxAB",
            "text": "Excelente servicio rápido y limpio"
        },
        {
            "date": "1주 전",
            "language": "en",
            "rating": 2,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25sS1ptWjZaRGx2WDBZelpWRnRaMnBSYlRBNVRYYxAB",
            "text": "The food is delicious but their service can for sure be improved on. It simply doesn’t take 30 minutes for two bacon egg and cheese’s on a roll. They couldn’t even apologize or give some sort of free item as compensation. The two big “bully” but oversized managers are just there for show, they add nothing to the team when there’s only one person on grill and one on assembling the food. Owners are definitely useless here."
        },
        {
            "date": "3주 전",
            "language": "es",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25CQmVHd3dhMnh3U2xKNVFXRklOalJzUjFFdGRXYxAB",
            "text": "El pastel de mi mama lo compre aca los hacen muy ricos la crema qué le ponen no se pone amarga asi como otras por un precio de 50$ vale la pena"
        },
        {
            "date": "3주 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25FdGVUUlBUazkwUkhWR2RVVkhUVTF0VlRKaWMwRRAB",
            "text": "Just ordered the cake from this restaurant and they sent it to me this way , some one already devoured half of it. The employee on the phone told me to eat the cake and said that’s how it’s supposed to be. I’m shocked!"
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2t4cmFEQkVUa1l4Y3pkNWNYRkZYMDFDVkZOa1RrRRAB",
            "text": "Mi pareja se intoxicó con los tacos y las salsas .!\nNi mas !."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 4,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xkNlgwbEhVVzFWTVhwT2FIWjZTVGRSUm5kWE9WRRAB",
            "text": "Birria Hands (Delivered via DoorDash, cooked by Flor de Izucar)\n⭐️⭐️⭐️⭐️ (4 stars)\n\nI’ve ordered from Birria Hands a few times now — and while it’s branded like a virtual ghost kitchen, I actually tracked it down to the real kitchen behind it: Flor de Izucar in Brooklyn. Turns out it’s a Mexican café that produces genuinely great food, especially considering how late or odd their hours are.\n\nThe birria taco I got this time was fantastic — super juicy, well-seasoned meat, fresh cilantro and onion, and a tortilla that held together without falling apart. Honestly, the meat was so rich and tender it didn’t even need consomé… though, if I’m being fair, I would’ve liked it included. That’s the only reason this isn’t a 5-star review.\n\nThe food always tastes authentic, not like some copycat ghost kitchen operation trying to jump on a trend. It’s flavorful, real-deal birria — just with a missing dip on the side.\n\nStill a go-to in my delivery rotation."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 3,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2xsS2NIVkZTRGxWY0VwT1VrWlhlVVZCY0VKSk0xRRAB",
            "text": "Placed an order through Uber and did not receive my complete order - which turned out for the best. As the single tamales that I did receive were not the best. Nachos were good. The wait time vs the overall taste is not worth it."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT21KTmRXcEZjMjFoU2xwQ1VVcE9NMnBYWjNOb2IyYxAB",
            "text": "Great food"
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25WclUzSmxibGRtWVdGZlQwaElhRkp5YVZaUmQzYxAB",
            "text": "me and my mom went to buy a cake for my 16th birthday because the place where they have the best tres leches cake was closed, so we decided to buy a cake here, she paid $40 on the small blue cake. After we celebrating my 16th birthday with my family, we ate the cake and it wasn’t that good the strawberry jam tasted bad, the strawberry was dry, the cake tasted old and dry that my mom had to throw away the cake to the trash. I recommend u guys not to buy and spend 40 bucks on this old ah cake."
        },
        {
            "date": "1달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT214dmVVOUNTRzFZU2xNMFoxVjRRMnBYVURCclMxRRAB",
            "text": "Pedi un pastel pequeño (el más pequeño que tenían) pague $40 por ese pastel tan pequeño, el problema no es lo que pagué $, el problema es que el pastel sabe a pan viejo, las fresas están secas y la crema está hasta partida de lo seco y viejo. La verdad solo lo pedí ni siquiera me tomé el tiempo de verlo. Pensé que todo iba a estar bien y que iba a estar de buena calidad pero que decepción la verdad.👎🏻 mi hijo que era el cumpleañero se decepciono y todo quedó en la basura."
        },
        {
            "date": "1달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2s4eVJFNW9WRzh3ZVd0VlR6ZFRkR1ZWTUhKTGFWRRAB",
            "text": "Ordered delivery of the carne asada fries (with chicken) and their chocolate tres leches. Both were delicious but special nod to the fries, they were still very crispy despite being smothered in guacamole and sour cream. They were so good we ate it up before we could take a photo."
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2w5TGIwdFZUamRGTjJaMlEwcFBXRXBETkVsRGEzYxAB",
            "text": "overall great coffee"
        },
        {
            "date": "2달 전",
            "language": "es",
            "rating": 1,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pkblZGUkZjbUpOWjNGWGEybE1SbHBFTFRSTmVXYxAB",
            "text": "Let me start by saying the food isn’t bad. I’ve been here several times whenever I’m in Brooklyn (I live in New Jersey) The man who is sometimes behind the counter is very polite. Today I was given attitude by one of the ladies, she’s the most petite girl there. I placed my food order, approached her again after a few mins because I forgot to add something to my order. The woman who cooks the food there seemed annoyed also when her coworker asked how long it would take. She said 10-15min. No problem. There was 1 other person waiting for an order. While my toddler and I waited, I approached her a third time and asked her for something from the bakery section so I can give it to my daughter, and she looked bothered by my request. She took the biggest sigh, gave me a nasty look. Nothing is being given for free, I’m a paying costumer, so what’s with the attitude? There was like 6 girls behind the counter and she was cleaning so maybe that’s why she was annoyed? But then why couldn’t someone else help me? Do better.\n\nEmpezaré diciendo que la comida no es mala. He estado aquí varias veces cuando estoy en Brooklyn (vivo en Nueva Jersey). El hombre que a veces está detrás del mostrador es muy educado. Hoy una de las damas me dio actitud, ella es la chica más pequeña del lugar. Hice mi pedido de comida, me acerqué a ella nuevamente después de unos minutos porque olvidé agregar algo a mi pedido. La mujer que cocina la comida allí también pareció molesta cuando su compañero de trabajo preguntó cuánto tiempo tomaría. Ella dijo 10-15 minutos. Ningún problema. Había solo una otra persona esperando un pedido. Mientras mi pequeña y yo esperábamos, me acerqué a ella por tercera vez y le pedí algo de la sección de panadería para dárselo a mi hija, y ella pareció molesta por mi pedido. Ella dio el mayor suspiro y me lanzó una mirada desagradable. No se da nada gratis, soy un cliente que paga, entonces, ¿qué pasa con la actitud? Había como 6 chicas detrás del mostrador y ella estaba limpiando, ¿tal vez por eso estaba molesta? Pero entonces ¿por qué nadie más podría ayudarme?"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT201T1gyVlZVazR0ZURSYVowZGllVTVXUTBwcFJXYxAB",
            "text": "Great food all around. Always top of the list for late night cravings"
        },
        {
            "date": "2달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pSR2IzUjNXa2d3VldWallYZENXRXhTUkhSdk0wRRAB",
            "text": "A true gem of a bakery with a variety of delicious baked goods. Always worth taking a walk to Sunset Park for a treat from La Flor"
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT2pFMlRuVk5lbUpmTm5aNlZraDNlVXBQVG1sMmRHYxAB",
            "text": "Whenever I am in the neighborhood I try to visit here. Everything is absolutely delicious. So much, I had to make it a point to come a few days in a row when I first found La Flor so I could try as much as I could. I have since told many people about it. Their breads have such a home-y taste and are so so good. Also love their birria tacos. But truth be told I'm usually getting a coffee and a baked good while watching the TV when I visit. It's a good way to enjoy life."
        },
        {
            "date": "3달 전",
            "language": "en",
            "rating": 5,
            "review_id": "Ci9DQUlRQUNvZENodHljRjlvT25SclZYcDVPSEp5TVdoTVRqSmpNSFJhWjFsdmJIYxAB",
            "text": "Very good pastries 🍰"
        },
        {
            "date": "수정일: 4달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuN2VLR0pnEAE",
            "text": "I had the best experience ordering a cake for our party.  Couldn't recommend enough. They sat with us and listen to everything we wanted and even made some recommendations.\n\nI found them incredibly attentive and would get back to my emails within 1h or less. They delivered the cake to our venue and it was just what we had asked for. Here are some pictures of the custom drawings we wanted and the details they went into."
        },
        {
            "date": "5달 전",
            "language": "es",
            "rating": 2,
            "review_id": "ChdDSUhNMG9nS0VMUEFxZnFxdnNXOHVnRRAB",
            "text": "Los postres muy buenos pero el servicio con muy poca educación que tiene un hombre que estaba ahi, le dijo ala cajera que chequeara bien los billetes el simple echo de que yo tengo tatuajes. Y que después le decía no se que, dio a entender que no soy vienvenido, fue la primera vez que visitaba el lugar nunca más lo haré"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUR3dGZqMUZnEAE",
            "text": "Great coffee"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTUR3eGRPNW1BRRAB",
            "text": "I ordered Nachos de Pollo, Two Birria Tacos, a Surf N Turf Burrito,  and Mini Street-Style Tacos Carnitas (pork). The Mini Street-Style Tacos didn’t have choice for beef steak —maybe because I ordered through Uber Eats?—but I ended up with pork instead, which was actually really tasty. The nachos were delicious as well, packed with great flavors and just the right amount of toppings.\n\nI had high hopes for the Surf N Turf Burrito since I used to love the one from my favorite (now sadly defunct) Aroma Mexico restaurant. Unfortunately, this version didn’t quite live up to my expectations. I ordered steak, but the meat was thinly sliced, which wasn’t really to my liking.\n\nAs for the Birria Tacos, they were full of flavor with a nice kick of spice. I really enjoyed them, but if you're not a fan of spicy food, you might want to skip these. Overall, the meal had its highs and lows, but there were definitely some standout dishes worth trying!"
        },
        {
            "date": "7달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURRdjlLQnNRRRAB",
            "text": "Made a delivery order for tamales de mole wasted money nobody ate them and they are expensive for being so terrible. Do better they were so stale and tasted burnt"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnTURndXFfVmd3RRAB",
            "text": "I love their california burritos. They’re absolutely huge and pack a ton of flavor. I’ve had them delivered so many times i’m basically made out of california burritos. They have messed up my order, putting steak instead of chicken twice. But I still forgive them because it’s so good ❤️❤️"
        },
        {
            "date": "8달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnXzZ2X1d3EAE",
            "text": "The carrot cake and chocolate flan are the best eating experience you can treat yourself with."
        },
        {
            "date": "8달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnTUNnOHRDcktBEAE",
            "text": "Best tres leches"
        },
        {
            "date": "9달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURfOV8tOE5nEAE",
            "text": "The ham and cheese sandwich was very good, but I really wanted a tamale and the tamale they gave me was horrible. I’ve had tamales before From other restaurants and they’re usually delicious."
        },
        {
            "date": "수정일: 9달 전",
            "language": "pt",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNxOWFQcU9REAE",
            "text": "Excelente lugar."
        },
        {
            "date": "10달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN2NTVfWUlBEAE",
            "text": "\"Lo mejor de la ciudad\""
        },
        {
            "date": "10달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN2M3BHUXVBRRAB",
            "text": "Great flavors, really authentic !"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURQb2ZpZkd3EAE",
            "text": "Delicious buns! Very balanced, not too sweet, great texture"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQcWRLc0p3EAE",
            "text": "Awesome. Best conchas I’ve ever had. Also loved the tacos de pollo tinga"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNQLXBPR1p3EAE",
            "text": "The experience was ok the food was good but the way they treat you there makes you feel like if you are bothering them just by asking for some napkins , a straw or something so little they give an attitude 🤨"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzcTlPaXBRRRAB",
            "text": "Auténtica mexican food the bread 🍞 a lot variety"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 3,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzeUl6SURBEAE",
            "text": "Wait time dine-in: about 15-25min (breakfast)\nCleanliness: standard but not pristine\nFood: good but nothing amazing\nSo far I’ve had their green chilaquiles(3/5)\nBreakfast burrito(3/5)\nChicken sopes(2/5)\nOverall this is just a convenient spot if you have time to dine-in. They also accept debit/credit/applepay"
        },
        {
            "date": "11달 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzOFBUMm53RRAB",
            "text": "Authentic Mexican desserts, great flan, Mexican coffee, hot chocolate and food. Open 24 hours"
        },
        {
            "date": "11달 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUMzaV9KVxAB",
            "text": "Muy buen lugar 👌🏼…"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYbW95OEtBEAE",
            "text": "If you live in Brooklyn or traveling like me, stop by at La Flor De Izucar Cafe. Food is amazing and great service. I’ll definitely go back when I have a chance. Love it ❤️"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYNElXXzhRRRAB",
            "text": "La verdad muy buena"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURucXN5X2dBRRAB",
            "text": "Great experience. We ordered the torta mexicana al pastor and it exceeded our expectations. It was fresh, savory, and a good portion to share."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 3,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuek9mQmlBRRAB",
            "text": "Rico los tacos de arroz\nEl chocolate 👌"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuclBMaTd3RRAB",
            "text": "This store should be rated higher than it is ! Recently moved to the area and they have one of the best breakfast burritos in the city hands down. Guava y cheese pastry is to die for.\nAlso the abuelita coffee with Mexican hot chocolate beats any mocha latte around."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURidWQzaEVBEAE",
            "text": "cancelled the order after forty minutes. could have absolutely cancelled earlier. weird thAt they didn’t."
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 4,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiaHFTcWhnRRAB",
            "text": "Los tacos de birria son una delicia"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNiOUk2clhBEAE",
            "text": "Ordered delivery and everything was great!"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyZy1mVGNREAE",
            "text": "Enjoyed a delicious horchata iced latte while waiting for my chilaquiles order. Nice amount of cinnamon. I will definitely stop here for my morning coffee more often. And the chilaquiles were great. Big portion. Perfect flavour. Really reasonable price. I see why La Flor de Izucar is considered a gem in the neighborhood."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6NEl2dkxBEAE",
            "text": "Nice place to buying bread and food muy rico pan"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6elpQekN3EAE",
            "text": "Más o menos"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUNk5yRjZnRRAB",
            "text": "The best most authentic Mexican food! I’ve been searching everywhere for the perfect burrito and they have it here! Also, their salsas are excellent! Highly highly recommend."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUck1lUDZnRRAB",
            "text": "Disrespectful & arrogant servers. I was served by this lady who was unbelievably unprofessional & they really need to train their workers on better customer service, it’s not hard to be respectful of other people."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWdTZXX0JREAE",
            "text": "The best place to go and eat any time.\nMy experience was incredible, every one should come.\nFresh food, fresh ingredients, fresh vegetables\nWas amazing eat at the bakery Flor de izucar.\nThe best quality and value in food this place is better than any restaurant around.\nWhen you get the place ask for Alfredo he is ready to assisting you to give the best services and prices great team work, nice customer service.\nMy surprise was they made hand made tortillas and the flavor was the best\nI never found fresh tortillas like this place\n\nWe should have more bakery like La Flor de izucar.\nFull In line of bakery and the drinks are incredible, natural flavor they make orchata fresh at the bakery.\nI was so happy for the service they provided to my family.\nAlso the design of the food on the plates was wonderful no one display food like that.\nThis place is great to come and have family time.\nAmazing bakery one of the best in Brooklyn"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGbjdLVlJnEAE",
            "text": "good value for a lot of food!! Very delicious birria and I’m very picky about birria! Most places in nyc are not good at them but this spot is good. The consome is full of flavor and the bakery has so many delicious desserts"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxc1oyLV93RRAB",
            "text": "Great Mexican bakery! Don’t skip on the conchas and mini roscas. I preordered the chocolate rosca, it is amazing and so unique! I haven’t seen this being done anywhere else, and it is just delicious. You can also order food, too, if you want a meal. There are a lot of tables for seating. Next time, I’m coming for chilaquiles. It is located right next to Sunset Park, so you can walk off all the calories!"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5N2FTUnVRRRAB",
            "text": "Mi opinión sobre la comida es que en realidad es buena, tiene sabor y sazón.\nMi queja es por el servicio deplorable que tiene el turno nocturno, toma la orden de muy mala manera como si molestara al momento de ordenar, eso sin contar que pedí una quesadilla de birria( yo sé que las envuelven en papel aluminio por eso del calor) pero… aluminio dentro de la quesadilla es otra cosa ! Desde ese día dejé de comprar ahí donde el cliente no importa para nada al parecer y valla que es una pena por qué la comida y el pan son muy ricos, pero yo no compraré en un lugar donde me tratan mal."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNodVlTcHl3RRAB",
            "text": "Absolutely loved these Birria tacos I order while I was on my trip in NYC!!! They were deliciousss. The broth was seasoned and the beef was tender. I also order the tees leches cake which was insanely good. The the code it self was soaked with the sweetened milk and was perfectly sweet. Not too sweet, just right."
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURZdW96cVRREAE",
            "text": "La Flor Bakery has delicious Mexican food and really good strong coffee! I have tried the flautas, huaraches, sopes, tacos dorados, and papas fritas and I can highly recommend all of those dishes. This place has a friendly laid back atmosphere, good music, and fresh food at a very reasonable price ($7-$10 for a very filling and satisfying dinner). Their pound cake is also very yummy! I literally walk across the park from where I live to buy coffee here because it’s so cheap and good.\n\nUpdate: I’m back on my diet which is Keto and I ordered Bistek a la Mexicana with chicken instead and avocado on the side....so flavorful and delicious by far the best thing I’ve had there. And it was $7.50 and very filling."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSbEpfY0dREAE",
            "text": "This bakery has been here for years! And honestly I can say that the amazing taste in cakes has just gotten better and better!!! Working with them on capturing the image you want of the cake and the flavors is so easy. Customer service is really satisfactory."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUREejRhRjdRRRAB",
            "text": "This is hands down the best burrito I’ve had in NYC. I got a chorizo and egg burrito and brought it to the park. The salsas they gave also were so gooood. Can’t wait to come back!"
        },
        {
            "date": "수정일: 6년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURBd19mbkhnEAE",
            "text": "I have been going here since I was a little girl the food is delicious. My family trusts them with birthday cakes and other special occasions. Trust me they will not disappoint you. It's family owned"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNodzQtN1FBEAE",
            "text": "Haven’t found better torta sandwiches in the city, but still nothing close to what you can find in Mexico. Their chicken milenesa torta ($11) is HUGE, fresh bread filled with crispy breaded chicken cutlet, beans, avocado, Oaxaca cheese, and…"
        },
        {
            "date": "1년 전",
            "language": "es",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5MVBUc0lREAE",
            "text": "Mal servicio. Pedi una la cemita de milanes de pollo. Pero el pollo estaba muy duro y muy seco. Y además muy quemado. Hasta se me fue el apetito😡.    No lo recomiendo…"
        },
        {
            "date": "3년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtbC1QM3B3RRAB",
            "text": "Good place  for take a breakfast mexicano end more Good  prices buen  lugar  para  desayunar"
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEMmRyanZRRRAB",
            "text": "My family ordered a custom cake for a sweet 15 and it was a terrible experience. The tiered cake was place crookedly at the center of the table, was missing the birthday girls name, and ended up going bad when we served it to guests. We were left extremely disappointed as we had several guests complain that night that the cake was sour tasting. For an almost $1000 cake, we expected something a lot better. When reaching out to the owners son the following day, we were told on the phone that the cake had likely gone bad because the venue was too hot however this took place in the beginning of February and the venue was actually cold on that day. Additionally the cake arrived around 7pm and we cut it around 11pm…. I have ordered cakes from other bakeries before and never had a cake go bad in the span of 4 hours. We were offered no sort of compensation for any of these things, no sort of apology and eventually they stopped picking up our phone calls. Our family’s event was ruined by this awful experience and despite having heard such great things and having had other family members order from this place before … we will definitely never be coming back! This is not how a business should treat unsatisfied customers."
        },
        {
            "date": "4년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURTdm92U2VREAE",
            "text": "Amazing bakery, great food, great service.\nThis cake was made for my gender reveal and although I didn’t have a specific image of what I wanted my cake but I explained what I wanted and they did just that. Super delicious also . Thank you."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 4,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGdVllZ1VnEAE",
            "text": "Food is delicious and service is very good! 👍🏼💪\nI go here often with a good friend of mine from the neighborhood. Their Baked items are good too---the chocolate chip cookies are amazing! It's a small family owned establishment and the customers are typically treated with respect. My only gripe happen yesterday when I ordered the Birria Torta for the advertised price of $9.50; it should've been $10.34 (after tax)... I was charged $11.16 (after tax)! The price increased to $10.25---however, they never changed the price in their menus. I made the person at the cashier aware of the price discrepancy. Unfortunately, he didn't honor the original price 😖 Beware, ask for pricing before placing your order..."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUROdm9YeVBnEAE",
            "text": "My favorite, most reliably delicious place to order takeout from. I’ve had the fajitas (if they could lower the salt a touch it would be perfect), shrimp tacos, birria tacos, and great each time. So are the desserts and drinks!"
        },
        {
            "date": "2년 전",
            "language": "es",
            "rating": 5,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSX3VmUWZREAE",
            "text": "Excelente sitio para comer bueno y a buen precio. Recomiendo el Multigrain Croissant, estaba delicioso."
        },
        {
            "date": "수정일: 3년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURtNTlUMF9BRRAB",
            "text": "Wow the Tamales Rajas are so damn good and  the Iced Cappuccino was a perfect match !"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwcmJTd05REAE",
            "text": "Called to order breakfast and was on hold for over ten minutes. Placed my order and was giving my credit card number, to some rude and unprofessional woman. She stated that they don't take credit cards anymore only if you use one of the online apps they'll accept it. I told her that's the same thing and asked what was difference. She then proceeded to argue over the phone with me, about how its a loss for the restaurant when they accept cards.  Really bad service and very argumentative. I have been there in person and the waitresses only flirt with the drunk customers and ignore or feel bothered when they have to take care of other patrons. So why work, if you only want to flirt with the clientele?"
        },
        {
            "date": "수정일: 2년 전",
            "language": "en",
            "rating": 2,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQtcjUza1pnEAE",
            "text": "The young girl at the cash register is a bit all over the place. This is a busy restaurant so it’s important to have someone on the register that is equipped for that. She has given away my food and incorrectly taken my order on two different occasions. Please get someone on the register who is a good listener so you don’t lose customers. The staff can be rude sometimes, I don’t feel very welcomed when I’m there but I do enjoy the food. I think I’ll have to see what future experiences are like before making a final conclusion.\n\nUpdate: I tried really hard to get over the bad customer service but I feel terrible after giving this business my money. Every time I come in they treat me like they wish I would turn around and leave. They are still upset me (kitchen staff and cash register) for previous visits where they had to remake my food (FOR IT BEING INCORRECTLY MADE/GIVEN AWAY) It’s as if they believe it’s my fault that they can’t get my order right. I find if you are not Latinx they will not treat you with respect."
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 1,
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURod1oySUVnEAE",
            "text": "Worst experience ever! I have ordered from this place before but lastnight order was different. I decided to order through ubereats not only was the driver in the area for over 30 mins while my food was there ready. But when I called the restaurant to ask if there is anything they can do the lady told me it wasn’t her problem and that she will deliver it with their delivery guy only if I pay him a hefty tip other then that I won’t get my food. After I just place the order for over $50! With tip. That is just ridiculous. So I went ahead and contacted Uber and cancelled the order without charge including a credit for the inconvenience. But rest assure I will never order from them again! Their customer service sucks and rude! Then restaurants wonder why customers get upset and don’t return. Further more they are well over priced two small meals for $50 is outrageous."
        },
        {
            "date": "1년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEaTRlbndBRRAB",
            "text": "Chorizo Breakfast Burrito, Guava & Cheese pastry, Chocolate Tres Leches cake were all DELICIOUS! Definitely ordering here again🙌\n\nOnly constructive criticism I’d give is on the Horchata iced coffee. It was lacking a lot of horchata flavor, and very watery.\n\nI’d suggest keeping it separate by having an iced horchata drink topped with espresso!\nIt’d be so creamy and delicious!!"
        },
        {
            "date": "2년 전",
            "language": "en",
            "rating": 5,
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGcFl2NXRBRRAB",
            "text": "it's so hard to find good mexican food in the city, but i know i can always trust la flor. i ordered un champurrado y tamales verdes and i almost shed a tear. the champurrado was the perfect blend of thick and chocolatey. you guys never miss!!! (i also love la torta de milanesa de pollo... its literally a perfect torta)."
        }
    ],
    "reviews_count": 73
}